RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/**
  ******************************************************************************
  * @file    dsp2_blback_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_BLBACK_REG_H__
#define __DSP2_BLBACK_REG_H__

#include "bl808.h"

/* 0x314 : ccr_coef_A */
#define DSP2_BLBACK_CCR_COEF_A_OFFSET (0x314)
#define DSP2_BLBACK_A11_PRE           DSP2_BLBACK_A11_PRE
#define DSP2_BLBACK_A11_PRE_POS       (16U)
#define DSP2_BLBACK_A11_PRE_LEN       (12U)
#define DSP2_BLBACK_A11_PRE_MSK       (((1U << DSP2_BLBACK_A11_PRE_LEN) - 1) << DSP2_BLBACK_A11_PRE_POS)
#define DSP2_BLBACK_A11_PRE_UMSK      (~(((1U << DSP2_BLBACK_A11_PRE_LEN) - 1) << DSP2_BLBACK_A11_PRE_POS))

/* 0x318 : ccr_coef_B */
#define DSP2_BLBACK_CCR_COEF_B_OFFSET (0x318)
#define DSP2_BLBACK_A12_PRE           DSP2_BLBACK_A12_PRE
#define DSP2_BLBACK_A12_PRE_POS       (0U)
#define DSP2_BLBACK_A12_PRE_LEN       (12U)
#define DSP2_BLBACK_A12_PRE_MSK       (((1U << DSP2_BLBACK_A12_PRE_LEN) - 1) << DSP2_BLBACK_A12_PRE_POS)
#define DSP2_BLBACK_A12_PRE_UMSK      (~(((1U << DSP2_BLBACK_A12_PRE_LEN) - 1) << DSP2_BLBACK_A12_PRE_POS))
#define DSP2_BLBACK_A13_PRE           DSP2_BLBACK_A13_PRE
#define DSP2_BLBACK_A13_PRE_POS       (16U)
#define DSP2_BLBACK_A13_PRE_LEN       (12U)
#define DSP2_BLBACK_A13_PRE_MSK       (((1U << DSP2_BLBACK_A13_PRE_LEN) - 1) << DSP2_BLBACK_A13_PRE_POS)
#define DSP2_BLBACK_A13_PRE_UMSK      (~(((1U << DSP2_BLBACK_A13_PRE_LEN) - 1) << DSP2_BLBACK_A13_PRE_POS))

/* 0x31C : ccr_coef_C */
#define DSP2_BLBACK_CCR_COEF_C_OFFSET (0x31C)
#define DSP2_BLBACK_A21_PRE           DSP2_BLBACK_A21_PRE
#define DSP2_BLBACK_A21_PRE_POS       (0U)
#define DSP2_BLBACK_A21_PRE_LEN       (12U)
#define DSP2_BLBACK_A21_PRE_MSK       (((1U << DSP2_BLBACK_A21_PRE_LEN) - 1) << DSP2_BLBACK_A21_PRE_POS)
#define DSP2_BLBACK_A21_PRE_UMSK      (~(((1U << DSP2_BLBACK_A21_PRE_LEN) - 1) << DSP2_BLBACK_A21_PRE_POS))
#define DSP2_BLBACK_A22_PRE           DSP2_BLBACK_A22_PRE
#define DSP2_BLBACK_A22_PRE_POS       (16U)
#define DSP2_BLBACK_A22_PRE_LEN       (12U)
#define DSP2_BLBACK_A22_PRE_MSK       (((1U << DSP2_BLBACK_A22_PRE_LEN) - 1) << DSP2_BLBACK_A22_PRE_POS)
#define DSP2_BLBACK_A22_PRE_UMSK      (~(((1U << DSP2_BLBACK_A22_PRE_LEN) - 1) << DSP2_BLBACK_A22_PRE_POS))

/* 0x320 : ccr_coef_D */
#define DSP2_BLBACK_CCR_COEF_D_OFFSET (0x320)
#define DSP2_BLBACK_A23_PRE           DSP2_BLBACK_A23_PRE
#define DSP2_BLBACK_A23_PRE_POS       (0U)
#define DSP2_BLBACK_A23_PRE_LEN       (12U)
#define DSP2_BLBACK_A23_PRE_MSK       (((1U << DSP2_BLBACK_A23_PRE_LEN) - 1) << DSP2_BLBACK_A23_PRE_POS)
#define DSP2_BLBACK_A23_PRE_UMSK      (~(((1U << DSP2_BLBACK_A23_PRE_LEN) - 1) << DSP2_BLBACK_A23_PRE_POS))
#define DSP2_BLBACK_A31_PRE           DSP2_BLBACK_A31_PRE
#define DSP2_BLBACK_A31_PRE_POS       (16U)
#define DSP2_BLBACK_A31_PRE_LEN       (12U)
#define DSP2_BLBACK_A31_PRE_MSK       (((1U << DSP2_BLBACK_A31_PRE_LEN) - 1) << DSP2_BLBACK_A31_PRE_POS)
#define DSP2_BLBACK_A31_PRE_UMSK      (~(((1U << DSP2_BLBACK_A31_PRE_LEN) - 1) << DSP2_BLBACK_A31_PRE_POS))

/* 0x324 : ccr_coef_E */
#define DSP2_BLBACK_CCR_COEF_E_OFFSET (0x324)
#define DSP2_BLBACK_A32_PRE           DSP2_BLBACK_A32_PRE
#define DSP2_BLBACK_A32_PRE_POS       (0U)
#define DSP2_BLBACK_A32_PRE_LEN       (12U)
#define DSP2_BLBACK_A32_PRE_MSK       (((1U << DSP2_BLBACK_A32_PRE_LEN) - 1) << DSP2_BLBACK_A32_PRE_POS)
#define DSP2_BLBACK_A32_PRE_UMSK      (~(((1U << DSP2_BLBACK_A32_PRE_LEN) - 1) << DSP2_BLBACK_A32_PRE_POS))
#define DSP2_BLBACK_A33_PRE           DSP2_BLBACK_A33_PRE
#define DSP2_BLBACK_A33_PRE_POS       (16U)
#define DSP2_BLBACK_A33_PRE_LEN       (12U)
#define DSP2_BLBACK_A33_PRE_MSK       (((1U << DSP2_BLBACK_A33_PRE_LEN) - 1) << DSP2_BLBACK_A33_PRE_POS)
#define DSP2_BLBACK_A33_PRE_UMSK      (~(((1U << DSP2_BLBACK_A33_PRE_LEN) - 1) << DSP2_BLBACK_A33_PRE_POS))

/* 0x328 : gamma_A */
#define DSP2_BLBACK_GAMMA_A_OFFSET       (0x328)
#define DSP2_BLBACK_GAMMA_ON_PRE         DSP2_BLBACK_GAMMA_ON_PRE
#define DSP2_BLBACK_GAMMA_ON_PRE_POS     (0U)
#define DSP2_BLBACK_GAMMA_ON_PRE_LEN     (1U)
#define DSP2_BLBACK_GAMMA_ON_PRE_MSK     (((1U << DSP2_BLBACK_GAMMA_ON_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_ON_PRE_POS)
#define DSP2_BLBACK_GAMMA_ON_PRE_UMSK    (~(((1U << DSP2_BLBACK_GAMMA_ON_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_ON_PRE_POS))
#define DSP2_BLBACK_GAMMA_EB_PRE         DSP2_BLBACK_GAMMA_EB_PRE
#define DSP2_BLBACK_GAMMA_EB_PRE_POS     (1U)
#define DSP2_BLBACK_GAMMA_EB_PRE_LEN     (1U)
#define DSP2_BLBACK_GAMMA_EB_PRE_MSK     (((1U << DSP2_BLBACK_GAMMA_EB_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_EB_PRE_POS)
#define DSP2_BLBACK_GAMMA_EB_PRE_UMSK    (~(((1U << DSP2_BLBACK_GAMMA_EB_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_EB_PRE_POS))
#define DSP2_BLBACK_BL_GAMMA_EN_PRE      DSP2_BLBACK_BL_GAMMA_EN_PRE
#define DSP2_BLBACK_BL_GAMMA_EN_PRE_POS  (4U)
#define DSP2_BLBACK_BL_GAMMA_EN_PRE_LEN  (1U)
#define DSP2_BLBACK_BL_GAMMA_EN_PRE_MSK  (((1U << DSP2_BLBACK_BL_GAMMA_EN_PRE_LEN) - 1) << DSP2_BLBACK_BL_GAMMA_EN_PRE_POS)
#define DSP2_BLBACK_BL_GAMMA_EN_PRE_UMSK (~(((1U << DSP2_BLBACK_BL_GAMMA_EN_PRE_LEN) - 1) << DSP2_BLBACK_BL_GAMMA_EN_PRE_POS))

