RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x33C : conv_mode */
#define DSP2_BLBACK_CONV_MODE_OFFSET (0x33C)
#define DSP2_BLBACK_CONV_MODE_W      DSP2_BLBACK_CONV_MODE_W
#define DSP2_BLBACK_CONV_MODE_W_POS  (0U)
#define DSP2_BLBACK_CONV_MODE_W_LEN  (1U)
#define DSP2_BLBACK_CONV_MODE_W_MSK  (((1U << DSP2_BLBACK_CONV_MODE_W_LEN) - 1) << DSP2_BLBACK_CONV_MODE_W_POS)
#define DSP2_BLBACK_CONV_MODE_W_UMSK (~(((1U << DSP2_BLBACK_CONV_MODE_W_LEN) - 1) << DSP2_BLBACK_CONV_MODE_W_POS))

/* 0x34C : YUVC_A */
#define DSP2_BLBACK_YUVC_A_OFFSET         (0x34C)
#define DSP2_BLBACK_YBRIGHTNESS_W         DSP2_BLBACK_YBRIGHTNESS_W
#define DSP2_BLBACK_YBRIGHTNESS_W_POS     (0U)
#define DSP2_BLBACK_YBRIGHTNESS_W_LEN     (8U)
#define DSP2_BLBACK_YBRIGHTNESS_W_MSK     (((1U << DSP2_BLBACK_YBRIGHTNESS_W_LEN) - 1) << DSP2_BLBACK_YBRIGHTNESS_W_POS)
#define DSP2_BLBACK_YBRIGHTNESS_W_UMSK    (~(((1U << DSP2_BLBACK_YBRIGHTNESS_W_LEN) - 1) << DSP2_BLBACK_YBRIGHTNESS_W_POS))
#define DSP2_BLBACK_YCONTRAST_W           DSP2_BLBACK_YCONTRAST_W
#define DSP2_BLBACK_YCONTRAST_W_POS       (8U)
#define DSP2_BLBACK_YCONTRAST_W_LEN       (8U)
#define DSP2_BLBACK_YCONTRAST_W_MSK       (((1U << DSP2_BLBACK_YCONTRAST_W_LEN) - 1) << DSP2_BLBACK_YCONTRAST_W_POS)
#define DSP2_BLBACK_YCONTRAST_W_UMSK      (~(((1U << DSP2_BLBACK_YCONTRAST_W_LEN) - 1) << DSP2_BLBACK_YCONTRAST_W_POS))
#define DSP2_BLBACK_CBSATURATION_PRE      DSP2_BLBACK_CBSATURATION_PRE
#define DSP2_BLBACK_CBSATURATION_PRE_POS  (16U)
#define DSP2_BLBACK_CBSATURATION_PRE_LEN  (8U)
#define DSP2_BLBACK_CBSATURATION_PRE_MSK  (((1U << DSP2_BLBACK_CBSATURATION_PRE_LEN) - 1) << DSP2_BLBACK_CBSATURATION_PRE_POS)
#define DSP2_BLBACK_CBSATURATION_PRE_UMSK (~(((1U << DSP2_BLBACK_CBSATURATION_PRE_LEN) - 1) << DSP2_BLBACK_CBSATURATION_PRE_POS))
#define DSP2_BLBACK_CRSATURATION_PRE      DSP2_BLBACK_CRSATURATION_PRE
#define DSP2_BLBACK_CRSATURATION_PRE_POS  (24U)
#define DSP2_BLBACK_CRSATURATION_PRE_LEN  (8U)
#define DSP2_BLBACK_CRSATURATION_PRE_MSK  (((1U << DSP2_BLBACK_CRSATURATION_PRE_LEN) - 1) << DSP2_BLBACK_CRSATURATION_PRE_POS)
#define DSP2_BLBACK_CRSATURATION_PRE_UMSK (~(((1U << DSP2_BLBACK_CRSATURATION_PRE_LEN) - 1) << DSP2_BLBACK_CRSATURATION_PRE_POS))

/* 0x350 : YUVC_B */
#define DSP2_BLBACK_YUVC_B_OFFSET                 (0x350)
#define DSP2_BLBACK_SPECIALMODE_W                 DSP2_BLBACK_SPECIALMODE_W
#define DSP2_BLBACK_SPECIALMODE_W_POS             (0U)
#define DSP2_BLBACK_SPECIALMODE_W_LEN             (3U)
#define DSP2_BLBACK_SPECIALMODE_W_MSK             (((1U << DSP2_BLBACK_SPECIALMODE_W_LEN) - 1) << DSP2_BLBACK_SPECIALMODE_W_POS)
#define DSP2_BLBACK_SPECIALMODE_W_UMSK            (~(((1U << DSP2_BLBACK_SPECIALMODE_W_LEN) - 1) << DSP2_BLBACK_SPECIALMODE_W_POS))
#define DSP2_BLBACK_C444TO422FILTERINGMODE_W      DSP2_BLBACK_C444TO422FILTERINGMODE_W
#define DSP2_BLBACK_C444TO422FILTERINGMODE_W_POS  (4U)
#define DSP2_BLBACK_C444TO422FILTERINGMODE_W_LEN  (1U)
#define DSP2_BLBACK_C444TO422FILTERINGMODE_W_MSK  (((1U << DSP2_BLBACK_C444TO422FILTERINGMODE_W_LEN) - 1) << DSP2_BLBACK_C444TO422FILTERINGMODE_W_POS)
#define DSP2_BLBACK_C444TO422FILTERINGMODE_W_UMSK (~(((1U << DSP2_BLBACK_C444TO422FILTERINGMODE_W_LEN) - 1) << DSP2_BLBACK_C444TO422FILTERINGMODE_W_POS))
#define DSP2_BLBACK_SEPIACB_W                     DSP2_BLBACK_SEPIACB_W
#define DSP2_BLBACK_SEPIACB_W_POS                 (8U)
#define DSP2_BLBACK_SEPIACB_W_LEN                 (8U)
#define DSP2_BLBACK_SEPIACB_W_MSK                 (((1U << DSP2_BLBACK_SEPIACB_W_LEN) - 1) << DSP2_BLBACK_SEPIACB_W_POS)
#define DSP2_BLBACK_SEPIACB_W_UMSK                (~(((1U << DSP2_BLBACK_SEPIACB_W_LEN) - 1) << DSP2_BLBACK_SEPIACB_W_POS))
#define DSP2_BLBACK_SEPIACR_W                     DSP2_BLBACK_SEPIACR_W
#define DSP2_BLBACK_SEPIACR_W_POS                 (16U)
#define DSP2_BLBACK_SEPIACR_W_LEN                 (8U)
#define DSP2_BLBACK_SEPIACR_W_MSK                 (((1U << DSP2_BLBACK_SEPIACR_W_LEN) - 1) << DSP2_BLBACK_SEPIACR_W_POS)
#define DSP2_BLBACK_SEPIACR_W_UMSK                (~(((1U << DSP2_BLBACK_SEPIACR_W_LEN) - 1) << DSP2_BLBACK_SEPIACR_W_POS))
#define DSP2_BLBACK_SOLARTHRED_W                  DSP2_BLBACK_SOLARTHRED_W
#define DSP2_BLBACK_SOLARTHRED_W_POS              (24U)
#define DSP2_BLBACK_SOLARTHRED_W_LEN              (8U)
#define DSP2_BLBACK_SOLARTHRED_W_MSK              (((1U << DSP2_BLBACK_SOLARTHRED_W_LEN) - 1) << DSP2_BLBACK_SOLARTHRED_W_POS)
#define DSP2_BLBACK_SOLARTHRED_W_UMSK             (~(((1U << DSP2_BLBACK_SOLARTHRED_W_LEN) - 1) << DSP2_BLBACK_SOLARTHRED_W_POS))

/* 0x354 : DNR_A */
#define DSP2_BLBACK_DNR_A_OFFSET              (0x354)
#define DSP2_BLBACK_NOISE_LEVEL_PRE           DSP2_BLBACK_NOISE_LEVEL_PRE
#define DSP2_BLBACK_NOISE_LEVEL_PRE_POS       (0U)
#define DSP2_BLBACK_NOISE_LEVEL_PRE_LEN       (6U)
#define DSP2_BLBACK_NOISE_LEVEL_PRE_MSK       (((1U << DSP2_BLBACK_NOISE_LEVEL_PRE_LEN) - 1) << DSP2_BLBACK_NOISE_LEVEL_PRE_POS)
#define DSP2_BLBACK_NOISE_LEVEL_PRE_UMSK      (~(((1U << DSP2_BLBACK_NOISE_LEVEL_PRE_LEN) - 1) << DSP2_BLBACK_NOISE_LEVEL_PRE_POS))
#define DSP2_BLBACK_NR_HSIZE_PRE              DSP2_BLBACK_NR_HSIZE_PRE
#define DSP2_BLBACK_NR_HSIZE_PRE_POS          (8U)
#define DSP2_BLBACK_NR_HSIZE_PRE_LEN          (16U)
#define DSP2_BLBACK_NR_HSIZE_PRE_MSK          (((1U << DSP2_BLBACK_NR_HSIZE_PRE_LEN) - 1) << DSP2_BLBACK_NR_HSIZE_PRE_POS)
#define DSP2_BLBACK_NR_HSIZE_PRE_UMSK         (~(((1U << DSP2_BLBACK_NR_HSIZE_PRE_LEN) - 1) << DSP2_BLBACK_NR_HSIZE_PRE_POS))
#define DSP2_BLBACK_FILT_STRENGTH_2D_PRE      DSP2_BLBACK_FILT_STRENGTH_2D_PRE
#define DSP2_BLBACK_FILT_STRENGTH_2D_PRE_POS  (24U)
#define DSP2_BLBACK_FILT_STRENGTH_2D_PRE_LEN  (4U)
#define DSP2_BLBACK_FILT_STRENGTH_2D_PRE_MSK  (((1U << DSP2_BLBACK_FILT_STRENGTH_2D_PRE_LEN) - 1) << DSP2_BLBACK_FILT_STRENGTH_2D_PRE_POS)
#define DSP2_BLBACK_FILT_STRENGTH_2D_PRE_UMSK (~(((1U << DSP2_BLBACK_FILT_STRENGTH_2D_PRE_LEN) - 1) << DSP2_BLBACK_FILT_STRENGTH_2D_PRE_POS))
#define DSP2_BLBACK_FILT_STRENGTH_3D_PRE      DSP2_BLBACK_FILT_STRENGTH_3D_PRE
#define DSP2_BLBACK_FILT_STRENGTH_3D_PRE_POS  (28U)
#define DSP2_BLBACK_FILT_STRENGTH_3D_PRE_LEN  (4U)
#define DSP2_BLBACK_FILT_STRENGTH_3D_PRE_MSK  (((1U << DSP2_BLBACK_FILT_STRENGTH_3D_PRE_LEN) - 1) << DSP2_BLBACK_FILT_STRENGTH_3D_PRE_POS)
#define DSP2_BLBACK_FILT_STRENGTH_3D_PRE_UMSK (~(((1U << DSP2_BLBACK_FILT_STRENGTH_3D_PRE_LEN) - 1) << DSP2_BLBACK_FILT_STRENGTH_3D_PRE_POS))

/* 0x358 : DNR_B */
#define DSP2_BLBACK_DNR_B_OFFSET       (0x358)
#define DSP2_BLBACK_CBCR_SELECT_W      DSP2_BLBACK_CBCR_SELECT_W
#define DSP2_BLBACK_CBCR_SELECT_W_POS  (8U)
#define DSP2_BLBACK_CBCR_SELECT_W_LEN  (1U)
#define DSP2_BLBACK_CBCR_SELECT_W_MSK  (((1U << DSP2_BLBACK_CBCR_SELECT_W_LEN) - 1) << DSP2_BLBACK_CBCR_SELECT_W_POS)
#define DSP2_BLBACK_CBCR_SELECT_W_UMSK (~(((1U << DSP2_BLBACK_CBCR_SELECT_W_LEN) - 1) << DSP2_BLBACK_CBCR_SELECT_W_POS))
#define DSP2_BLBACK_OUT_FORMAT_W       DSP2_BLBACK_OUT_FORMAT_W
#define DSP2_BLBACK_OUT_FORMAT_W_POS   (9U)
#define DSP2_BLBACK_OUT_FORMAT_W_LEN   (2U)
#define DSP2_BLBACK_OUT_FORMAT_W_MSK   (((1U << DSP2_BLBACK_OUT_FORMAT_W_LEN) - 1) << DSP2_BLBACK_OUT_FORMAT_W_POS)
#define DSP2_BLBACK_OUT_FORMAT_W_UMSK  (~(((1U << DSP2_BLBACK_OUT_FORMAT_W_LEN) - 1) << DSP2_BLBACK_OUT_FORMAT_W_POS))

/* 0x360 : BLEE_0 */
#define DSP2_BLBACK_BLEE_0_OFFSET      (0x360)
#define DSP2_BLBACK_EE_EB_PRE          DSP2_BLBACK_EE_EB_PRE
#define DSP2_BLBACK_EE_EB_PRE_POS      (0U)
#define DSP2_BLBACK_EE_EB_PRE_LEN      (1U)
#define DSP2_BLBACK_EE_EB_PRE_MSK      (((1U << DSP2_BLBACK_EE_EB_PRE_LEN) - 1) << DSP2_BLBACK_EE_EB_PRE_POS)
#define DSP2_BLBACK_EE_EB_PRE_UMSK     (~(((1U << DSP2_BLBACK_EE_EB_PRE_LEN) - 1) << DSP2_BLBACK_EE_EB_PRE_POS))
#define DSP2_BLBACK_OVRSHT_EB_PRE      DSP2_BLBACK_OVRSHT_EB_PRE
#define DSP2_BLBACK_OVRSHT_EB_PRE_POS  (1U)
#define DSP2_BLBACK_OVRSHT_EB_PRE_LEN  (1U)
#define DSP2_BLBACK_OVRSHT_EB_PRE_MSK  (((1U << DSP2_BLBACK_OVRSHT_EB_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_EB_PRE_POS)
#define DSP2_BLBACK_OVRSHT_EB_PRE_UMSK (~(((1U << DSP2_BLBACK_OVRSHT_EB_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_EB_PRE_POS))
#define DSP2_BLBACK_TXT_THR_PRE        DSP2_BLBACK_TXT_THR_PRE
#define DSP2_BLBACK_TXT_THR_PRE_POS    (16U)
#define DSP2_BLBACK_TXT_THR_PRE_LEN    (9U)
#define DSP2_BLBACK_TXT_THR_PRE_MSK    (((1U << DSP2_BLBACK_TXT_THR_PRE_LEN) - 1) << DSP2_BLBACK_TXT_THR_PRE_POS)
#define DSP2_BLBACK_TXT_THR_PRE_UMSK   (~(((1U << DSP2_BLBACK_TXT_THR_PRE_LEN) - 1) << DSP2_BLBACK_TXT_THR_PRE_POS))

