RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x364 : BLEE_1 */
#define DSP2_BLBACK_BLEE_1_OFFSET     (0x364)
#define DSP2_BLBACK_THRESH1_PRE       DSP2_BLBACK_THRESH1_PRE
#define DSP2_BLBACK_THRESH1_PRE_POS   (0U)
#define DSP2_BLBACK_THRESH1_PRE_LEN   (7U)
#define DSP2_BLBACK_THRESH1_PRE_MSK   (((1U << DSP2_BLBACK_THRESH1_PRE_LEN) - 1) << DSP2_BLBACK_THRESH1_PRE_POS)
#define DSP2_BLBACK_THRESH1_PRE_UMSK  (~(((1U << DSP2_BLBACK_THRESH1_PRE_LEN) - 1) << DSP2_BLBACK_THRESH1_PRE_POS))
#define DSP2_BLBACK_THRESH2_PRE       DSP2_BLBACK_THRESH2_PRE
#define DSP2_BLBACK_THRESH2_PRE_POS   (8U)
#define DSP2_BLBACK_THRESH2_PRE_LEN   (7U)
#define DSP2_BLBACK_THRESH2_PRE_MSK   (((1U << DSP2_BLBACK_THRESH2_PRE_LEN) - 1) << DSP2_BLBACK_THRESH2_PRE_POS)
#define DSP2_BLBACK_THRESH2_PRE_UMSK  (~(((1U << DSP2_BLBACK_THRESH2_PRE_LEN) - 1) << DSP2_BLBACK_THRESH2_PRE_POS))
#define DSP2_BLBACK_FLAT_THR_PRE      DSP2_BLBACK_FLAT_THR_PRE
#define DSP2_BLBACK_FLAT_THR_PRE_POS  (16U)
#define DSP2_BLBACK_FLAT_THR_PRE_LEN  (8U)
#define DSP2_BLBACK_FLAT_THR_PRE_MSK  (((1U << DSP2_BLBACK_FLAT_THR_PRE_LEN) - 1) << DSP2_BLBACK_FLAT_THR_PRE_POS)
#define DSP2_BLBACK_FLAT_THR_PRE_UMSK (~(((1U << DSP2_BLBACK_FLAT_THR_PRE_LEN) - 1) << DSP2_BLBACK_FLAT_THR_PRE_POS))

/* 0x368 : BLEE_2 */
#define DSP2_BLBACK_BLEE_2_OFFSET       (0x368)
#define DSP2_BLBACK_OVRSHT_POS_PRE      DSP2_BLBACK_OVRSHT_POS_PRE
#define DSP2_BLBACK_OVRSHT_POS_PRE_POS  (0U)
#define DSP2_BLBACK_OVRSHT_POS_PRE_LEN  (7U)
#define DSP2_BLBACK_OVRSHT_POS_PRE_MSK  (((1U << DSP2_BLBACK_OVRSHT_POS_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_POS_PRE_POS)
#define DSP2_BLBACK_OVRSHT_POS_PRE_UMSK (~(((1U << DSP2_BLBACK_OVRSHT_POS_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_POS_PRE_POS))
#define DSP2_BLBACK_OVRSHT_NEG_PRE      DSP2_BLBACK_OVRSHT_NEG_PRE
#define DSP2_BLBACK_OVRSHT_NEG_PRE_POS  (8U)
#define DSP2_BLBACK_OVRSHT_NEG_PRE_LEN  (7U)
#define DSP2_BLBACK_OVRSHT_NEG_PRE_MSK  (((1U << DSP2_BLBACK_OVRSHT_NEG_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_NEG_PRE_POS)
#define DSP2_BLBACK_OVRSHT_NEG_PRE_UMSK (~(((1U << DSP2_BLBACK_OVRSHT_NEG_PRE_LEN) - 1) << DSP2_BLBACK_OVRSHT_NEG_PRE_POS))
#define DSP2_BLBACK_POSEE_STR_PRE       DSP2_BLBACK_POSEE_STR_PRE
#define DSP2_BLBACK_POSEE_STR_PRE_POS   (16U)
#define DSP2_BLBACK_POSEE_STR_PRE_LEN   (7U)
#define DSP2_BLBACK_POSEE_STR_PRE_MSK   (((1U << DSP2_BLBACK_POSEE_STR_PRE_LEN) - 1) << DSP2_BLBACK_POSEE_STR_PRE_POS)
#define DSP2_BLBACK_POSEE_STR_PRE_UMSK  (~(((1U << DSP2_BLBACK_POSEE_STR_PRE_LEN) - 1) << DSP2_BLBACK_POSEE_STR_PRE_POS))
#define DSP2_BLBACK_NEGEE_STR_PRE       DSP2_BLBACK_NEGEE_STR_PRE
#define DSP2_BLBACK_NEGEE_STR_PRE_POS   (24U)
#define DSP2_BLBACK_NEGEE_STR_PRE_LEN   (7U)
#define DSP2_BLBACK_NEGEE_STR_PRE_MSK   (((1U << DSP2_BLBACK_NEGEE_STR_PRE_LEN) - 1) << DSP2_BLBACK_NEGEE_STR_PRE_POS)
#define DSP2_BLBACK_NEGEE_STR_PRE_UMSK  (~(((1U << DSP2_BLBACK_NEGEE_STR_PRE_LEN) - 1) << DSP2_BLBACK_NEGEE_STR_PRE_POS))

/* 0x36C : BLEE_3 */
#define DSP2_BLBACK_BLEE_3_OFFSET     (0x36C)
#define DSP2_BLBACK_EDGE_THR_PRE      DSP2_BLBACK_EDGE_THR_PRE
#define DSP2_BLBACK_EDGE_THR_PRE_POS  (0U)
#define DSP2_BLBACK_EDGE_THR_PRE_LEN  (16U)
#define DSP2_BLBACK_EDGE_THR_PRE_MSK  (((1U << DSP2_BLBACK_EDGE_THR_PRE_LEN) - 1) << DSP2_BLBACK_EDGE_THR_PRE_POS)
#define DSP2_BLBACK_EDGE_THR_PRE_UMSK (~(((1U << DSP2_BLBACK_EDGE_THR_PRE_LEN) - 1) << DSP2_BLBACK_EDGE_THR_PRE_POS))
#define DSP2_BLBACK_NR_STR_PRE        DSP2_BLBACK_NR_STR_PRE
#define DSP2_BLBACK_NR_STR_PRE_POS    (16U)
#define DSP2_BLBACK_NR_STR_PRE_LEN    (8U)
#define DSP2_BLBACK_NR_STR_PRE_MSK    (((1U << DSP2_BLBACK_NR_STR_PRE_LEN) - 1) << DSP2_BLBACK_NR_STR_PRE_POS)
#define DSP2_BLBACK_NR_STR_PRE_UMSK   (~(((1U << DSP2_BLBACK_NR_STR_PRE_LEN) - 1) << DSP2_BLBACK_NR_STR_PRE_POS))

/* 0x370 : BLEE_4 */
#define DSP2_BLBACK_BLEE_4_OFFSET      (0x370)
#define DSP2_BLBACK_LUMA_WGT0_PRE      DSP2_BLBACK_LUMA_WGT0_PRE
#define DSP2_BLBACK_LUMA_WGT0_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT0_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT0_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT0_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT0_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT0_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT0_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT0_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT1_PRE      DSP2_BLBACK_LUMA_WGT1_PRE
#define DSP2_BLBACK_LUMA_WGT1_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT1_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT1_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT1_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT1_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT1_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT1_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT1_PRE_POS))

/* 0x374 : BLEE_5 */
#define DSP2_BLBACK_BLEE_5_OFFSET      (0x374)
#define DSP2_BLBACK_LUMA_WGT2_PRE      DSP2_BLBACK_LUMA_WGT2_PRE
#define DSP2_BLBACK_LUMA_WGT2_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT2_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT2_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT2_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT2_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT2_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT2_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT2_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT3_PRE      DSP2_BLBACK_LUMA_WGT3_PRE
#define DSP2_BLBACK_LUMA_WGT3_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT3_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT3_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT3_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT3_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT3_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT3_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT3_PRE_POS))

/* 0x378 : BLEE_6 */
#define DSP2_BLBACK_BLEE_6_OFFSET      (0x378)
#define DSP2_BLBACK_LUMA_WGT4_PRE      DSP2_BLBACK_LUMA_WGT4_PRE
#define DSP2_BLBACK_LUMA_WGT4_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT4_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT4_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT4_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT4_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT4_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT4_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT4_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT5_PRE      DSP2_BLBACK_LUMA_WGT5_PRE
#define DSP2_BLBACK_LUMA_WGT5_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT5_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT5_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT5_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT5_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT5_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT5_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT5_PRE_POS))

/* 0x37C : BLEE_7 */
#define DSP2_BLBACK_BLEE_7_OFFSET      (0x37C)
#define DSP2_BLBACK_LUMA_WGT6_PRE      DSP2_BLBACK_LUMA_WGT6_PRE
#define DSP2_BLBACK_LUMA_WGT6_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT6_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT6_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT6_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT6_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT6_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT6_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT6_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT7_PRE      DSP2_BLBACK_LUMA_WGT7_PRE
#define DSP2_BLBACK_LUMA_WGT7_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT7_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT7_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT7_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT7_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT7_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT7_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT7_PRE_POS))

