RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x380 : BLEE_8 */
#define DSP2_BLBACK_BLEE_8_OFFSET      (0x380)
#define DSP2_BLBACK_LUMA_WGT8_PRE      DSP2_BLBACK_LUMA_WGT8_PRE
#define DSP2_BLBACK_LUMA_WGT8_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT8_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT8_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT8_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT8_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT8_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT8_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT8_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT9_PRE      DSP2_BLBACK_LUMA_WGT9_PRE
#define DSP2_BLBACK_LUMA_WGT9_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT9_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT9_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT9_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT9_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT9_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT9_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT9_PRE_POS))

/* 0x384 : BLEE_9 */
#define DSP2_BLBACK_BLEE_9_OFFSET       (0x384)
#define DSP2_BLBACK_LUMA_WGT10_PRE      DSP2_BLBACK_LUMA_WGT10_PRE
#define DSP2_BLBACK_LUMA_WGT10_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT10_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT10_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT10_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT10_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT10_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT10_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT10_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT11_PRE      DSP2_BLBACK_LUMA_WGT11_PRE
#define DSP2_BLBACK_LUMA_WGT11_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT11_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT11_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT11_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT11_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT11_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT11_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT11_PRE_POS))

/* 0x388 : BLEE_A */
#define DSP2_BLBACK_BLEE_A_OFFSET       (0x388)
#define DSP2_BLBACK_LUMA_WGT12_PRE      DSP2_BLBACK_LUMA_WGT12_PRE
#define DSP2_BLBACK_LUMA_WGT12_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT12_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT12_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT12_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT12_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT12_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT12_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT12_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT13_PRE      DSP2_BLBACK_LUMA_WGT13_PRE
#define DSP2_BLBACK_LUMA_WGT13_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT13_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT13_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT13_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT13_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT13_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT13_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT13_PRE_POS))

/* 0x38C : BLEE_B */
#define DSP2_BLBACK_BLEE_B_OFFSET       (0x38C)
#define DSP2_BLBACK_LUMA_WGT14_PRE      DSP2_BLBACK_LUMA_WGT14_PRE
#define DSP2_BLBACK_LUMA_WGT14_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT14_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT14_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT14_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT14_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT14_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT14_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT14_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT15_PRE      DSP2_BLBACK_LUMA_WGT15_PRE
#define DSP2_BLBACK_LUMA_WGT15_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT15_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT15_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT15_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT15_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT15_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT15_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT15_PRE_POS))

/* 0x390 : BLEE_C */
#define DSP2_BLBACK_BLEE_C_OFFSET       (0x390)
#define DSP2_BLBACK_LUMA_WGT16_PRE      DSP2_BLBACK_LUMA_WGT16_PRE
#define DSP2_BLBACK_LUMA_WGT16_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT16_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT16_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT16_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT16_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT16_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT16_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT16_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT17_PRE      DSP2_BLBACK_LUMA_WGT17_PRE
#define DSP2_BLBACK_LUMA_WGT17_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT17_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT17_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT17_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT17_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT17_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT17_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT17_PRE_POS))

/* 0x394 : BLEE_D */
#define DSP2_BLBACK_BLEE_D_OFFSET       (0x394)
#define DSP2_BLBACK_LUMA_WGT18_PRE      DSP2_BLBACK_LUMA_WGT18_PRE
#define DSP2_BLBACK_LUMA_WGT18_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT18_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT18_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT18_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT18_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT18_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT18_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT18_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT19_PRE      DSP2_BLBACK_LUMA_WGT19_PRE
#define DSP2_BLBACK_LUMA_WGT19_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT19_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT19_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT19_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT19_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT19_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT19_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT19_PRE_POS))

/* 0x398 : BLEE_E */
#define DSP2_BLBACK_BLEE_E_OFFSET       (0x398)
#define DSP2_BLBACK_LUMA_WGT20_PRE      DSP2_BLBACK_LUMA_WGT20_PRE
#define DSP2_BLBACK_LUMA_WGT20_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT20_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT20_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT20_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT20_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT20_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT20_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT20_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT21_PRE      DSP2_BLBACK_LUMA_WGT21_PRE
#define DSP2_BLBACK_LUMA_WGT21_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT21_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT21_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT21_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT21_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT21_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT21_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT21_PRE_POS))

/* 0x39C : BLEE_F */
#define DSP2_BLBACK_BLEE_F_OFFSET       (0x39C)
#define DSP2_BLBACK_LUMA_WGT22_PRE      DSP2_BLBACK_LUMA_WGT22_PRE
#define DSP2_BLBACK_LUMA_WGT22_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT22_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT22_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT22_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT22_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT22_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT22_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT22_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT23_PRE      DSP2_BLBACK_LUMA_WGT23_PRE
#define DSP2_BLBACK_LUMA_WGT23_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT23_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT23_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT23_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT23_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT23_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT23_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT23_PRE_POS))

/* 0x3A0 : BLEE_10 */
#define DSP2_BLBACK_BLEE_10_OFFSET      (0x3A0)
#define DSP2_BLBACK_LUMA_WGT24_PRE      DSP2_BLBACK_LUMA_WGT24_PRE
#define DSP2_BLBACK_LUMA_WGT24_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT24_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT24_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT24_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT24_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT24_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT24_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT24_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT25_PRE      DSP2_BLBACK_LUMA_WGT25_PRE
#define DSP2_BLBACK_LUMA_WGT25_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT25_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT25_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT25_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT25_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT25_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT25_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT25_PRE_POS))

/* 0x3A4 : BLEE_11 */
#define DSP2_BLBACK_BLEE_11_OFFSET      (0x3A4)
#define DSP2_BLBACK_LUMA_WGT26_PRE      DSP2_BLBACK_LUMA_WGT26_PRE
#define DSP2_BLBACK_LUMA_WGT26_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT26_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT26_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT26_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT26_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT26_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT26_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT26_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT27_PRE      DSP2_BLBACK_LUMA_WGT27_PRE
#define DSP2_BLBACK_LUMA_WGT27_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT27_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT27_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT27_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT27_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT27_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT27_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT27_PRE_POS))

/* 0x3A8 : BLEE_12 */
#define DSP2_BLBACK_BLEE_12_OFFSET      (0x3A8)
#define DSP2_BLBACK_LUMA_WGT28_PRE      DSP2_BLBACK_LUMA_WGT28_PRE
#define DSP2_BLBACK_LUMA_WGT28_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT28_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT28_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT28_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT28_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT28_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT28_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT28_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT29_PRE      DSP2_BLBACK_LUMA_WGT29_PRE
#define DSP2_BLBACK_LUMA_WGT29_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT29_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT29_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT29_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT29_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT29_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT29_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT29_PRE_POS))

/* 0x3AC : BLEE_13 */
#define DSP2_BLBACK_BLEE_13_OFFSET      (0x3AC)
#define DSP2_BLBACK_LUMA_WGT30_PRE      DSP2_BLBACK_LUMA_WGT30_PRE
#define DSP2_BLBACK_LUMA_WGT30_PRE_POS  (0U)
#define DSP2_BLBACK_LUMA_WGT30_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT30_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT30_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT30_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT30_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT30_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT30_PRE_POS))
#define DSP2_BLBACK_LUMA_WGT31_PRE      DSP2_BLBACK_LUMA_WGT31_PRE
#define DSP2_BLBACK_LUMA_WGT31_PRE_POS  (16U)
#define DSP2_BLBACK_LUMA_WGT31_PRE_LEN  (10U)
#define DSP2_BLBACK_LUMA_WGT31_PRE_MSK  (((1U << DSP2_BLBACK_LUMA_WGT31_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT31_PRE_POS)
#define DSP2_BLBACK_LUMA_WGT31_PRE_UMSK (~(((1U << DSP2_BLBACK_LUMA_WGT31_PRE_LEN) - 1) << DSP2_BLBACK_LUMA_WGT31_PRE_POS))

