RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x3B0 : CS1 */
#define DSP2_BLBACK_CS1_OFFSET           (0x3B0)
#define DSP2_BLBACK_CS1_GREY_TH_PRE      DSP2_BLBACK_CS1_GREY_TH_PRE
#define DSP2_BLBACK_CS1_GREY_TH_PRE_POS  (0U)
#define DSP2_BLBACK_CS1_GREY_TH_PRE_LEN  (4U)
#define DSP2_BLBACK_CS1_GREY_TH_PRE_MSK  (((1U << DSP2_BLBACK_CS1_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_CS1_GREY_TH_PRE_POS)
#define DSP2_BLBACK_CS1_GREY_TH_PRE_UMSK (~(((1U << DSP2_BLBACK_CS1_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_CS1_GREY_TH_PRE_POS))
#define DSP2_BLBACK_CS1_ENABLE_PRE       DSP2_BLBACK_CS1_ENABLE_PRE
#define DSP2_BLBACK_CS1_ENABLE_PRE_POS   (4U)
#define DSP2_BLBACK_CS1_ENABLE_PRE_LEN   (1U)
#define DSP2_BLBACK_CS1_ENABLE_PRE_MSK   (((1U << DSP2_BLBACK_CS1_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CS1_ENABLE_PRE_POS)
#define DSP2_BLBACK_CS1_ENABLE_PRE_UMSK  (~(((1U << DSP2_BLBACK_CS1_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CS1_ENABLE_PRE_POS))
#define DSP2_BLBACK_CS1_WEIGHT_PRE       DSP2_BLBACK_CS1_WEIGHT_PRE
#define DSP2_BLBACK_CS1_WEIGHT_PRE_POS   (8U)
#define DSP2_BLBACK_CS1_WEIGHT_PRE_LEN   (5U)
#define DSP2_BLBACK_CS1_WEIGHT_PRE_MSK   (((1U << DSP2_BLBACK_CS1_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CS1_WEIGHT_PRE_POS)
#define DSP2_BLBACK_CS1_WEIGHT_PRE_UMSK  (~(((1U << DSP2_BLBACK_CS1_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CS1_WEIGHT_PRE_POS))
#define DSP2_BLBACK_CS1_GAIN_PRE         DSP2_BLBACK_CS1_GAIN_PRE
#define DSP2_BLBACK_CS1_GAIN_PRE_POS     (16U)
#define DSP2_BLBACK_CS1_GAIN_PRE_LEN     (9U)
#define DSP2_BLBACK_CS1_GAIN_PRE_MSK     (((1U << DSP2_BLBACK_CS1_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_CS1_GAIN_PRE_POS)
#define DSP2_BLBACK_CS1_GAIN_PRE_UMSK    (~(((1U << DSP2_BLBACK_CS1_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_CS1_GAIN_PRE_POS))

/* 0x3B4 : CS2 */
#define DSP2_BLBACK_CS2_OFFSET           (0x3B4)
#define DSP2_BLBACK_CS2_GREY_TH_PRE      DSP2_BLBACK_CS2_GREY_TH_PRE
#define DSP2_BLBACK_CS2_GREY_TH_PRE_POS  (0U)
#define DSP2_BLBACK_CS2_GREY_TH_PRE_LEN  (4U)
#define DSP2_BLBACK_CS2_GREY_TH_PRE_MSK  (((1U << DSP2_BLBACK_CS2_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_CS2_GREY_TH_PRE_POS)
#define DSP2_BLBACK_CS2_GREY_TH_PRE_UMSK (~(((1U << DSP2_BLBACK_CS2_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_CS2_GREY_TH_PRE_POS))
#define DSP2_BLBACK_CS2_ENABLE_PRE       DSP2_BLBACK_CS2_ENABLE_PRE
#define DSP2_BLBACK_CS2_ENABLE_PRE_POS   (4U)
#define DSP2_BLBACK_CS2_ENABLE_PRE_LEN   (1U)
#define DSP2_BLBACK_CS2_ENABLE_PRE_MSK   (((1U << DSP2_BLBACK_CS2_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CS2_ENABLE_PRE_POS)
#define DSP2_BLBACK_CS2_ENABLE_PRE_UMSK  (~(((1U << DSP2_BLBACK_CS2_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CS2_ENABLE_PRE_POS))
#define DSP2_BLBACK_CS2_WEIGHT_PRE       DSP2_BLBACK_CS2_WEIGHT_PRE
#define DSP2_BLBACK_CS2_WEIGHT_PRE_POS   (8U)
#define DSP2_BLBACK_CS2_WEIGHT_PRE_LEN   (5U)
#define DSP2_BLBACK_CS2_WEIGHT_PRE_MSK   (((1U << DSP2_BLBACK_CS2_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CS2_WEIGHT_PRE_POS)
#define DSP2_BLBACK_CS2_WEIGHT_PRE_UMSK  (~(((1U << DSP2_BLBACK_CS2_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CS2_WEIGHT_PRE_POS))
#define DSP2_BLBACK_CS2_GAIN_PRE         DSP2_BLBACK_CS2_GAIN_PRE
#define DSP2_BLBACK_CS2_GAIN_PRE_POS     (16U)
#define DSP2_BLBACK_CS2_GAIN_PRE_LEN     (9U)
#define DSP2_BLBACK_CS2_GAIN_PRE_MSK     (((1U << DSP2_BLBACK_CS2_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_CS2_GAIN_PRE_POS)
#define DSP2_BLBACK_CS2_GAIN_PRE_UMSK    (~(((1U << DSP2_BLBACK_CS2_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_CS2_GAIN_PRE_POS))

/* 0x3FC : DUMMY_CTRL */
#define DSP2_BLBACK_DUMMY_CTRL_OFFSET        (0x3FC)
#define DSP2_BLBACK_REG_BL444TO422_EN_W      DSP2_BLBACK_REG_BL444TO422_EN_W
#define DSP2_BLBACK_REG_BL444TO422_EN_W_POS  (0U)
#define DSP2_BLBACK_REG_BL444TO422_EN_W_LEN  (1U)
#define DSP2_BLBACK_REG_BL444TO422_EN_W_MSK  (((1U << DSP2_BLBACK_REG_BL444TO422_EN_W_LEN) - 1) << DSP2_BLBACK_REG_BL444TO422_EN_W_POS)
#define DSP2_BLBACK_REG_BL444TO422_EN_W_UMSK (~(((1U << DSP2_BLBACK_REG_BL444TO422_EN_W_LEN) - 1) << DSP2_BLBACK_REG_BL444TO422_EN_W_POS))

/* 0x900 : WDR_0 */
#define DSP2_BLBACK_WDR_0_OFFSET         (0x900)
#define DSP2_BLBACK_WDR_EN_PRE           DSP2_BLBACK_WDR_EN_PRE
#define DSP2_BLBACK_WDR_EN_PRE_POS       (0U)
#define DSP2_BLBACK_WDR_EN_PRE_LEN       (1U)
#define DSP2_BLBACK_WDR_EN_PRE_MSK       (((1U << DSP2_BLBACK_WDR_EN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_EN_PRE_POS)
#define DSP2_BLBACK_WDR_EN_PRE_UMSK      (~(((1U << DSP2_BLBACK_WDR_EN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_EN_PRE_POS))
#define DSP2_BLBACK_BLWDR_BUF_IDX_R      DSP2_BLBACK_BLWDR_BUF_IDX_R
#define DSP2_BLBACK_BLWDR_BUF_IDX_R_POS  (1U)
#define DSP2_BLBACK_BLWDR_BUF_IDX_R_LEN  (1U)
#define DSP2_BLBACK_BLWDR_BUF_IDX_R_MSK  (((1U << DSP2_BLBACK_BLWDR_BUF_IDX_R_LEN) - 1) << DSP2_BLBACK_BLWDR_BUF_IDX_R_POS)
#define DSP2_BLBACK_BLWDR_BUF_IDX_R_UMSK (~(((1U << DSP2_BLBACK_BLWDR_BUF_IDX_R_LEN) - 1) << DSP2_BLBACK_BLWDR_BUF_IDX_R_POS))
#define DSP2_BLBACK_BLWDR_W_CNT_R        DSP2_BLBACK_BLWDR_W_CNT_R
#define DSP2_BLBACK_BLWDR_W_CNT_R_POS    (4U)
#define DSP2_BLBACK_BLWDR_W_CNT_R_LEN    (5U)
#define DSP2_BLBACK_BLWDR_W_CNT_R_MSK    (((1U << DSP2_BLBACK_BLWDR_W_CNT_R_LEN) - 1) << DSP2_BLBACK_BLWDR_W_CNT_R_POS)
#define DSP2_BLBACK_BLWDR_W_CNT_R_UMSK   (~(((1U << DSP2_BLBACK_BLWDR_W_CNT_R_LEN) - 1) << DSP2_BLBACK_BLWDR_W_CNT_R_POS))
#define DSP2_BLBACK_WDR_CS_GAIN_PRE      DSP2_BLBACK_WDR_CS_GAIN_PRE
#define DSP2_BLBACK_WDR_CS_GAIN_PRE_POS  (16U)
#define DSP2_BLBACK_WDR_CS_GAIN_PRE_LEN  (13U)
#define DSP2_BLBACK_WDR_CS_GAIN_PRE_MSK  (((1U << DSP2_BLBACK_WDR_CS_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_GAIN_PRE_POS)
#define DSP2_BLBACK_WDR_CS_GAIN_PRE_UMSK (~(((1U << DSP2_BLBACK_WDR_CS_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_GAIN_PRE_POS))

/* 0x904 : WDR_CS_0 */
#define DSP2_BLBACK_WDR_CS_0_OFFSET         (0x904)
#define DSP2_BLBACK_WDR_CS_EN_PRE           DSP2_BLBACK_WDR_CS_EN_PRE
#define DSP2_BLBACK_WDR_CS_EN_PRE_POS       (0U)
#define DSP2_BLBACK_WDR_CS_EN_PRE_LEN       (1U)
#define DSP2_BLBACK_WDR_CS_EN_PRE_MSK       (((1U << DSP2_BLBACK_WDR_CS_EN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_EN_PRE_POS)
#define DSP2_BLBACK_WDR_CS_EN_PRE_UMSK      (~(((1U << DSP2_BLBACK_WDR_CS_EN_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_EN_PRE_POS))
#define DSP2_BLBACK_WDR_CS_WEIGHT_PRE       DSP2_BLBACK_WDR_CS_WEIGHT_PRE
#define DSP2_BLBACK_WDR_CS_WEIGHT_PRE_POS   (8U)
#define DSP2_BLBACK_WDR_CS_WEIGHT_PRE_LEN   (5U)
#define DSP2_BLBACK_WDR_CS_WEIGHT_PRE_MSK   (((1U << DSP2_BLBACK_WDR_CS_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_WEIGHT_PRE_POS)
#define DSP2_BLBACK_WDR_CS_WEIGHT_PRE_UMSK  (~(((1U << DSP2_BLBACK_WDR_CS_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_WEIGHT_PRE_POS))
#define DSP2_BLBACK_WDR_CS_GREY_TH_PRE      DSP2_BLBACK_WDR_CS_GREY_TH_PRE
#define DSP2_BLBACK_WDR_CS_GREY_TH_PRE_POS  (16U)
#define DSP2_BLBACK_WDR_CS_GREY_TH_PRE_LEN  (8U)
#define DSP2_BLBACK_WDR_CS_GREY_TH_PRE_MSK  (((1U << DSP2_BLBACK_WDR_CS_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_GREY_TH_PRE_POS)
#define DSP2_BLBACK_WDR_CS_GREY_TH_PRE_UMSK (~(((1U << DSP2_BLBACK_WDR_CS_GREY_TH_PRE_LEN) - 1) << DSP2_BLBACK_WDR_CS_GREY_TH_PRE_POS))

/* 0x908 : WDR_HIST_1 */
#define DSP2_BLBACK_WDR_HIST_1_OFFSET         (0x908)
#define DSP2_BLBACK_HIST_ROI0_EN_PRE          DSP2_BLBACK_HIST_ROI0_EN_PRE
#define DSP2_BLBACK_HIST_ROI0_EN_PRE_POS      (0U)
#define DSP2_BLBACK_HIST_ROI0_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI0_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI0_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI0_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI0_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI0_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI0_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_POS  (8U)
#define DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI0_WEIGHT_PRE_POS))
#define DSP2_BLBACK_HIST_ROI1_EN_PRE          DSP2_BLBACK_HIST_ROI1_EN_PRE
#define DSP2_BLBACK_HIST_ROI1_EN_PRE_POS      (16U)
#define DSP2_BLBACK_HIST_ROI1_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI1_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI1_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI1_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI1_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI1_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI1_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_POS  (24U)
#define DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI1_WEIGHT_PRE_POS))

/* 0x90C : WDR_HIST_2 */
#define DSP2_BLBACK_WDR_HIST_2_OFFSET         (0x90C)
#define DSP2_BLBACK_HIST_ROI2_EN_PRE          DSP2_BLBACK_HIST_ROI2_EN_PRE
#define DSP2_BLBACK_HIST_ROI2_EN_PRE_POS      (0U)
#define DSP2_BLBACK_HIST_ROI2_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI2_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI2_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI2_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI2_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI2_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI2_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_POS  (8U)
#define DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI2_WEIGHT_PRE_POS))
#define DSP2_BLBACK_HIST_ROI3_EN_PRE          DSP2_BLBACK_HIST_ROI3_EN_PRE
#define DSP2_BLBACK_HIST_ROI3_EN_PRE_POS      (16U)
#define DSP2_BLBACK_HIST_ROI3_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI3_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI3_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI3_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI3_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI3_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI3_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_POS  (24U)
#define DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI3_WEIGHT_PRE_POS))

/* 0x910 : WDR_HIST_3 */
#define DSP2_BLBACK_WDR_HIST_3_OFFSET         (0x910)
#define DSP2_BLBACK_HIST_ROI4_EN_PRE          DSP2_BLBACK_HIST_ROI4_EN_PRE
#define DSP2_BLBACK_HIST_ROI4_EN_PRE_POS      (0U)
#define DSP2_BLBACK_HIST_ROI4_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI4_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI4_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI4_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI4_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI4_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI4_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_POS  (8U)
#define DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI4_WEIGHT_PRE_POS))
#define DSP2_BLBACK_HIST_ROI5_EN_PRE          DSP2_BLBACK_HIST_ROI5_EN_PRE
#define DSP2_BLBACK_HIST_ROI5_EN_PRE_POS      (16U)
#define DSP2_BLBACK_HIST_ROI5_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI5_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI5_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI5_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI5_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI5_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI5_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_POS  (24U)
#define DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI5_WEIGHT_PRE_POS))

