RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x914 : WDR_HIST_4 */
#define DSP2_BLBACK_WDR_HIST_4_OFFSET         (0x914)
#define DSP2_BLBACK_HIST_ROI6_EN_PRE          DSP2_BLBACK_HIST_ROI6_EN_PRE
#define DSP2_BLBACK_HIST_ROI6_EN_PRE_POS      (0U)
#define DSP2_BLBACK_HIST_ROI6_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI6_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI6_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI6_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI6_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI6_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI6_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_POS  (8U)
#define DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI6_WEIGHT_PRE_POS))
#define DSP2_BLBACK_HIST_ROI7_EN_PRE          DSP2_BLBACK_HIST_ROI7_EN_PRE
#define DSP2_BLBACK_HIST_ROI7_EN_PRE_POS      (16U)
#define DSP2_BLBACK_HIST_ROI7_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_HIST_ROI7_EN_PRE_MSK      (((1U << DSP2_BLBACK_HIST_ROI7_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI7_EN_PRE_POS)
#define DSP2_BLBACK_HIST_ROI7_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_HIST_ROI7_EN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI7_EN_PRE_POS))
#define DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE      DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE
#define DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_POS  (24U)
#define DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_LEN  (4U)
#define DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_POS)
#define DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_HIST_ROI7_WEIGHT_PRE_POS))

/* 0x918 : WDR_HIST_5 */
#define DSP2_BLBACK_WDR_HIST_5_OFFSET    (0x918)
#define DSP2_BLBACK_HIST_X0_MAX_PRE      DSP2_BLBACK_HIST_X0_MAX_PRE
#define DSP2_BLBACK_HIST_X0_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X0_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X0_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X0_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X0_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X0_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X0_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X0_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X0_MIN_PRE      DSP2_BLBACK_HIST_X0_MIN_PRE
#define DSP2_BLBACK_HIST_X0_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X0_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X0_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X0_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X0_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X0_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X0_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X0_MIN_PRE_POS))

/* 0x91C : WDR_HIST_6 */
#define DSP2_BLBACK_WDR_HIST_6_OFFSET    (0x91C)
#define DSP2_BLBACK_HIST_Y0_MAX_PRE      DSP2_BLBACK_HIST_Y0_MAX_PRE
#define DSP2_BLBACK_HIST_Y0_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y0_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y0_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y0_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y0_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y0_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y0_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y0_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y0_MIN_PRE      DSP2_BLBACK_HIST_Y0_MIN_PRE
#define DSP2_BLBACK_HIST_Y0_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y0_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y0_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y0_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y0_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y0_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y0_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y0_MIN_PRE_POS))

/* 0x920 : WDR_HIST_7 */
#define DSP2_BLBACK_WDR_HIST_7_OFFSET    (0x920)
#define DSP2_BLBACK_HIST_X1_MAX_PRE      DSP2_BLBACK_HIST_X1_MAX_PRE
#define DSP2_BLBACK_HIST_X1_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X1_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X1_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X1_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X1_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X1_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X1_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X1_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X1_MIN_PRE      DSP2_BLBACK_HIST_X1_MIN_PRE
#define DSP2_BLBACK_HIST_X1_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X1_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X1_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X1_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X1_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X1_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X1_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X1_MIN_PRE_POS))

/* 0x924 : WDR_HIST_8 */
#define DSP2_BLBACK_WDR_HIST_8_OFFSET    (0x924)
#define DSP2_BLBACK_HIST_Y1_MAX_PRE      DSP2_BLBACK_HIST_Y1_MAX_PRE
#define DSP2_BLBACK_HIST_Y1_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y1_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y1_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y1_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y1_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y1_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y1_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y1_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y1_MIN_PRE      DSP2_BLBACK_HIST_Y1_MIN_PRE
#define DSP2_BLBACK_HIST_Y1_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y1_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y1_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y1_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y1_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y1_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y1_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y1_MIN_PRE_POS))

/* 0x928 : WDR_HIST_9 */
#define DSP2_BLBACK_WDR_HIST_9_OFFSET    (0x928)
#define DSP2_BLBACK_HIST_X2_MAX_PRE      DSP2_BLBACK_HIST_X2_MAX_PRE
#define DSP2_BLBACK_HIST_X2_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X2_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X2_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X2_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X2_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X2_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X2_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X2_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X2_MIN_PRE      DSP2_BLBACK_HIST_X2_MIN_PRE
#define DSP2_BLBACK_HIST_X2_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X2_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X2_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X2_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X2_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X2_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X2_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X2_MIN_PRE_POS))

/* 0x92C : WDR_HIST_10 */
#define DSP2_BLBACK_WDR_HIST_10_OFFSET   (0x92C)
#define DSP2_BLBACK_HIST_Y2_MAX_PRE      DSP2_BLBACK_HIST_Y2_MAX_PRE
#define DSP2_BLBACK_HIST_Y2_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y2_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y2_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y2_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y2_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y2_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y2_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y2_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y2_MIN_PRE      DSP2_BLBACK_HIST_Y2_MIN_PRE
#define DSP2_BLBACK_HIST_Y2_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y2_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y2_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y2_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y2_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y2_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y2_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y2_MIN_PRE_POS))

/* 0x930 : WDR_HIST_11 */
#define DSP2_BLBACK_WDR_HIST_11_OFFSET   (0x930)
#define DSP2_BLBACK_HIST_X3_MAX_PRE      DSP2_BLBACK_HIST_X3_MAX_PRE
#define DSP2_BLBACK_HIST_X3_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X3_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X3_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X3_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X3_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X3_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X3_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X3_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X3_MIN_PRE      DSP2_BLBACK_HIST_X3_MIN_PRE
#define DSP2_BLBACK_HIST_X3_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X3_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X3_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X3_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X3_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X3_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X3_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X3_MIN_PRE_POS))

/* 0x934 : WDR_HIST_12 */
#define DSP2_BLBACK_WDR_HIST_12_OFFSET   (0x934)
#define DSP2_BLBACK_HIST_Y3_MAX_PRE      DSP2_BLBACK_HIST_Y3_MAX_PRE
#define DSP2_BLBACK_HIST_Y3_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y3_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y3_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y3_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y3_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y3_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y3_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y3_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y3_MIN_PRE      DSP2_BLBACK_HIST_Y3_MIN_PRE
#define DSP2_BLBACK_HIST_Y3_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y3_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y3_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y3_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y3_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y3_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y3_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y3_MIN_PRE_POS))

/* 0x938 : WDR_HIST_13 */
#define DSP2_BLBACK_WDR_HIST_13_OFFSET   (0x938)
#define DSP2_BLBACK_HIST_X4_MAX_PRE      DSP2_BLBACK_HIST_X4_MAX_PRE
#define DSP2_BLBACK_HIST_X4_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X4_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X4_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X4_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X4_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X4_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X4_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X4_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X4_MIN_PRE      DSP2_BLBACK_HIST_X4_MIN_PRE
#define DSP2_BLBACK_HIST_X4_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X4_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X4_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X4_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X4_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X4_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X4_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X4_MIN_PRE_POS))

/* 0x93C : WDR_HIST_14 */
#define DSP2_BLBACK_WDR_HIST_14_OFFSET   (0x93C)
#define DSP2_BLBACK_HIST_Y4_MAX_PRE      DSP2_BLBACK_HIST_Y4_MAX_PRE
#define DSP2_BLBACK_HIST_Y4_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y4_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y4_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y4_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y4_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y4_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y4_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y4_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y4_MIN_PRE      DSP2_BLBACK_HIST_Y4_MIN_PRE
#define DSP2_BLBACK_HIST_Y4_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y4_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y4_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y4_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y4_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y4_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y4_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y4_MIN_PRE_POS))

/* 0x940 : WDR_HIST_15 */
#define DSP2_BLBACK_WDR_HIST_15_OFFSET   (0x940)
#define DSP2_BLBACK_HIST_X5_MAX_PRE      DSP2_BLBACK_HIST_X5_MAX_PRE
#define DSP2_BLBACK_HIST_X5_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X5_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X5_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X5_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X5_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X5_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X5_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X5_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X5_MIN_PRE      DSP2_BLBACK_HIST_X5_MIN_PRE
#define DSP2_BLBACK_HIST_X5_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X5_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X5_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X5_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X5_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X5_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X5_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X5_MIN_PRE_POS))

/* 0x944 : WDR_HIST_16 */
#define DSP2_BLBACK_WDR_HIST_16_OFFSET   (0x944)
#define DSP2_BLBACK_HIST_Y5_MAX_PRE      DSP2_BLBACK_HIST_Y5_MAX_PRE
#define DSP2_BLBACK_HIST_Y5_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y5_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y5_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y5_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y5_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y5_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y5_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y5_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y5_MIN_PRE      DSP2_BLBACK_HIST_Y5_MIN_PRE
#define DSP2_BLBACK_HIST_Y5_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y5_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y5_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y5_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y5_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y5_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y5_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y5_MIN_PRE_POS))

/* 0x948 : WDR_HIST_17 */
#define DSP2_BLBACK_WDR_HIST_17_OFFSET   (0x948)
#define DSP2_BLBACK_HIST_X6_MAX_PRE      DSP2_BLBACK_HIST_X6_MAX_PRE
#define DSP2_BLBACK_HIST_X6_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X6_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X6_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X6_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X6_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X6_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X6_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X6_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X6_MIN_PRE      DSP2_BLBACK_HIST_X6_MIN_PRE
#define DSP2_BLBACK_HIST_X6_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X6_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X6_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X6_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X6_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X6_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X6_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X6_MIN_PRE_POS))

/* 0x94C : WDR_HIST_18 */
#define DSP2_BLBACK_WDR_HIST_18_OFFSET   (0x94C)
#define DSP2_BLBACK_HIST_Y6_MAX_PRE      DSP2_BLBACK_HIST_Y6_MAX_PRE
#define DSP2_BLBACK_HIST_Y6_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y6_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y6_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y6_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y6_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y6_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y6_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y6_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y6_MIN_PRE      DSP2_BLBACK_HIST_Y6_MIN_PRE
#define DSP2_BLBACK_HIST_Y6_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y6_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y6_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y6_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y6_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y6_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y6_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y6_MIN_PRE_POS))

/* 0x950 : WDR_HIST_19 */
#define DSP2_BLBACK_WDR_HIST_19_OFFSET   (0x950)
#define DSP2_BLBACK_HIST_X7_MAX_PRE      DSP2_BLBACK_HIST_X7_MAX_PRE
#define DSP2_BLBACK_HIST_X7_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_X7_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X7_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X7_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X7_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_X7_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X7_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X7_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_X7_MIN_PRE      DSP2_BLBACK_HIST_X7_MIN_PRE
#define DSP2_BLBACK_HIST_X7_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_X7_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_X7_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_X7_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X7_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_X7_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_X7_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_X7_MIN_PRE_POS))

/* 0x954 : WDR_HIST_20 */
#define DSP2_BLBACK_WDR_HIST_20_OFFSET   (0x954)
#define DSP2_BLBACK_HIST_Y7_MAX_PRE      DSP2_BLBACK_HIST_Y7_MAX_PRE
#define DSP2_BLBACK_HIST_Y7_MAX_PRE_POS  (0U)
#define DSP2_BLBACK_HIST_Y7_MAX_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y7_MAX_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y7_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y7_MAX_PRE_POS)
#define DSP2_BLBACK_HIST_Y7_MAX_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y7_MAX_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y7_MAX_PRE_POS))
#define DSP2_BLBACK_HIST_Y7_MIN_PRE      DSP2_BLBACK_HIST_Y7_MIN_PRE
#define DSP2_BLBACK_HIST_Y7_MIN_PRE_POS  (16U)
#define DSP2_BLBACK_HIST_Y7_MIN_PRE_LEN  (11U)
#define DSP2_BLBACK_HIST_Y7_MIN_PRE_MSK  (((1U << DSP2_BLBACK_HIST_Y7_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y7_MIN_PRE_POS)
#define DSP2_BLBACK_HIST_Y7_MIN_PRE_UMSK (~(((1U << DSP2_BLBACK_HIST_Y7_MIN_PRE_LEN) - 1) << DSP2_BLBACK_HIST_Y7_MIN_PRE_POS))

/* 0x958 : REG_HIST0_64 */
#define DSP2_BLBACK_REG_HIST0_64_OFFSET (0x958)
#define DSP2_BLBACK_HIST0_64_R          DSP2_BLBACK_HIST0_64_R
#define DSP2_BLBACK_HIST0_64_R_POS      (0U)
#define DSP2_BLBACK_HIST0_64_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_64_R_MSK      (((1U << DSP2_BLBACK_HIST0_64_R_LEN) - 1) << DSP2_BLBACK_HIST0_64_R_POS)
#define DSP2_BLBACK_HIST0_64_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_64_R_LEN) - 1) << DSP2_BLBACK_HIST0_64_R_POS))

