RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0x95C : REG_HIST1_64 */
#define DSP2_BLBACK_REG_HIST1_64_OFFSET (0x95C)
#define DSP2_BLBACK_HIST1_64_R          DSP2_BLBACK_HIST1_64_R
#define DSP2_BLBACK_HIST1_64_R_POS      (0U)
#define DSP2_BLBACK_HIST1_64_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_64_R_MSK      (((1U << DSP2_BLBACK_HIST1_64_R_LEN) - 1) << DSP2_BLBACK_HIST1_64_R_POS)
#define DSP2_BLBACK_HIST1_64_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_64_R_LEN) - 1) << DSP2_BLBACK_HIST1_64_R_POS))

/* 0xA00 : REG_HIST0_0 */
#define DSP2_BLBACK_REG_HIST0_0_OFFSET (0xA00)
#define DSP2_BLBACK_HIST0_0_R          DSP2_BLBACK_HIST0_0_R
#define DSP2_BLBACK_HIST0_0_R_POS      (0U)
#define DSP2_BLBACK_HIST0_0_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_0_R_MSK      (((1U << DSP2_BLBACK_HIST0_0_R_LEN) - 1) << DSP2_BLBACK_HIST0_0_R_POS)
#define DSP2_BLBACK_HIST0_0_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_0_R_LEN) - 1) << DSP2_BLBACK_HIST0_0_R_POS))

/* 0xA04 : REG_HIST0_1 */
#define DSP2_BLBACK_REG_HIST0_1_OFFSET (0xA04)
#define DSP2_BLBACK_HIST0_1_R          DSP2_BLBACK_HIST0_1_R
#define DSP2_BLBACK_HIST0_1_R_POS      (0U)
#define DSP2_BLBACK_HIST0_1_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_1_R_MSK      (((1U << DSP2_BLBACK_HIST0_1_R_LEN) - 1) << DSP2_BLBACK_HIST0_1_R_POS)
#define DSP2_BLBACK_HIST0_1_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_1_R_LEN) - 1) << DSP2_BLBACK_HIST0_1_R_POS))

/* 0xA08 : REG_HIST0_2 */
#define DSP2_BLBACK_REG_HIST0_2_OFFSET (0xA08)
#define DSP2_BLBACK_HIST0_2_R          DSP2_BLBACK_HIST0_2_R
#define DSP2_BLBACK_HIST0_2_R_POS      (0U)
#define DSP2_BLBACK_HIST0_2_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_2_R_MSK      (((1U << DSP2_BLBACK_HIST0_2_R_LEN) - 1) << DSP2_BLBACK_HIST0_2_R_POS)
#define DSP2_BLBACK_HIST0_2_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_2_R_LEN) - 1) << DSP2_BLBACK_HIST0_2_R_POS))

/* 0xA0C : REG_HIST0_3 */
#define DSP2_BLBACK_REG_HIST0_3_OFFSET (0xA0C)
#define DSP2_BLBACK_HIST0_3_R          DSP2_BLBACK_HIST0_3_R
#define DSP2_BLBACK_HIST0_3_R_POS      (0U)
#define DSP2_BLBACK_HIST0_3_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_3_R_MSK      (((1U << DSP2_BLBACK_HIST0_3_R_LEN) - 1) << DSP2_BLBACK_HIST0_3_R_POS)
#define DSP2_BLBACK_HIST0_3_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_3_R_LEN) - 1) << DSP2_BLBACK_HIST0_3_R_POS))

/* 0xA10 : REG_HIST0_4 */
#define DSP2_BLBACK_REG_HIST0_4_OFFSET (0xA10)
#define DSP2_BLBACK_HIST0_4_R          DSP2_BLBACK_HIST0_4_R
#define DSP2_BLBACK_HIST0_4_R_POS      (0U)
#define DSP2_BLBACK_HIST0_4_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_4_R_MSK      (((1U << DSP2_BLBACK_HIST0_4_R_LEN) - 1) << DSP2_BLBACK_HIST0_4_R_POS)
#define DSP2_BLBACK_HIST0_4_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_4_R_LEN) - 1) << DSP2_BLBACK_HIST0_4_R_POS))

/* 0xA14 : REG_HIST0_5 */
#define DSP2_BLBACK_REG_HIST0_5_OFFSET (0xA14)
#define DSP2_BLBACK_HIST0_5_R          DSP2_BLBACK_HIST0_5_R
#define DSP2_BLBACK_HIST0_5_R_POS      (0U)
#define DSP2_BLBACK_HIST0_5_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_5_R_MSK      (((1U << DSP2_BLBACK_HIST0_5_R_LEN) - 1) << DSP2_BLBACK_HIST0_5_R_POS)
#define DSP2_BLBACK_HIST0_5_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_5_R_LEN) - 1) << DSP2_BLBACK_HIST0_5_R_POS))

/* 0xA18 : REG_HIST0_6 */
#define DSP2_BLBACK_REG_HIST0_6_OFFSET (0xA18)
#define DSP2_BLBACK_HIST0_6_R          DSP2_BLBACK_HIST0_6_R
#define DSP2_BLBACK_HIST0_6_R_POS      (0U)
#define DSP2_BLBACK_HIST0_6_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_6_R_MSK      (((1U << DSP2_BLBACK_HIST0_6_R_LEN) - 1) << DSP2_BLBACK_HIST0_6_R_POS)
#define DSP2_BLBACK_HIST0_6_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_6_R_LEN) - 1) << DSP2_BLBACK_HIST0_6_R_POS))

/* 0xA1C : REG_HIST0_7 */
#define DSP2_BLBACK_REG_HIST0_7_OFFSET (0xA1C)
#define DSP2_BLBACK_HIST0_7_R          DSP2_BLBACK_HIST0_7_R
#define DSP2_BLBACK_HIST0_7_R_POS      (0U)
#define DSP2_BLBACK_HIST0_7_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_7_R_MSK      (((1U << DSP2_BLBACK_HIST0_7_R_LEN) - 1) << DSP2_BLBACK_HIST0_7_R_POS)
#define DSP2_BLBACK_HIST0_7_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_7_R_LEN) - 1) << DSP2_BLBACK_HIST0_7_R_POS))

/* 0xA20 : REG_HIST0_8 */
#define DSP2_BLBACK_REG_HIST0_8_OFFSET (0xA20)
#define DSP2_BLBACK_HIST0_8_R          DSP2_BLBACK_HIST0_8_R
#define DSP2_BLBACK_HIST0_8_R_POS      (0U)
#define DSP2_BLBACK_HIST0_8_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_8_R_MSK      (((1U << DSP2_BLBACK_HIST0_8_R_LEN) - 1) << DSP2_BLBACK_HIST0_8_R_POS)
#define DSP2_BLBACK_HIST0_8_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_8_R_LEN) - 1) << DSP2_BLBACK_HIST0_8_R_POS))

/* 0xA24 : REG_HIST0_9 */
#define DSP2_BLBACK_REG_HIST0_9_OFFSET (0xA24)
#define DSP2_BLBACK_HIST0_9_R          DSP2_BLBACK_HIST0_9_R
#define DSP2_BLBACK_HIST0_9_R_POS      (0U)
#define DSP2_BLBACK_HIST0_9_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_9_R_MSK      (((1U << DSP2_BLBACK_HIST0_9_R_LEN) - 1) << DSP2_BLBACK_HIST0_9_R_POS)
#define DSP2_BLBACK_HIST0_9_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_9_R_LEN) - 1) << DSP2_BLBACK_HIST0_9_R_POS))

/* 0xA28 : REG_HIST0_10 */
#define DSP2_BLBACK_REG_HIST0_10_OFFSET (0xA28)
#define DSP2_BLBACK_HIST0_10_R          DSP2_BLBACK_HIST0_10_R
#define DSP2_BLBACK_HIST0_10_R_POS      (0U)
#define DSP2_BLBACK_HIST0_10_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_10_R_MSK      (((1U << DSP2_BLBACK_HIST0_10_R_LEN) - 1) << DSP2_BLBACK_HIST0_10_R_POS)
#define DSP2_BLBACK_HIST0_10_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_10_R_LEN) - 1) << DSP2_BLBACK_HIST0_10_R_POS))

/* 0xA2C : REG_HIST0_11 */
#define DSP2_BLBACK_REG_HIST0_11_OFFSET (0xA2C)
#define DSP2_BLBACK_HIST0_11_R          DSP2_BLBACK_HIST0_11_R
#define DSP2_BLBACK_HIST0_11_R_POS      (0U)
#define DSP2_BLBACK_HIST0_11_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_11_R_MSK      (((1U << DSP2_BLBACK_HIST0_11_R_LEN) - 1) << DSP2_BLBACK_HIST0_11_R_POS)
#define DSP2_BLBACK_HIST0_11_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_11_R_LEN) - 1) << DSP2_BLBACK_HIST0_11_R_POS))

/* 0xA30 : REG_HIST0_12 */
#define DSP2_BLBACK_REG_HIST0_12_OFFSET (0xA30)
#define DSP2_BLBACK_HIST0_12_R          DSP2_BLBACK_HIST0_12_R
#define DSP2_BLBACK_HIST0_12_R_POS      (0U)
#define DSP2_BLBACK_HIST0_12_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_12_R_MSK      (((1U << DSP2_BLBACK_HIST0_12_R_LEN) - 1) << DSP2_BLBACK_HIST0_12_R_POS)
#define DSP2_BLBACK_HIST0_12_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_12_R_LEN) - 1) << DSP2_BLBACK_HIST0_12_R_POS))

/* 0xA34 : REG_HIST0_13 */
#define DSP2_BLBACK_REG_HIST0_13_OFFSET (0xA34)
#define DSP2_BLBACK_HIST0_13_R          DSP2_BLBACK_HIST0_13_R
#define DSP2_BLBACK_HIST0_13_R_POS      (0U)
#define DSP2_BLBACK_HIST0_13_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_13_R_MSK      (((1U << DSP2_BLBACK_HIST0_13_R_LEN) - 1) << DSP2_BLBACK_HIST0_13_R_POS)
#define DSP2_BLBACK_HIST0_13_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_13_R_LEN) - 1) << DSP2_BLBACK_HIST0_13_R_POS))

