RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xA38 : REG_HIST0_14 */
#define DSP2_BLBACK_REG_HIST0_14_OFFSET (0xA38)
#define DSP2_BLBACK_HIST0_14_R          DSP2_BLBACK_HIST0_14_R
#define DSP2_BLBACK_HIST0_14_R_POS      (0U)
#define DSP2_BLBACK_HIST0_14_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_14_R_MSK      (((1U << DSP2_BLBACK_HIST0_14_R_LEN) - 1) << DSP2_BLBACK_HIST0_14_R_POS)
#define DSP2_BLBACK_HIST0_14_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_14_R_LEN) - 1) << DSP2_BLBACK_HIST0_14_R_POS))

/* 0xA3C : REG_HIST0_15 */
#define DSP2_BLBACK_REG_HIST0_15_OFFSET (0xA3C)
#define DSP2_BLBACK_HIST0_15_R          DSP2_BLBACK_HIST0_15_R
#define DSP2_BLBACK_HIST0_15_R_POS      (0U)
#define DSP2_BLBACK_HIST0_15_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_15_R_MSK      (((1U << DSP2_BLBACK_HIST0_15_R_LEN) - 1) << DSP2_BLBACK_HIST0_15_R_POS)
#define DSP2_BLBACK_HIST0_15_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_15_R_LEN) - 1) << DSP2_BLBACK_HIST0_15_R_POS))

/* 0xA40 : REG_HIST0_16 */
#define DSP2_BLBACK_REG_HIST0_16_OFFSET (0xA40)
#define DSP2_BLBACK_HIST0_16_R          DSP2_BLBACK_HIST0_16_R
#define DSP2_BLBACK_HIST0_16_R_POS      (0U)
#define DSP2_BLBACK_HIST0_16_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_16_R_MSK      (((1U << DSP2_BLBACK_HIST0_16_R_LEN) - 1) << DSP2_BLBACK_HIST0_16_R_POS)
#define DSP2_BLBACK_HIST0_16_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_16_R_LEN) - 1) << DSP2_BLBACK_HIST0_16_R_POS))

/* 0xA44 : REG_HIST0_17 */
#define DSP2_BLBACK_REG_HIST0_17_OFFSET (0xA44)
#define DSP2_BLBACK_HIST0_17_R          DSP2_BLBACK_HIST0_17_R
#define DSP2_BLBACK_HIST0_17_R_POS      (0U)
#define DSP2_BLBACK_HIST0_17_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_17_R_MSK      (((1U << DSP2_BLBACK_HIST0_17_R_LEN) - 1) << DSP2_BLBACK_HIST0_17_R_POS)
#define DSP2_BLBACK_HIST0_17_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_17_R_LEN) - 1) << DSP2_BLBACK_HIST0_17_R_POS))

/* 0xA48 : REG_HIST0_18 */
#define DSP2_BLBACK_REG_HIST0_18_OFFSET (0xA48)
#define DSP2_BLBACK_HIST0_18_R          DSP2_BLBACK_HIST0_18_R
#define DSP2_BLBACK_HIST0_18_R_POS      (0U)
#define DSP2_BLBACK_HIST0_18_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_18_R_MSK      (((1U << DSP2_BLBACK_HIST0_18_R_LEN) - 1) << DSP2_BLBACK_HIST0_18_R_POS)
#define DSP2_BLBACK_HIST0_18_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_18_R_LEN) - 1) << DSP2_BLBACK_HIST0_18_R_POS))

/* 0xA4C : REG_HIST0_19 */
#define DSP2_BLBACK_REG_HIST0_19_OFFSET (0xA4C)
#define DSP2_BLBACK_HIST0_19_R          DSP2_BLBACK_HIST0_19_R
#define DSP2_BLBACK_HIST0_19_R_POS      (0U)
#define DSP2_BLBACK_HIST0_19_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_19_R_MSK      (((1U << DSP2_BLBACK_HIST0_19_R_LEN) - 1) << DSP2_BLBACK_HIST0_19_R_POS)
#define DSP2_BLBACK_HIST0_19_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_19_R_LEN) - 1) << DSP2_BLBACK_HIST0_19_R_POS))

/* 0xA50 : REG_HIST0_20 */
#define DSP2_BLBACK_REG_HIST0_20_OFFSET (0xA50)
#define DSP2_BLBACK_HIST0_20_R          DSP2_BLBACK_HIST0_20_R
#define DSP2_BLBACK_HIST0_20_R_POS      (0U)
#define DSP2_BLBACK_HIST0_20_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_20_R_MSK      (((1U << DSP2_BLBACK_HIST0_20_R_LEN) - 1) << DSP2_BLBACK_HIST0_20_R_POS)
#define DSP2_BLBACK_HIST0_20_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_20_R_LEN) - 1) << DSP2_BLBACK_HIST0_20_R_POS))

/* 0xA54 : REG_HIST0_21 */
#define DSP2_BLBACK_REG_HIST0_21_OFFSET (0xA54)
#define DSP2_BLBACK_HIST0_21_R          DSP2_BLBACK_HIST0_21_R
#define DSP2_BLBACK_HIST0_21_R_POS      (0U)
#define DSP2_BLBACK_HIST0_21_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_21_R_MSK      (((1U << DSP2_BLBACK_HIST0_21_R_LEN) - 1) << DSP2_BLBACK_HIST0_21_R_POS)
#define DSP2_BLBACK_HIST0_21_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_21_R_LEN) - 1) << DSP2_BLBACK_HIST0_21_R_POS))

/* 0xA58 : REG_HIST0_22 */
#define DSP2_BLBACK_REG_HIST0_22_OFFSET (0xA58)
#define DSP2_BLBACK_HIST0_22_R          DSP2_BLBACK_HIST0_22_R
#define DSP2_BLBACK_HIST0_22_R_POS      (0U)
#define DSP2_BLBACK_HIST0_22_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_22_R_MSK      (((1U << DSP2_BLBACK_HIST0_22_R_LEN) - 1) << DSP2_BLBACK_HIST0_22_R_POS)
#define DSP2_BLBACK_HIST0_22_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_22_R_LEN) - 1) << DSP2_BLBACK_HIST0_22_R_POS))

/* 0xA5C : REG_HIST0_23 */
#define DSP2_BLBACK_REG_HIST0_23_OFFSET (0xA5C)
#define DSP2_BLBACK_HIST0_23_R          DSP2_BLBACK_HIST0_23_R
#define DSP2_BLBACK_HIST0_23_R_POS      (0U)
#define DSP2_BLBACK_HIST0_23_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_23_R_MSK      (((1U << DSP2_BLBACK_HIST0_23_R_LEN) - 1) << DSP2_BLBACK_HIST0_23_R_POS)
#define DSP2_BLBACK_HIST0_23_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_23_R_LEN) - 1) << DSP2_BLBACK_HIST0_23_R_POS))

/* 0xA60 : REG_HIST0_24 */
#define DSP2_BLBACK_REG_HIST0_24_OFFSET (0xA60)
#define DSP2_BLBACK_HIST0_24_R          DSP2_BLBACK_HIST0_24_R
#define DSP2_BLBACK_HIST0_24_R_POS      (0U)
#define DSP2_BLBACK_HIST0_24_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_24_R_MSK      (((1U << DSP2_BLBACK_HIST0_24_R_LEN) - 1) << DSP2_BLBACK_HIST0_24_R_POS)
#define DSP2_BLBACK_HIST0_24_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_24_R_LEN) - 1) << DSP2_BLBACK_HIST0_24_R_POS))

/* 0xA64 : REG_HIST0_25 */
#define DSP2_BLBACK_REG_HIST0_25_OFFSET (0xA64)
#define DSP2_BLBACK_HIST0_25_R          DSP2_BLBACK_HIST0_25_R
#define DSP2_BLBACK_HIST0_25_R_POS      (0U)
#define DSP2_BLBACK_HIST0_25_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_25_R_MSK      (((1U << DSP2_BLBACK_HIST0_25_R_LEN) - 1) << DSP2_BLBACK_HIST0_25_R_POS)
#define DSP2_BLBACK_HIST0_25_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_25_R_LEN) - 1) << DSP2_BLBACK_HIST0_25_R_POS))

/* 0xA68 : REG_HIST0_26 */
#define DSP2_BLBACK_REG_HIST0_26_OFFSET (0xA68)
#define DSP2_BLBACK_HIST0_26_R          DSP2_BLBACK_HIST0_26_R
#define DSP2_BLBACK_HIST0_26_R_POS      (0U)
#define DSP2_BLBACK_HIST0_26_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_26_R_MSK      (((1U << DSP2_BLBACK_HIST0_26_R_LEN) - 1) << DSP2_BLBACK_HIST0_26_R_POS)
#define DSP2_BLBACK_HIST0_26_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_26_R_LEN) - 1) << DSP2_BLBACK_HIST0_26_R_POS))

/* 0xA6C : REG_HIST0_27 */
#define DSP2_BLBACK_REG_HIST0_27_OFFSET (0xA6C)
#define DSP2_BLBACK_HIST0_27_R          DSP2_BLBACK_HIST0_27_R
#define DSP2_BLBACK_HIST0_27_R_POS      (0U)
#define DSP2_BLBACK_HIST0_27_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_27_R_MSK      (((1U << DSP2_BLBACK_HIST0_27_R_LEN) - 1) << DSP2_BLBACK_HIST0_27_R_POS)
#define DSP2_BLBACK_HIST0_27_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_27_R_LEN) - 1) << DSP2_BLBACK_HIST0_27_R_POS))

