RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xA70 : REG_HIST0_28 */
#define DSP2_BLBACK_REG_HIST0_28_OFFSET (0xA70)
#define DSP2_BLBACK_HIST0_28_R          DSP2_BLBACK_HIST0_28_R
#define DSP2_BLBACK_HIST0_28_R_POS      (0U)
#define DSP2_BLBACK_HIST0_28_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_28_R_MSK      (((1U << DSP2_BLBACK_HIST0_28_R_LEN) - 1) << DSP2_BLBACK_HIST0_28_R_POS)
#define DSP2_BLBACK_HIST0_28_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_28_R_LEN) - 1) << DSP2_BLBACK_HIST0_28_R_POS))

/* 0xA74 : REG_HIST0_29 */
#define DSP2_BLBACK_REG_HIST0_29_OFFSET (0xA74)
#define DSP2_BLBACK_HIST0_29_R          DSP2_BLBACK_HIST0_29_R
#define DSP2_BLBACK_HIST0_29_R_POS      (0U)
#define DSP2_BLBACK_HIST0_29_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_29_R_MSK      (((1U << DSP2_BLBACK_HIST0_29_R_LEN) - 1) << DSP2_BLBACK_HIST0_29_R_POS)
#define DSP2_BLBACK_HIST0_29_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_29_R_LEN) - 1) << DSP2_BLBACK_HIST0_29_R_POS))

/* 0xA78 : REG_HIST0_30 */
#define DSP2_BLBACK_REG_HIST0_30_OFFSET (0xA78)
#define DSP2_BLBACK_HIST0_30_R          DSP2_BLBACK_HIST0_30_R
#define DSP2_BLBACK_HIST0_30_R_POS      (0U)
#define DSP2_BLBACK_HIST0_30_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_30_R_MSK      (((1U << DSP2_BLBACK_HIST0_30_R_LEN) - 1) << DSP2_BLBACK_HIST0_30_R_POS)
#define DSP2_BLBACK_HIST0_30_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_30_R_LEN) - 1) << DSP2_BLBACK_HIST0_30_R_POS))

/* 0xA7C : REG_HIST0_31 */
#define DSP2_BLBACK_REG_HIST0_31_OFFSET (0xA7C)
#define DSP2_BLBACK_HIST0_31_R          DSP2_BLBACK_HIST0_31_R
#define DSP2_BLBACK_HIST0_31_R_POS      (0U)
#define DSP2_BLBACK_HIST0_31_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_31_R_MSK      (((1U << DSP2_BLBACK_HIST0_31_R_LEN) - 1) << DSP2_BLBACK_HIST0_31_R_POS)
#define DSP2_BLBACK_HIST0_31_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_31_R_LEN) - 1) << DSP2_BLBACK_HIST0_31_R_POS))

/* 0xA80 : REG_HIST0_32 */
#define DSP2_BLBACK_REG_HIST0_32_OFFSET (0xA80)
#define DSP2_BLBACK_HIST0_32_R          DSP2_BLBACK_HIST0_32_R
#define DSP2_BLBACK_HIST0_32_R_POS      (0U)
#define DSP2_BLBACK_HIST0_32_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_32_R_MSK      (((1U << DSP2_BLBACK_HIST0_32_R_LEN) - 1) << DSP2_BLBACK_HIST0_32_R_POS)
#define DSP2_BLBACK_HIST0_32_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_32_R_LEN) - 1) << DSP2_BLBACK_HIST0_32_R_POS))

/* 0xA84 : REG_HIST0_33 */
#define DSP2_BLBACK_REG_HIST0_33_OFFSET (0xA84)
#define DSP2_BLBACK_HIST0_33_R          DSP2_BLBACK_HIST0_33_R
#define DSP2_BLBACK_HIST0_33_R_POS      (0U)
#define DSP2_BLBACK_HIST0_33_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_33_R_MSK      (((1U << DSP2_BLBACK_HIST0_33_R_LEN) - 1) << DSP2_BLBACK_HIST0_33_R_POS)
#define DSP2_BLBACK_HIST0_33_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_33_R_LEN) - 1) << DSP2_BLBACK_HIST0_33_R_POS))

/* 0xA88 : REG_HIST0_34 */
#define DSP2_BLBACK_REG_HIST0_34_OFFSET (0xA88)
#define DSP2_BLBACK_HIST0_34_R          DSP2_BLBACK_HIST0_34_R
#define DSP2_BLBACK_HIST0_34_R_POS      (0U)
#define DSP2_BLBACK_HIST0_34_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_34_R_MSK      (((1U << DSP2_BLBACK_HIST0_34_R_LEN) - 1) << DSP2_BLBACK_HIST0_34_R_POS)
#define DSP2_BLBACK_HIST0_34_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_34_R_LEN) - 1) << DSP2_BLBACK_HIST0_34_R_POS))

/* 0xA8C : REG_HIST0_35 */
#define DSP2_BLBACK_REG_HIST0_35_OFFSET (0xA8C)
#define DSP2_BLBACK_HIST0_35_R          DSP2_BLBACK_HIST0_35_R
#define DSP2_BLBACK_HIST0_35_R_POS      (0U)
#define DSP2_BLBACK_HIST0_35_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_35_R_MSK      (((1U << DSP2_BLBACK_HIST0_35_R_LEN) - 1) << DSP2_BLBACK_HIST0_35_R_POS)
#define DSP2_BLBACK_HIST0_35_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_35_R_LEN) - 1) << DSP2_BLBACK_HIST0_35_R_POS))

/* 0xA90 : REG_HIST0_36 */
#define DSP2_BLBACK_REG_HIST0_36_OFFSET (0xA90)
#define DSP2_BLBACK_HIST0_36_R          DSP2_BLBACK_HIST0_36_R
#define DSP2_BLBACK_HIST0_36_R_POS      (0U)
#define DSP2_BLBACK_HIST0_36_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_36_R_MSK      (((1U << DSP2_BLBACK_HIST0_36_R_LEN) - 1) << DSP2_BLBACK_HIST0_36_R_POS)
#define DSP2_BLBACK_HIST0_36_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_36_R_LEN) - 1) << DSP2_BLBACK_HIST0_36_R_POS))

/* 0xA94 : REG_HIST0_37 */
#define DSP2_BLBACK_REG_HIST0_37_OFFSET (0xA94)
#define DSP2_BLBACK_HIST0_37_R          DSP2_BLBACK_HIST0_37_R
#define DSP2_BLBACK_HIST0_37_R_POS      (0U)
#define DSP2_BLBACK_HIST0_37_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_37_R_MSK      (((1U << DSP2_BLBACK_HIST0_37_R_LEN) - 1) << DSP2_BLBACK_HIST0_37_R_POS)
#define DSP2_BLBACK_HIST0_37_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_37_R_LEN) - 1) << DSP2_BLBACK_HIST0_37_R_POS))

/* 0xA98 : REG_HIST0_38 */
#define DSP2_BLBACK_REG_HIST0_38_OFFSET (0xA98)
#define DSP2_BLBACK_HIST0_38_R          DSP2_BLBACK_HIST0_38_R
#define DSP2_BLBACK_HIST0_38_R_POS      (0U)
#define DSP2_BLBACK_HIST0_38_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_38_R_MSK      (((1U << DSP2_BLBACK_HIST0_38_R_LEN) - 1) << DSP2_BLBACK_HIST0_38_R_POS)
#define DSP2_BLBACK_HIST0_38_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_38_R_LEN) - 1) << DSP2_BLBACK_HIST0_38_R_POS))

/* 0xA9C : REG_HIST0_39 */
#define DSP2_BLBACK_REG_HIST0_39_OFFSET (0xA9C)
#define DSP2_BLBACK_HIST0_39_R          DSP2_BLBACK_HIST0_39_R
#define DSP2_BLBACK_HIST0_39_R_POS      (0U)
#define DSP2_BLBACK_HIST0_39_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_39_R_MSK      (((1U << DSP2_BLBACK_HIST0_39_R_LEN) - 1) << DSP2_BLBACK_HIST0_39_R_POS)
#define DSP2_BLBACK_HIST0_39_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_39_R_LEN) - 1) << DSP2_BLBACK_HIST0_39_R_POS))

/* 0xAA0 : REG_HIST0_40 */
#define DSP2_BLBACK_REG_HIST0_40_OFFSET (0xAA0)
#define DSP2_BLBACK_HIST0_40_R          DSP2_BLBACK_HIST0_40_R
#define DSP2_BLBACK_HIST0_40_R_POS      (0U)
#define DSP2_BLBACK_HIST0_40_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_40_R_MSK      (((1U << DSP2_BLBACK_HIST0_40_R_LEN) - 1) << DSP2_BLBACK_HIST0_40_R_POS)
#define DSP2_BLBACK_HIST0_40_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_40_R_LEN) - 1) << DSP2_BLBACK_HIST0_40_R_POS))

/* 0xAA4 : REG_HIST0_41 */
#define DSP2_BLBACK_REG_HIST0_41_OFFSET (0xAA4)
#define DSP2_BLBACK_HIST0_41_R          DSP2_BLBACK_HIST0_41_R
#define DSP2_BLBACK_HIST0_41_R_POS      (0U)
#define DSP2_BLBACK_HIST0_41_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_41_R_MSK      (((1U << DSP2_BLBACK_HIST0_41_R_LEN) - 1) << DSP2_BLBACK_HIST0_41_R_POS)
#define DSP2_BLBACK_HIST0_41_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_41_R_LEN) - 1) << DSP2_BLBACK_HIST0_41_R_POS))

