RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xAA8 : REG_HIST0_42 */
#define DSP2_BLBACK_REG_HIST0_42_OFFSET (0xAA8)
#define DSP2_BLBACK_HIST0_42_R          DSP2_BLBACK_HIST0_42_R
#define DSP2_BLBACK_HIST0_42_R_POS      (0U)
#define DSP2_BLBACK_HIST0_42_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_42_R_MSK      (((1U << DSP2_BLBACK_HIST0_42_R_LEN) - 1) << DSP2_BLBACK_HIST0_42_R_POS)
#define DSP2_BLBACK_HIST0_42_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_42_R_LEN) - 1) << DSP2_BLBACK_HIST0_42_R_POS))

/* 0xAAC : REG_HIST0_43 */
#define DSP2_BLBACK_REG_HIST0_43_OFFSET (0xAAC)
#define DSP2_BLBACK_HIST0_43_R          DSP2_BLBACK_HIST0_43_R
#define DSP2_BLBACK_HIST0_43_R_POS      (0U)
#define DSP2_BLBACK_HIST0_43_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_43_R_MSK      (((1U << DSP2_BLBACK_HIST0_43_R_LEN) - 1) << DSP2_BLBACK_HIST0_43_R_POS)
#define DSP2_BLBACK_HIST0_43_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_43_R_LEN) - 1) << DSP2_BLBACK_HIST0_43_R_POS))

/* 0xAB0 : REG_HIST0_44 */
#define DSP2_BLBACK_REG_HIST0_44_OFFSET (0xAB0)
#define DSP2_BLBACK_HIST0_44_R          DSP2_BLBACK_HIST0_44_R
#define DSP2_BLBACK_HIST0_44_R_POS      (0U)
#define DSP2_BLBACK_HIST0_44_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_44_R_MSK      (((1U << DSP2_BLBACK_HIST0_44_R_LEN) - 1) << DSP2_BLBACK_HIST0_44_R_POS)
#define DSP2_BLBACK_HIST0_44_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_44_R_LEN) - 1) << DSP2_BLBACK_HIST0_44_R_POS))

/* 0xAB4 : REG_HIST0_45 */
#define DSP2_BLBACK_REG_HIST0_45_OFFSET (0xAB4)
#define DSP2_BLBACK_HIST0_45_R          DSP2_BLBACK_HIST0_45_R
#define DSP2_BLBACK_HIST0_45_R_POS      (0U)
#define DSP2_BLBACK_HIST0_45_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_45_R_MSK      (((1U << DSP2_BLBACK_HIST0_45_R_LEN) - 1) << DSP2_BLBACK_HIST0_45_R_POS)
#define DSP2_BLBACK_HIST0_45_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_45_R_LEN) - 1) << DSP2_BLBACK_HIST0_45_R_POS))

/* 0xAB8 : REG_HIST0_46 */
#define DSP2_BLBACK_REG_HIST0_46_OFFSET (0xAB8)
#define DSP2_BLBACK_HIST0_46_R          DSP2_BLBACK_HIST0_46_R
#define DSP2_BLBACK_HIST0_46_R_POS      (0U)
#define DSP2_BLBACK_HIST0_46_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_46_R_MSK      (((1U << DSP2_BLBACK_HIST0_46_R_LEN) - 1) << DSP2_BLBACK_HIST0_46_R_POS)
#define DSP2_BLBACK_HIST0_46_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_46_R_LEN) - 1) << DSP2_BLBACK_HIST0_46_R_POS))

/* 0xABC : REG_HIST0_47 */
#define DSP2_BLBACK_REG_HIST0_47_OFFSET (0xABC)
#define DSP2_BLBACK_HIST0_47_R          DSP2_BLBACK_HIST0_47_R
#define DSP2_BLBACK_HIST0_47_R_POS      (0U)
#define DSP2_BLBACK_HIST0_47_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_47_R_MSK      (((1U << DSP2_BLBACK_HIST0_47_R_LEN) - 1) << DSP2_BLBACK_HIST0_47_R_POS)
#define DSP2_BLBACK_HIST0_47_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_47_R_LEN) - 1) << DSP2_BLBACK_HIST0_47_R_POS))

/* 0xAC0 : REG_HIST0_48 */
#define DSP2_BLBACK_REG_HIST0_48_OFFSET (0xAC0)
#define DSP2_BLBACK_HIST0_48_R          DSP2_BLBACK_HIST0_48_R
#define DSP2_BLBACK_HIST0_48_R_POS      (0U)
#define DSP2_BLBACK_HIST0_48_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_48_R_MSK      (((1U << DSP2_BLBACK_HIST0_48_R_LEN) - 1) << DSP2_BLBACK_HIST0_48_R_POS)
#define DSP2_BLBACK_HIST0_48_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_48_R_LEN) - 1) << DSP2_BLBACK_HIST0_48_R_POS))

/* 0xAC4 : REG_HIST0_49 */
#define DSP2_BLBACK_REG_HIST0_49_OFFSET (0xAC4)
#define DSP2_BLBACK_HIST0_49_R          DSP2_BLBACK_HIST0_49_R
#define DSP2_BLBACK_HIST0_49_R_POS      (0U)
#define DSP2_BLBACK_HIST0_49_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_49_R_MSK      (((1U << DSP2_BLBACK_HIST0_49_R_LEN) - 1) << DSP2_BLBACK_HIST0_49_R_POS)
#define DSP2_BLBACK_HIST0_49_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_49_R_LEN) - 1) << DSP2_BLBACK_HIST0_49_R_POS))

/* 0xAC8 : REG_HIST0_50 */
#define DSP2_BLBACK_REG_HIST0_50_OFFSET (0xAC8)
#define DSP2_BLBACK_HIST0_50_R          DSP2_BLBACK_HIST0_50_R
#define DSP2_BLBACK_HIST0_50_R_POS      (0U)
#define DSP2_BLBACK_HIST0_50_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_50_R_MSK      (((1U << DSP2_BLBACK_HIST0_50_R_LEN) - 1) << DSP2_BLBACK_HIST0_50_R_POS)
#define DSP2_BLBACK_HIST0_50_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_50_R_LEN) - 1) << DSP2_BLBACK_HIST0_50_R_POS))

/* 0xACC : REG_HIST0_51 */
#define DSP2_BLBACK_REG_HIST0_51_OFFSET (0xACC)
#define DSP2_BLBACK_HIST0_51_R          DSP2_BLBACK_HIST0_51_R
#define DSP2_BLBACK_HIST0_51_R_POS      (0U)
#define DSP2_BLBACK_HIST0_51_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_51_R_MSK      (((1U << DSP2_BLBACK_HIST0_51_R_LEN) - 1) << DSP2_BLBACK_HIST0_51_R_POS)
#define DSP2_BLBACK_HIST0_51_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_51_R_LEN) - 1) << DSP2_BLBACK_HIST0_51_R_POS))

/* 0xAD0 : REG_HIST0_52 */
#define DSP2_BLBACK_REG_HIST0_52_OFFSET (0xAD0)
#define DSP2_BLBACK_HIST0_52_R          DSP2_BLBACK_HIST0_52_R
#define DSP2_BLBACK_HIST0_52_R_POS      (0U)
#define DSP2_BLBACK_HIST0_52_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_52_R_MSK      (((1U << DSP2_BLBACK_HIST0_52_R_LEN) - 1) << DSP2_BLBACK_HIST0_52_R_POS)
#define DSP2_BLBACK_HIST0_52_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_52_R_LEN) - 1) << DSP2_BLBACK_HIST0_52_R_POS))

/* 0xAD4 : REG_HIST0_53 */
#define DSP2_BLBACK_REG_HIST0_53_OFFSET (0xAD4)
#define DSP2_BLBACK_HIST0_53_R          DSP2_BLBACK_HIST0_53_R
#define DSP2_BLBACK_HIST0_53_R_POS      (0U)
#define DSP2_BLBACK_HIST0_53_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_53_R_MSK      (((1U << DSP2_BLBACK_HIST0_53_R_LEN) - 1) << DSP2_BLBACK_HIST0_53_R_POS)
#define DSP2_BLBACK_HIST0_53_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_53_R_LEN) - 1) << DSP2_BLBACK_HIST0_53_R_POS))

/* 0xAD8 : REG_HIST0_54 */
#define DSP2_BLBACK_REG_HIST0_54_OFFSET (0xAD8)
#define DSP2_BLBACK_HIST0_54_R          DSP2_BLBACK_HIST0_54_R
#define DSP2_BLBACK_HIST0_54_R_POS      (0U)
#define DSP2_BLBACK_HIST0_54_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_54_R_MSK      (((1U << DSP2_BLBACK_HIST0_54_R_LEN) - 1) << DSP2_BLBACK_HIST0_54_R_POS)
#define DSP2_BLBACK_HIST0_54_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_54_R_LEN) - 1) << DSP2_BLBACK_HIST0_54_R_POS))

/* 0xADC : REG_HIST0_55 */
#define DSP2_BLBACK_REG_HIST0_55_OFFSET (0xADC)
#define DSP2_BLBACK_HIST0_55_R          DSP2_BLBACK_HIST0_55_R
#define DSP2_BLBACK_HIST0_55_R_POS      (0U)
#define DSP2_BLBACK_HIST0_55_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_55_R_MSK      (((1U << DSP2_BLBACK_HIST0_55_R_LEN) - 1) << DSP2_BLBACK_HIST0_55_R_POS)
#define DSP2_BLBACK_HIST0_55_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_55_R_LEN) - 1) << DSP2_BLBACK_HIST0_55_R_POS))

/* 0xAE0 : REG_HIST0_56 */
#define DSP2_BLBACK_REG_HIST0_56_OFFSET (0xAE0)
#define DSP2_BLBACK_HIST0_56_R          DSP2_BLBACK_HIST0_56_R
#define DSP2_BLBACK_HIST0_56_R_POS      (0U)
#define DSP2_BLBACK_HIST0_56_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_56_R_MSK      (((1U << DSP2_BLBACK_HIST0_56_R_LEN) - 1) << DSP2_BLBACK_HIST0_56_R_POS)
#define DSP2_BLBACK_HIST0_56_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_56_R_LEN) - 1) << DSP2_BLBACK_HIST0_56_R_POS))

