RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xAE4 : REG_HIST0_57 */
#define DSP2_BLBACK_REG_HIST0_57_OFFSET (0xAE4)
#define DSP2_BLBACK_HIST0_57_R          DSP2_BLBACK_HIST0_57_R
#define DSP2_BLBACK_HIST0_57_R_POS      (0U)
#define DSP2_BLBACK_HIST0_57_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_57_R_MSK      (((1U << DSP2_BLBACK_HIST0_57_R_LEN) - 1) << DSP2_BLBACK_HIST0_57_R_POS)
#define DSP2_BLBACK_HIST0_57_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_57_R_LEN) - 1) << DSP2_BLBACK_HIST0_57_R_POS))

/* 0xAE8 : REG_HIST0_58 */
#define DSP2_BLBACK_REG_HIST0_58_OFFSET (0xAE8)
#define DSP2_BLBACK_HIST0_58_R          DSP2_BLBACK_HIST0_58_R
#define DSP2_BLBACK_HIST0_58_R_POS      (0U)
#define DSP2_BLBACK_HIST0_58_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_58_R_MSK      (((1U << DSP2_BLBACK_HIST0_58_R_LEN) - 1) << DSP2_BLBACK_HIST0_58_R_POS)
#define DSP2_BLBACK_HIST0_58_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_58_R_LEN) - 1) << DSP2_BLBACK_HIST0_58_R_POS))

/* 0xAEC : REG_HIST0_59 */
#define DSP2_BLBACK_REG_HIST0_59_OFFSET (0xAEC)
#define DSP2_BLBACK_HIST0_59_R          DSP2_BLBACK_HIST0_59_R
#define DSP2_BLBACK_HIST0_59_R_POS      (0U)
#define DSP2_BLBACK_HIST0_59_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_59_R_MSK      (((1U << DSP2_BLBACK_HIST0_59_R_LEN) - 1) << DSP2_BLBACK_HIST0_59_R_POS)
#define DSP2_BLBACK_HIST0_59_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_59_R_LEN) - 1) << DSP2_BLBACK_HIST0_59_R_POS))

/* 0xAF0 : REG_HIST0_60 */
#define DSP2_BLBACK_REG_HIST0_60_OFFSET (0xAF0)
#define DSP2_BLBACK_HIST0_60_R          DSP2_BLBACK_HIST0_60_R
#define DSP2_BLBACK_HIST0_60_R_POS      (0U)
#define DSP2_BLBACK_HIST0_60_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_60_R_MSK      (((1U << DSP2_BLBACK_HIST0_60_R_LEN) - 1) << DSP2_BLBACK_HIST0_60_R_POS)
#define DSP2_BLBACK_HIST0_60_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_60_R_LEN) - 1) << DSP2_BLBACK_HIST0_60_R_POS))

/* 0xAF4 : REG_HIST0_61 */
#define DSP2_BLBACK_REG_HIST0_61_OFFSET (0xAF4)
#define DSP2_BLBACK_HIST0_61_R          DSP2_BLBACK_HIST0_61_R
#define DSP2_BLBACK_HIST0_61_R_POS      (0U)
#define DSP2_BLBACK_HIST0_61_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_61_R_MSK      (((1U << DSP2_BLBACK_HIST0_61_R_LEN) - 1) << DSP2_BLBACK_HIST0_61_R_POS)
#define DSP2_BLBACK_HIST0_61_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_61_R_LEN) - 1) << DSP2_BLBACK_HIST0_61_R_POS))

/* 0xAF8 : REG_HIST0_62 */
#define DSP2_BLBACK_REG_HIST0_62_OFFSET (0xAF8)
#define DSP2_BLBACK_HIST0_62_R          DSP2_BLBACK_HIST0_62_R
#define DSP2_BLBACK_HIST0_62_R_POS      (0U)
#define DSP2_BLBACK_HIST0_62_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_62_R_MSK      (((1U << DSP2_BLBACK_HIST0_62_R_LEN) - 1) << DSP2_BLBACK_HIST0_62_R_POS)
#define DSP2_BLBACK_HIST0_62_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_62_R_LEN) - 1) << DSP2_BLBACK_HIST0_62_R_POS))

/* 0xAFC : REG_HIST0_63 */
#define DSP2_BLBACK_REG_HIST0_63_OFFSET (0xAFC)
#define DSP2_BLBACK_HIST0_63_R          DSP2_BLBACK_HIST0_63_R
#define DSP2_BLBACK_HIST0_63_R_POS      (0U)
#define DSP2_BLBACK_HIST0_63_R_LEN      (24U)
#define DSP2_BLBACK_HIST0_63_R_MSK      (((1U << DSP2_BLBACK_HIST0_63_R_LEN) - 1) << DSP2_BLBACK_HIST0_63_R_POS)
#define DSP2_BLBACK_HIST0_63_R_UMSK     (~(((1U << DSP2_BLBACK_HIST0_63_R_LEN) - 1) << DSP2_BLBACK_HIST0_63_R_POS))

/* 0xB00 : REG_HIST1_0 */
#define DSP2_BLBACK_REG_HIST1_0_OFFSET (0xB00)
#define DSP2_BLBACK_HIST1_0_R          DSP2_BLBACK_HIST1_0_R
#define DSP2_BLBACK_HIST1_0_R_POS      (0U)
#define DSP2_BLBACK_HIST1_0_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_0_R_MSK      (((1U << DSP2_BLBACK_HIST1_0_R_LEN) - 1) << DSP2_BLBACK_HIST1_0_R_POS)
#define DSP2_BLBACK_HIST1_0_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_0_R_LEN) - 1) << DSP2_BLBACK_HIST1_0_R_POS))

/* 0xB04 : REG_HIST1_1 */
#define DSP2_BLBACK_REG_HIST1_1_OFFSET (0xB04)
#define DSP2_BLBACK_HIST1_1_R          DSP2_BLBACK_HIST1_1_R
#define DSP2_BLBACK_HIST1_1_R_POS      (0U)
#define DSP2_BLBACK_HIST1_1_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_1_R_MSK      (((1U << DSP2_BLBACK_HIST1_1_R_LEN) - 1) << DSP2_BLBACK_HIST1_1_R_POS)
#define DSP2_BLBACK_HIST1_1_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_1_R_LEN) - 1) << DSP2_BLBACK_HIST1_1_R_POS))

/* 0xB08 : REG_HIST1_2 */
#define DSP2_BLBACK_REG_HIST1_2_OFFSET (0xB08)
#define DSP2_BLBACK_HIST1_2_R          DSP2_BLBACK_HIST1_2_R
#define DSP2_BLBACK_HIST1_2_R_POS      (0U)
#define DSP2_BLBACK_HIST1_2_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_2_R_MSK      (((1U << DSP2_BLBACK_HIST1_2_R_LEN) - 1) << DSP2_BLBACK_HIST1_2_R_POS)
#define DSP2_BLBACK_HIST1_2_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_2_R_LEN) - 1) << DSP2_BLBACK_HIST1_2_R_POS))

/* 0xB0C : REG_HIST1_3 */
#define DSP2_BLBACK_REG_HIST1_3_OFFSET (0xB0C)
#define DSP2_BLBACK_HIST1_3_R          DSP2_BLBACK_HIST1_3_R
#define DSP2_BLBACK_HIST1_3_R_POS      (0U)
#define DSP2_BLBACK_HIST1_3_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_3_R_MSK      (((1U << DSP2_BLBACK_HIST1_3_R_LEN) - 1) << DSP2_BLBACK_HIST1_3_R_POS)
#define DSP2_BLBACK_HIST1_3_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_3_R_LEN) - 1) << DSP2_BLBACK_HIST1_3_R_POS))

/* 0xB10 : REG_HIST1_4 */
#define DSP2_BLBACK_REG_HIST1_4_OFFSET (0xB10)
#define DSP2_BLBACK_HIST1_4_R          DSP2_BLBACK_HIST1_4_R
#define DSP2_BLBACK_HIST1_4_R_POS      (0U)
#define DSP2_BLBACK_HIST1_4_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_4_R_MSK      (((1U << DSP2_BLBACK_HIST1_4_R_LEN) - 1) << DSP2_BLBACK_HIST1_4_R_POS)
#define DSP2_BLBACK_HIST1_4_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_4_R_LEN) - 1) << DSP2_BLBACK_HIST1_4_R_POS))

/* 0xB14 : REG_HIST1_5 */
#define DSP2_BLBACK_REG_HIST1_5_OFFSET (0xB14)
#define DSP2_BLBACK_HIST1_5_R          DSP2_BLBACK_HIST1_5_R
#define DSP2_BLBACK_HIST1_5_R_POS      (0U)
#define DSP2_BLBACK_HIST1_5_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_5_R_MSK      (((1U << DSP2_BLBACK_HIST1_5_R_LEN) - 1) << DSP2_BLBACK_HIST1_5_R_POS)
#define DSP2_BLBACK_HIST1_5_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_5_R_LEN) - 1) << DSP2_BLBACK_HIST1_5_R_POS))

/* 0xB18 : REG_HIST1_6 */
#define DSP2_BLBACK_REG_HIST1_6_OFFSET (0xB18)
#define DSP2_BLBACK_HIST1_6_R          DSP2_BLBACK_HIST1_6_R
#define DSP2_BLBACK_HIST1_6_R_POS      (0U)
#define DSP2_BLBACK_HIST1_6_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_6_R_MSK      (((1U << DSP2_BLBACK_HIST1_6_R_LEN) - 1) << DSP2_BLBACK_HIST1_6_R_POS)
#define DSP2_BLBACK_HIST1_6_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_6_R_LEN) - 1) << DSP2_BLBACK_HIST1_6_R_POS))

