RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xB1C : REG_HIST1_7 */
#define DSP2_BLBACK_REG_HIST1_7_OFFSET (0xB1C)
#define DSP2_BLBACK_HIST1_7_R          DSP2_BLBACK_HIST1_7_R
#define DSP2_BLBACK_HIST1_7_R_POS      (0U)
#define DSP2_BLBACK_HIST1_7_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_7_R_MSK      (((1U << DSP2_BLBACK_HIST1_7_R_LEN) - 1) << DSP2_BLBACK_HIST1_7_R_POS)
#define DSP2_BLBACK_HIST1_7_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_7_R_LEN) - 1) << DSP2_BLBACK_HIST1_7_R_POS))

/* 0xB20 : REG_HIST1_8 */
#define DSP2_BLBACK_REG_HIST1_8_OFFSET (0xB20)
#define DSP2_BLBACK_HIST1_8_R          DSP2_BLBACK_HIST1_8_R
#define DSP2_BLBACK_HIST1_8_R_POS      (0U)
#define DSP2_BLBACK_HIST1_8_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_8_R_MSK      (((1U << DSP2_BLBACK_HIST1_8_R_LEN) - 1) << DSP2_BLBACK_HIST1_8_R_POS)
#define DSP2_BLBACK_HIST1_8_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_8_R_LEN) - 1) << DSP2_BLBACK_HIST1_8_R_POS))

/* 0xB24 : REG_HIST1_9 */
#define DSP2_BLBACK_REG_HIST1_9_OFFSET (0xB24)
#define DSP2_BLBACK_HIST1_9_R          DSP2_BLBACK_HIST1_9_R
#define DSP2_BLBACK_HIST1_9_R_POS      (0U)
#define DSP2_BLBACK_HIST1_9_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_9_R_MSK      (((1U << DSP2_BLBACK_HIST1_9_R_LEN) - 1) << DSP2_BLBACK_HIST1_9_R_POS)
#define DSP2_BLBACK_HIST1_9_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_9_R_LEN) - 1) << DSP2_BLBACK_HIST1_9_R_POS))

/* 0xB28 : REG_HIST1_10 */
#define DSP2_BLBACK_REG_HIST1_10_OFFSET (0xB28)
#define DSP2_BLBACK_HIST1_10_R          DSP2_BLBACK_HIST1_10_R
#define DSP2_BLBACK_HIST1_10_R_POS      (0U)
#define DSP2_BLBACK_HIST1_10_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_10_R_MSK      (((1U << DSP2_BLBACK_HIST1_10_R_LEN) - 1) << DSP2_BLBACK_HIST1_10_R_POS)
#define DSP2_BLBACK_HIST1_10_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_10_R_LEN) - 1) << DSP2_BLBACK_HIST1_10_R_POS))

/* 0xB2C : REG_HIST1_11 */
#define DSP2_BLBACK_REG_HIST1_11_OFFSET (0xB2C)
#define DSP2_BLBACK_HIST1_11_R          DSP2_BLBACK_HIST1_11_R
#define DSP2_BLBACK_HIST1_11_R_POS      (0U)
#define DSP2_BLBACK_HIST1_11_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_11_R_MSK      (((1U << DSP2_BLBACK_HIST1_11_R_LEN) - 1) << DSP2_BLBACK_HIST1_11_R_POS)
#define DSP2_BLBACK_HIST1_11_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_11_R_LEN) - 1) << DSP2_BLBACK_HIST1_11_R_POS))

/* 0xB30 : REG_HIST1_12 */
#define DSP2_BLBACK_REG_HIST1_12_OFFSET (0xB30)
#define DSP2_BLBACK_HIST1_12_R          DSP2_BLBACK_HIST1_12_R
#define DSP2_BLBACK_HIST1_12_R_POS      (0U)
#define DSP2_BLBACK_HIST1_12_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_12_R_MSK      (((1U << DSP2_BLBACK_HIST1_12_R_LEN) - 1) << DSP2_BLBACK_HIST1_12_R_POS)
#define DSP2_BLBACK_HIST1_12_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_12_R_LEN) - 1) << DSP2_BLBACK_HIST1_12_R_POS))

/* 0xB34 : REG_HIST1_13 */
#define DSP2_BLBACK_REG_HIST1_13_OFFSET (0xB34)
#define DSP2_BLBACK_HIST1_13_R          DSP2_BLBACK_HIST1_13_R
#define DSP2_BLBACK_HIST1_13_R_POS      (0U)
#define DSP2_BLBACK_HIST1_13_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_13_R_MSK      (((1U << DSP2_BLBACK_HIST1_13_R_LEN) - 1) << DSP2_BLBACK_HIST1_13_R_POS)
#define DSP2_BLBACK_HIST1_13_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_13_R_LEN) - 1) << DSP2_BLBACK_HIST1_13_R_POS))

/* 0xB38 : REG_HIST1_14 */
#define DSP2_BLBACK_REG_HIST1_14_OFFSET (0xB38)
#define DSP2_BLBACK_HIST1_14_R          DSP2_BLBACK_HIST1_14_R
#define DSP2_BLBACK_HIST1_14_R_POS      (0U)
#define DSP2_BLBACK_HIST1_14_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_14_R_MSK      (((1U << DSP2_BLBACK_HIST1_14_R_LEN) - 1) << DSP2_BLBACK_HIST1_14_R_POS)
#define DSP2_BLBACK_HIST1_14_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_14_R_LEN) - 1) << DSP2_BLBACK_HIST1_14_R_POS))

/* 0xB3C : REG_HIST1_15 */
#define DSP2_BLBACK_REG_HIST1_15_OFFSET (0xB3C)
#define DSP2_BLBACK_HIST1_15_R          DSP2_BLBACK_HIST1_15_R
#define DSP2_BLBACK_HIST1_15_R_POS      (0U)
#define DSP2_BLBACK_HIST1_15_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_15_R_MSK      (((1U << DSP2_BLBACK_HIST1_15_R_LEN) - 1) << DSP2_BLBACK_HIST1_15_R_POS)
#define DSP2_BLBACK_HIST1_15_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_15_R_LEN) - 1) << DSP2_BLBACK_HIST1_15_R_POS))

/* 0xB40 : REG_HIST1_16 */
#define DSP2_BLBACK_REG_HIST1_16_OFFSET (0xB40)
#define DSP2_BLBACK_HIST1_16_R          DSP2_BLBACK_HIST1_16_R
#define DSP2_BLBACK_HIST1_16_R_POS      (0U)
#define DSP2_BLBACK_HIST1_16_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_16_R_MSK      (((1U << DSP2_BLBACK_HIST1_16_R_LEN) - 1) << DSP2_BLBACK_HIST1_16_R_POS)
#define DSP2_BLBACK_HIST1_16_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_16_R_LEN) - 1) << DSP2_BLBACK_HIST1_16_R_POS))

/* 0xB44 : REG_HIST1_17 */
#define DSP2_BLBACK_REG_HIST1_17_OFFSET (0xB44)
#define DSP2_BLBACK_HIST1_17_R          DSP2_BLBACK_HIST1_17_R
#define DSP2_BLBACK_HIST1_17_R_POS      (0U)
#define DSP2_BLBACK_HIST1_17_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_17_R_MSK      (((1U << DSP2_BLBACK_HIST1_17_R_LEN) - 1) << DSP2_BLBACK_HIST1_17_R_POS)
#define DSP2_BLBACK_HIST1_17_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_17_R_LEN) - 1) << DSP2_BLBACK_HIST1_17_R_POS))

/* 0xB48 : REG_HIST1_18 */
#define DSP2_BLBACK_REG_HIST1_18_OFFSET (0xB48)
#define DSP2_BLBACK_HIST1_18_R          DSP2_BLBACK_HIST1_18_R
#define DSP2_BLBACK_HIST1_18_R_POS      (0U)
#define DSP2_BLBACK_HIST1_18_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_18_R_MSK      (((1U << DSP2_BLBACK_HIST1_18_R_LEN) - 1) << DSP2_BLBACK_HIST1_18_R_POS)
#define DSP2_BLBACK_HIST1_18_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_18_R_LEN) - 1) << DSP2_BLBACK_HIST1_18_R_POS))

/* 0xB4C : REG_HIST1_19 */
#define DSP2_BLBACK_REG_HIST1_19_OFFSET (0xB4C)
#define DSP2_BLBACK_HIST1_19_R          DSP2_BLBACK_HIST1_19_R
#define DSP2_BLBACK_HIST1_19_R_POS      (0U)
#define DSP2_BLBACK_HIST1_19_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_19_R_MSK      (((1U << DSP2_BLBACK_HIST1_19_R_LEN) - 1) << DSP2_BLBACK_HIST1_19_R_POS)
#define DSP2_BLBACK_HIST1_19_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_19_R_LEN) - 1) << DSP2_BLBACK_HIST1_19_R_POS))

/* 0xB50 : REG_HIST1_20 */
#define DSP2_BLBACK_REG_HIST1_20_OFFSET (0xB50)
#define DSP2_BLBACK_HIST1_20_R          DSP2_BLBACK_HIST1_20_R
#define DSP2_BLBACK_HIST1_20_R_POS      (0U)
#define DSP2_BLBACK_HIST1_20_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_20_R_MSK      (((1U << DSP2_BLBACK_HIST1_20_R_LEN) - 1) << DSP2_BLBACK_HIST1_20_R_POS)
#define DSP2_BLBACK_HIST1_20_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_20_R_LEN) - 1) << DSP2_BLBACK_HIST1_20_R_POS))

/* 0xB54 : REG_HIST1_21 */
#define DSP2_BLBACK_REG_HIST1_21_OFFSET (0xB54)
#define DSP2_BLBACK_HIST1_21_R          DSP2_BLBACK_HIST1_21_R
#define DSP2_BLBACK_HIST1_21_R_POS      (0U)
#define DSP2_BLBACK_HIST1_21_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_21_R_MSK      (((1U << DSP2_BLBACK_HIST1_21_R_LEN) - 1) << DSP2_BLBACK_HIST1_21_R_POS)
#define DSP2_BLBACK_HIST1_21_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_21_R_LEN) - 1) << DSP2_BLBACK_HIST1_21_R_POS))

/* 0xB58 : REG_HIST1_22 */
#define DSP2_BLBACK_REG_HIST1_22_OFFSET (0xB58)
#define DSP2_BLBACK_HIST1_22_R          DSP2_BLBACK_HIST1_22_R
#define DSP2_BLBACK_HIST1_22_R_POS      (0U)
#define DSP2_BLBACK_HIST1_22_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_22_R_MSK      (((1U << DSP2_BLBACK_HIST1_22_R_LEN) - 1) << DSP2_BLBACK_HIST1_22_R_POS)
#define DSP2_BLBACK_HIST1_22_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_22_R_LEN) - 1) << DSP2_BLBACK_HIST1_22_R_POS))

/* 0xB5C : REG_HIST1_23 */
#define DSP2_BLBACK_REG_HIST1_23_OFFSET (0xB5C)
#define DSP2_BLBACK_HIST1_23_R          DSP2_BLBACK_HIST1_23_R
#define DSP2_BLBACK_HIST1_23_R_POS      (0U)
#define DSP2_BLBACK_HIST1_23_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_23_R_MSK      (((1U << DSP2_BLBACK_HIST1_23_R_LEN) - 1) << DSP2_BLBACK_HIST1_23_R_POS)
#define DSP2_BLBACK_HIST1_23_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_23_R_LEN) - 1) << DSP2_BLBACK_HIST1_23_R_POS))

/* 0xB60 : REG_HIST1_24 */
#define DSP2_BLBACK_REG_HIST1_24_OFFSET (0xB60)
#define DSP2_BLBACK_HIST1_24_R          DSP2_BLBACK_HIST1_24_R
#define DSP2_BLBACK_HIST1_24_R_POS      (0U)
#define DSP2_BLBACK_HIST1_24_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_24_R_MSK      (((1U << DSP2_BLBACK_HIST1_24_R_LEN) - 1) << DSP2_BLBACK_HIST1_24_R_POS)
#define DSP2_BLBACK_HIST1_24_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_24_R_LEN) - 1) << DSP2_BLBACK_HIST1_24_R_POS))

/* 0xB64 : REG_HIST1_25 */
#define DSP2_BLBACK_REG_HIST1_25_OFFSET (0xB64)
#define DSP2_BLBACK_HIST1_25_R          DSP2_BLBACK_HIST1_25_R
#define DSP2_BLBACK_HIST1_25_R_POS      (0U)
#define DSP2_BLBACK_HIST1_25_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_25_R_MSK      (((1U << DSP2_BLBACK_HIST1_25_R_LEN) - 1) << DSP2_BLBACK_HIST1_25_R_POS)
#define DSP2_BLBACK_HIST1_25_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_25_R_LEN) - 1) << DSP2_BLBACK_HIST1_25_R_POS))

/* 0xB68 : REG_HIST1_26 */
#define DSP2_BLBACK_REG_HIST1_26_OFFSET (0xB68)
#define DSP2_BLBACK_HIST1_26_R          DSP2_BLBACK_HIST1_26_R
#define DSP2_BLBACK_HIST1_26_R_POS      (0U)
#define DSP2_BLBACK_HIST1_26_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_26_R_MSK      (((1U << DSP2_BLBACK_HIST1_26_R_LEN) - 1) << DSP2_BLBACK_HIST1_26_R_POS)
#define DSP2_BLBACK_HIST1_26_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_26_R_LEN) - 1) << DSP2_BLBACK_HIST1_26_R_POS))

