RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xB6C : REG_HIST1_27 */
#define DSP2_BLBACK_REG_HIST1_27_OFFSET (0xB6C)
#define DSP2_BLBACK_HIST1_27_R          DSP2_BLBACK_HIST1_27_R
#define DSP2_BLBACK_HIST1_27_R_POS      (0U)
#define DSP2_BLBACK_HIST1_27_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_27_R_MSK      (((1U << DSP2_BLBACK_HIST1_27_R_LEN) - 1) << DSP2_BLBACK_HIST1_27_R_POS)
#define DSP2_BLBACK_HIST1_27_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_27_R_LEN) - 1) << DSP2_BLBACK_HIST1_27_R_POS))

/* 0xB70 : REG_HIST1_28 */
#define DSP2_BLBACK_REG_HIST1_28_OFFSET (0xB70)
#define DSP2_BLBACK_HIST1_28_R          DSP2_BLBACK_HIST1_28_R
#define DSP2_BLBACK_HIST1_28_R_POS      (0U)
#define DSP2_BLBACK_HIST1_28_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_28_R_MSK      (((1U << DSP2_BLBACK_HIST1_28_R_LEN) - 1) << DSP2_BLBACK_HIST1_28_R_POS)
#define DSP2_BLBACK_HIST1_28_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_28_R_LEN) - 1) << DSP2_BLBACK_HIST1_28_R_POS))

/* 0xB74 : REG_HIST1_29 */
#define DSP2_BLBACK_REG_HIST1_29_OFFSET (0xB74)
#define DSP2_BLBACK_HIST1_29_R          DSP2_BLBACK_HIST1_29_R
#define DSP2_BLBACK_HIST1_29_R_POS      (0U)
#define DSP2_BLBACK_HIST1_29_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_29_R_MSK      (((1U << DSP2_BLBACK_HIST1_29_R_LEN) - 1) << DSP2_BLBACK_HIST1_29_R_POS)
#define DSP2_BLBACK_HIST1_29_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_29_R_LEN) - 1) << DSP2_BLBACK_HIST1_29_R_POS))

/* 0xB78 : REG_HIST1_30 */
#define DSP2_BLBACK_REG_HIST1_30_OFFSET (0xB78)
#define DSP2_BLBACK_HIST1_30_R          DSP2_BLBACK_HIST1_30_R
#define DSP2_BLBACK_HIST1_30_R_POS      (0U)
#define DSP2_BLBACK_HIST1_30_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_30_R_MSK      (((1U << DSP2_BLBACK_HIST1_30_R_LEN) - 1) << DSP2_BLBACK_HIST1_30_R_POS)
#define DSP2_BLBACK_HIST1_30_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_30_R_LEN) - 1) << DSP2_BLBACK_HIST1_30_R_POS))

/* 0xB7C : REG_HIST1_31 */
#define DSP2_BLBACK_REG_HIST1_31_OFFSET (0xB7C)
#define DSP2_BLBACK_HIST1_31_R          DSP2_BLBACK_HIST1_31_R
#define DSP2_BLBACK_HIST1_31_R_POS      (0U)
#define DSP2_BLBACK_HIST1_31_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_31_R_MSK      (((1U << DSP2_BLBACK_HIST1_31_R_LEN) - 1) << DSP2_BLBACK_HIST1_31_R_POS)
#define DSP2_BLBACK_HIST1_31_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_31_R_LEN) - 1) << DSP2_BLBACK_HIST1_31_R_POS))

/* 0xB80 : REG_HIST1_32 */
#define DSP2_BLBACK_REG_HIST1_32_OFFSET (0xB80)
#define DSP2_BLBACK_HIST1_32_R          DSP2_BLBACK_HIST1_32_R
#define DSP2_BLBACK_HIST1_32_R_POS      (0U)
#define DSP2_BLBACK_HIST1_32_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_32_R_MSK      (((1U << DSP2_BLBACK_HIST1_32_R_LEN) - 1) << DSP2_BLBACK_HIST1_32_R_POS)
#define DSP2_BLBACK_HIST1_32_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_32_R_LEN) - 1) << DSP2_BLBACK_HIST1_32_R_POS))

/* 0xB84 : REG_HIST1_33 */
#define DSP2_BLBACK_REG_HIST1_33_OFFSET (0xB84)
#define DSP2_BLBACK_HIST1_33_R          DSP2_BLBACK_HIST1_33_R
#define DSP2_BLBACK_HIST1_33_R_POS      (0U)
#define DSP2_BLBACK_HIST1_33_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_33_R_MSK      (((1U << DSP2_BLBACK_HIST1_33_R_LEN) - 1) << DSP2_BLBACK_HIST1_33_R_POS)
#define DSP2_BLBACK_HIST1_33_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_33_R_LEN) - 1) << DSP2_BLBACK_HIST1_33_R_POS))

/* 0xB88 : REG_HIST1_34 */
#define DSP2_BLBACK_REG_HIST1_34_OFFSET (0xB88)
#define DSP2_BLBACK_HIST1_34_R          DSP2_BLBACK_HIST1_34_R
#define DSP2_BLBACK_HIST1_34_R_POS      (0U)
#define DSP2_BLBACK_HIST1_34_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_34_R_MSK      (((1U << DSP2_BLBACK_HIST1_34_R_LEN) - 1) << DSP2_BLBACK_HIST1_34_R_POS)
#define DSP2_BLBACK_HIST1_34_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_34_R_LEN) - 1) << DSP2_BLBACK_HIST1_34_R_POS))

/* 0xB8C : REG_HIST1_35 */
#define DSP2_BLBACK_REG_HIST1_35_OFFSET (0xB8C)
#define DSP2_BLBACK_HIST1_35_R          DSP2_BLBACK_HIST1_35_R
#define DSP2_BLBACK_HIST1_35_R_POS      (0U)
#define DSP2_BLBACK_HIST1_35_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_35_R_MSK      (((1U << DSP2_BLBACK_HIST1_35_R_LEN) - 1) << DSP2_BLBACK_HIST1_35_R_POS)
#define DSP2_BLBACK_HIST1_35_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_35_R_LEN) - 1) << DSP2_BLBACK_HIST1_35_R_POS))

/* 0xB90 : REG_HIST1_36 */
#define DSP2_BLBACK_REG_HIST1_36_OFFSET (0xB90)
#define DSP2_BLBACK_HIST1_36_R          DSP2_BLBACK_HIST1_36_R
#define DSP2_BLBACK_HIST1_36_R_POS      (0U)
#define DSP2_BLBACK_HIST1_36_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_36_R_MSK      (((1U << DSP2_BLBACK_HIST1_36_R_LEN) - 1) << DSP2_BLBACK_HIST1_36_R_POS)
#define DSP2_BLBACK_HIST1_36_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_36_R_LEN) - 1) << DSP2_BLBACK_HIST1_36_R_POS))

/* 0xB94 : REG_HIST1_37 */
#define DSP2_BLBACK_REG_HIST1_37_OFFSET (0xB94)
#define DSP2_BLBACK_HIST1_37_R          DSP2_BLBACK_HIST1_37_R
#define DSP2_BLBACK_HIST1_37_R_POS      (0U)
#define DSP2_BLBACK_HIST1_37_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_37_R_MSK      (((1U << DSP2_BLBACK_HIST1_37_R_LEN) - 1) << DSP2_BLBACK_HIST1_37_R_POS)
#define DSP2_BLBACK_HIST1_37_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_37_R_LEN) - 1) << DSP2_BLBACK_HIST1_37_R_POS))

/* 0xB98 : REG_HIST1_38 */
#define DSP2_BLBACK_REG_HIST1_38_OFFSET (0xB98)
#define DSP2_BLBACK_HIST1_38_R          DSP2_BLBACK_HIST1_38_R
#define DSP2_BLBACK_HIST1_38_R_POS      (0U)
#define DSP2_BLBACK_HIST1_38_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_38_R_MSK      (((1U << DSP2_BLBACK_HIST1_38_R_LEN) - 1) << DSP2_BLBACK_HIST1_38_R_POS)
#define DSP2_BLBACK_HIST1_38_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_38_R_LEN) - 1) << DSP2_BLBACK_HIST1_38_R_POS))

/* 0xB9C : REG_HIST1_39 */
#define DSP2_BLBACK_REG_HIST1_39_OFFSET (0xB9C)
#define DSP2_BLBACK_HIST1_39_R          DSP2_BLBACK_HIST1_39_R
#define DSP2_BLBACK_HIST1_39_R_POS      (0U)
#define DSP2_BLBACK_HIST1_39_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_39_R_MSK      (((1U << DSP2_BLBACK_HIST1_39_R_LEN) - 1) << DSP2_BLBACK_HIST1_39_R_POS)
#define DSP2_BLBACK_HIST1_39_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_39_R_LEN) - 1) << DSP2_BLBACK_HIST1_39_R_POS))

/* 0xBA0 : REG_HIST1_40 */
#define DSP2_BLBACK_REG_HIST1_40_OFFSET (0xBA0)
#define DSP2_BLBACK_HIST1_40_R          DSP2_BLBACK_HIST1_40_R
#define DSP2_BLBACK_HIST1_40_R_POS      (0U)
#define DSP2_BLBACK_HIST1_40_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_40_R_MSK      (((1U << DSP2_BLBACK_HIST1_40_R_LEN) - 1) << DSP2_BLBACK_HIST1_40_R_POS)
#define DSP2_BLBACK_HIST1_40_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_40_R_LEN) - 1) << DSP2_BLBACK_HIST1_40_R_POS))

/* 0xBA4 : REG_HIST1_41 */
#define DSP2_BLBACK_REG_HIST1_41_OFFSET (0xBA4)
#define DSP2_BLBACK_HIST1_41_R          DSP2_BLBACK_HIST1_41_R
#define DSP2_BLBACK_HIST1_41_R_POS      (0U)
#define DSP2_BLBACK_HIST1_41_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_41_R_MSK      (((1U << DSP2_BLBACK_HIST1_41_R_LEN) - 1) << DSP2_BLBACK_HIST1_41_R_POS)
#define DSP2_BLBACK_HIST1_41_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_41_R_LEN) - 1) << DSP2_BLBACK_HIST1_41_R_POS))

/* 0xBA8 : REG_HIST1_42 */
#define DSP2_BLBACK_REG_HIST1_42_OFFSET (0xBA8)
#define DSP2_BLBACK_HIST1_42_R          DSP2_BLBACK_HIST1_42_R
#define DSP2_BLBACK_HIST1_42_R_POS      (0U)
#define DSP2_BLBACK_HIST1_42_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_42_R_MSK      (((1U << DSP2_BLBACK_HIST1_42_R_LEN) - 1) << DSP2_BLBACK_HIST1_42_R_POS)
#define DSP2_BLBACK_HIST1_42_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_42_R_LEN) - 1) << DSP2_BLBACK_HIST1_42_R_POS))

