RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xBAC : REG_HIST1_43 */
#define DSP2_BLBACK_REG_HIST1_43_OFFSET (0xBAC)
#define DSP2_BLBACK_HIST1_43_R          DSP2_BLBACK_HIST1_43_R
#define DSP2_BLBACK_HIST1_43_R_POS      (0U)
#define DSP2_BLBACK_HIST1_43_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_43_R_MSK      (((1U << DSP2_BLBACK_HIST1_43_R_LEN) - 1) << DSP2_BLBACK_HIST1_43_R_POS)
#define DSP2_BLBACK_HIST1_43_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_43_R_LEN) - 1) << DSP2_BLBACK_HIST1_43_R_POS))

/* 0xBB0 : REG_HIST1_44 */
#define DSP2_BLBACK_REG_HIST1_44_OFFSET (0xBB0)
#define DSP2_BLBACK_HIST1_44_R          DSP2_BLBACK_HIST1_44_R
#define DSP2_BLBACK_HIST1_44_R_POS      (0U)
#define DSP2_BLBACK_HIST1_44_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_44_R_MSK      (((1U << DSP2_BLBACK_HIST1_44_R_LEN) - 1) << DSP2_BLBACK_HIST1_44_R_POS)
#define DSP2_BLBACK_HIST1_44_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_44_R_LEN) - 1) << DSP2_BLBACK_HIST1_44_R_POS))

/* 0xBB4 : REG_HIST1_45 */
#define DSP2_BLBACK_REG_HIST1_45_OFFSET (0xBB4)
#define DSP2_BLBACK_HIST1_45_R          DSP2_BLBACK_HIST1_45_R
#define DSP2_BLBACK_HIST1_45_R_POS      (0U)
#define DSP2_BLBACK_HIST1_45_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_45_R_MSK      (((1U << DSP2_BLBACK_HIST1_45_R_LEN) - 1) << DSP2_BLBACK_HIST1_45_R_POS)
#define DSP2_BLBACK_HIST1_45_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_45_R_LEN) - 1) << DSP2_BLBACK_HIST1_45_R_POS))

/* 0xBB8 : REG_HIST1_46 */
#define DSP2_BLBACK_REG_HIST1_46_OFFSET (0xBB8)
#define DSP2_BLBACK_HIST1_46_R          DSP2_BLBACK_HIST1_46_R
#define DSP2_BLBACK_HIST1_46_R_POS      (0U)
#define DSP2_BLBACK_HIST1_46_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_46_R_MSK      (((1U << DSP2_BLBACK_HIST1_46_R_LEN) - 1) << DSP2_BLBACK_HIST1_46_R_POS)
#define DSP2_BLBACK_HIST1_46_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_46_R_LEN) - 1) << DSP2_BLBACK_HIST1_46_R_POS))

/* 0xBBC : REG_HIST1_47 */
#define DSP2_BLBACK_REG_HIST1_47_OFFSET (0xBBC)
#define DSP2_BLBACK_HIST1_47_R          DSP2_BLBACK_HIST1_47_R
#define DSP2_BLBACK_HIST1_47_R_POS      (0U)
#define DSP2_BLBACK_HIST1_47_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_47_R_MSK      (((1U << DSP2_BLBACK_HIST1_47_R_LEN) - 1) << DSP2_BLBACK_HIST1_47_R_POS)
#define DSP2_BLBACK_HIST1_47_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_47_R_LEN) - 1) << DSP2_BLBACK_HIST1_47_R_POS))

/* 0xBC0 : REG_HIST1_48 */
#define DSP2_BLBACK_REG_HIST1_48_OFFSET (0xBC0)
#define DSP2_BLBACK_HIST1_48_R          DSP2_BLBACK_HIST1_48_R
#define DSP2_BLBACK_HIST1_48_R_POS      (0U)
#define DSP2_BLBACK_HIST1_48_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_48_R_MSK      (((1U << DSP2_BLBACK_HIST1_48_R_LEN) - 1) << DSP2_BLBACK_HIST1_48_R_POS)
#define DSP2_BLBACK_HIST1_48_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_48_R_LEN) - 1) << DSP2_BLBACK_HIST1_48_R_POS))

/* 0xBC4 : REG_HIST1_49 */
#define DSP2_BLBACK_REG_HIST1_49_OFFSET (0xBC4)
#define DSP2_BLBACK_HIST1_49_R          DSP2_BLBACK_HIST1_49_R
#define DSP2_BLBACK_HIST1_49_R_POS      (0U)
#define DSP2_BLBACK_HIST1_49_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_49_R_MSK      (((1U << DSP2_BLBACK_HIST1_49_R_LEN) - 1) << DSP2_BLBACK_HIST1_49_R_POS)
#define DSP2_BLBACK_HIST1_49_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_49_R_LEN) - 1) << DSP2_BLBACK_HIST1_49_R_POS))

/* 0xBC8 : REG_HIST1_50 */
#define DSP2_BLBACK_REG_HIST1_50_OFFSET (0xBC8)
#define DSP2_BLBACK_HIST1_50_R          DSP2_BLBACK_HIST1_50_R
#define DSP2_BLBACK_HIST1_50_R_POS      (0U)
#define DSP2_BLBACK_HIST1_50_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_50_R_MSK      (((1U << DSP2_BLBACK_HIST1_50_R_LEN) - 1) << DSP2_BLBACK_HIST1_50_R_POS)
#define DSP2_BLBACK_HIST1_50_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_50_R_LEN) - 1) << DSP2_BLBACK_HIST1_50_R_POS))

/* 0xBCC : REG_HIST1_51 */
#define DSP2_BLBACK_REG_HIST1_51_OFFSET (0xBCC)
#define DSP2_BLBACK_HIST1_51_R          DSP2_BLBACK_HIST1_51_R
#define DSP2_BLBACK_HIST1_51_R_POS      (0U)
#define DSP2_BLBACK_HIST1_51_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_51_R_MSK      (((1U << DSP2_BLBACK_HIST1_51_R_LEN) - 1) << DSP2_BLBACK_HIST1_51_R_POS)
#define DSP2_BLBACK_HIST1_51_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_51_R_LEN) - 1) << DSP2_BLBACK_HIST1_51_R_POS))

/* 0xBD0 : REG_HIST1_52 */
#define DSP2_BLBACK_REG_HIST1_52_OFFSET (0xBD0)
#define DSP2_BLBACK_HIST1_52_R          DSP2_BLBACK_HIST1_52_R
#define DSP2_BLBACK_HIST1_52_R_POS      (0U)
#define DSP2_BLBACK_HIST1_52_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_52_R_MSK      (((1U << DSP2_BLBACK_HIST1_52_R_LEN) - 1) << DSP2_BLBACK_HIST1_52_R_POS)
#define DSP2_BLBACK_HIST1_52_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_52_R_LEN) - 1) << DSP2_BLBACK_HIST1_52_R_POS))

/* 0xBD4 : REG_HIST1_53 */
#define DSP2_BLBACK_REG_HIST1_53_OFFSET (0xBD4)
#define DSP2_BLBACK_HIST1_53_R          DSP2_BLBACK_HIST1_53_R
#define DSP2_BLBACK_HIST1_53_R_POS      (0U)
#define DSP2_BLBACK_HIST1_53_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_53_R_MSK      (((1U << DSP2_BLBACK_HIST1_53_R_LEN) - 1) << DSP2_BLBACK_HIST1_53_R_POS)
#define DSP2_BLBACK_HIST1_53_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_53_R_LEN) - 1) << DSP2_BLBACK_HIST1_53_R_POS))

/* 0xBD8 : REG_HIST1_54 */
#define DSP2_BLBACK_REG_HIST1_54_OFFSET (0xBD8)
#define DSP2_BLBACK_HIST1_54_R          DSP2_BLBACK_HIST1_54_R
#define DSP2_BLBACK_HIST1_54_R_POS      (0U)
#define DSP2_BLBACK_HIST1_54_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_54_R_MSK      (((1U << DSP2_BLBACK_HIST1_54_R_LEN) - 1) << DSP2_BLBACK_HIST1_54_R_POS)
#define DSP2_BLBACK_HIST1_54_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_54_R_LEN) - 1) << DSP2_BLBACK_HIST1_54_R_POS))

/* 0xBDC : REG_HIST1_55 */
#define DSP2_BLBACK_REG_HIST1_55_OFFSET (0xBDC)
#define DSP2_BLBACK_HIST1_55_R          DSP2_BLBACK_HIST1_55_R
#define DSP2_BLBACK_HIST1_55_R_POS      (0U)
#define DSP2_BLBACK_HIST1_55_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_55_R_MSK      (((1U << DSP2_BLBACK_HIST1_55_R_LEN) - 1) << DSP2_BLBACK_HIST1_55_R_POS)
#define DSP2_BLBACK_HIST1_55_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_55_R_LEN) - 1) << DSP2_BLBACK_HIST1_55_R_POS))

/* 0xBE0 : REG_HIST1_56 */
#define DSP2_BLBACK_REG_HIST1_56_OFFSET (0xBE0)
#define DSP2_BLBACK_HIST1_56_R          DSP2_BLBACK_HIST1_56_R
#define DSP2_BLBACK_HIST1_56_R_POS      (0U)
#define DSP2_BLBACK_HIST1_56_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_56_R_MSK      (((1U << DSP2_BLBACK_HIST1_56_R_LEN) - 1) << DSP2_BLBACK_HIST1_56_R_POS)
#define DSP2_BLBACK_HIST1_56_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_56_R_LEN) - 1) << DSP2_BLBACK_HIST1_56_R_POS))

/* 0xBE4 : REG_HIST1_57 */
#define DSP2_BLBACK_REG_HIST1_57_OFFSET (0xBE4)
#define DSP2_BLBACK_HIST1_57_R          DSP2_BLBACK_HIST1_57_R
#define DSP2_BLBACK_HIST1_57_R_POS      (0U)
#define DSP2_BLBACK_HIST1_57_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_57_R_MSK      (((1U << DSP2_BLBACK_HIST1_57_R_LEN) - 1) << DSP2_BLBACK_HIST1_57_R_POS)
#define DSP2_BLBACK_HIST1_57_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_57_R_LEN) - 1) << DSP2_BLBACK_HIST1_57_R_POS))

/* 0xBE8 : REG_HIST1_58 */
#define DSP2_BLBACK_REG_HIST1_58_OFFSET (0xBE8)
#define DSP2_BLBACK_HIST1_58_R          DSP2_BLBACK_HIST1_58_R
#define DSP2_BLBACK_HIST1_58_R_POS      (0U)
#define DSP2_BLBACK_HIST1_58_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_58_R_MSK      (((1U << DSP2_BLBACK_HIST1_58_R_LEN) - 1) << DSP2_BLBACK_HIST1_58_R_POS)
#define DSP2_BLBACK_HIST1_58_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_58_R_LEN) - 1) << DSP2_BLBACK_HIST1_58_R_POS))

/* 0xBEC : REG_HIST1_59 */
#define DSP2_BLBACK_REG_HIST1_59_OFFSET (0xBEC)
#define DSP2_BLBACK_HIST1_59_R          DSP2_BLBACK_HIST1_59_R
#define DSP2_BLBACK_HIST1_59_R_POS      (0U)
#define DSP2_BLBACK_HIST1_59_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_59_R_MSK      (((1U << DSP2_BLBACK_HIST1_59_R_LEN) - 1) << DSP2_BLBACK_HIST1_59_R_POS)
#define DSP2_BLBACK_HIST1_59_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_59_R_LEN) - 1) << DSP2_BLBACK_HIST1_59_R_POS))

/* 0xBF0 : REG_HIST1_60 */
#define DSP2_BLBACK_REG_HIST1_60_OFFSET (0xBF0)
#define DSP2_BLBACK_HIST1_60_R          DSP2_BLBACK_HIST1_60_R
#define DSP2_BLBACK_HIST1_60_R_POS      (0U)
#define DSP2_BLBACK_HIST1_60_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_60_R_MSK      (((1U << DSP2_BLBACK_HIST1_60_R_LEN) - 1) << DSP2_BLBACK_HIST1_60_R_POS)
#define DSP2_BLBACK_HIST1_60_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_60_R_LEN) - 1) << DSP2_BLBACK_HIST1_60_R_POS))

/* 0xBF4 : REG_HIST1_61 */
#define DSP2_BLBACK_REG_HIST1_61_OFFSET (0xBF4)
#define DSP2_BLBACK_HIST1_61_R          DSP2_BLBACK_HIST1_61_R
#define DSP2_BLBACK_HIST1_61_R_POS      (0U)
#define DSP2_BLBACK_HIST1_61_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_61_R_MSK      (((1U << DSP2_BLBACK_HIST1_61_R_LEN) - 1) << DSP2_BLBACK_HIST1_61_R_POS)
#define DSP2_BLBACK_HIST1_61_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_61_R_LEN) - 1) << DSP2_BLBACK_HIST1_61_R_POS))

