RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xBF8 : REG_HIST1_62 */
#define DSP2_BLBACK_REG_HIST1_62_OFFSET (0xBF8)
#define DSP2_BLBACK_HIST1_62_R          DSP2_BLBACK_HIST1_62_R
#define DSP2_BLBACK_HIST1_62_R_POS      (0U)
#define DSP2_BLBACK_HIST1_62_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_62_R_MSK      (((1U << DSP2_BLBACK_HIST1_62_R_LEN) - 1) << DSP2_BLBACK_HIST1_62_R_POS)
#define DSP2_BLBACK_HIST1_62_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_62_R_LEN) - 1) << DSP2_BLBACK_HIST1_62_R_POS))

/* 0xBFC : REG_HIST1_63 */
#define DSP2_BLBACK_REG_HIST1_63_OFFSET (0xBFC)
#define DSP2_BLBACK_HIST1_63_R          DSP2_BLBACK_HIST1_63_R
#define DSP2_BLBACK_HIST1_63_R_POS      (0U)
#define DSP2_BLBACK_HIST1_63_R_LEN      (24U)
#define DSP2_BLBACK_HIST1_63_R_MSK      (((1U << DSP2_BLBACK_HIST1_63_R_LEN) - 1) << DSP2_BLBACK_HIST1_63_R_POS)
#define DSP2_BLBACK_HIST1_63_R_UMSK     (~(((1U << DSP2_BLBACK_HIST1_63_R_LEN) - 1) << DSP2_BLBACK_HIST1_63_R_POS))

/* 0xC00 : WDR_CURVE_1 */
#define DSP2_BLBACK_WDR_CURVE_1_OFFSET (0xC00)
#define DSP2_BLBACK_CURVE_0_PRE        DSP2_BLBACK_CURVE_0_PRE
#define DSP2_BLBACK_CURVE_0_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_0_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_0_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_0_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_0_PRE_POS)
#define DSP2_BLBACK_CURVE_0_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_0_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_0_PRE_POS))
#define DSP2_BLBACK_CURVE_1_PRE        DSP2_BLBACK_CURVE_1_PRE
#define DSP2_BLBACK_CURVE_1_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_1_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_1_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_1_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_1_PRE_POS)
#define DSP2_BLBACK_CURVE_1_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_1_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_1_PRE_POS))

/* 0xC04 : WDR_CURVE_2 */
#define DSP2_BLBACK_WDR_CURVE_2_OFFSET (0xC04)
#define DSP2_BLBACK_CURVE_2_PRE        DSP2_BLBACK_CURVE_2_PRE
#define DSP2_BLBACK_CURVE_2_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_2_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_2_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_2_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_2_PRE_POS)
#define DSP2_BLBACK_CURVE_2_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_2_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_2_PRE_POS))
#define DSP2_BLBACK_CURVE_3_PRE        DSP2_BLBACK_CURVE_3_PRE
#define DSP2_BLBACK_CURVE_3_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_3_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_3_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_3_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_3_PRE_POS)
#define DSP2_BLBACK_CURVE_3_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_3_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_3_PRE_POS))

/* 0xC08 : WDR_CURVE_3 */
#define DSP2_BLBACK_WDR_CURVE_3_OFFSET (0xC08)
#define DSP2_BLBACK_CURVE_4_PRE        DSP2_BLBACK_CURVE_4_PRE
#define DSP2_BLBACK_CURVE_4_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_4_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_4_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_4_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_4_PRE_POS)
#define DSP2_BLBACK_CURVE_4_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_4_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_4_PRE_POS))
#define DSP2_BLBACK_CURVE_5_PRE        DSP2_BLBACK_CURVE_5_PRE
#define DSP2_BLBACK_CURVE_5_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_5_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_5_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_5_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_5_PRE_POS)
#define DSP2_BLBACK_CURVE_5_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_5_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_5_PRE_POS))

/* 0xC0C : WDR_CURVE_4 */
#define DSP2_BLBACK_WDR_CURVE_4_OFFSET (0xC0C)
#define DSP2_BLBACK_CURVE_6_PRE        DSP2_BLBACK_CURVE_6_PRE
#define DSP2_BLBACK_CURVE_6_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_6_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_6_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_6_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_6_PRE_POS)
#define DSP2_BLBACK_CURVE_6_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_6_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_6_PRE_POS))
#define DSP2_BLBACK_CURVE_7_PRE        DSP2_BLBACK_CURVE_7_PRE
#define DSP2_BLBACK_CURVE_7_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_7_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_7_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_7_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_7_PRE_POS)
#define DSP2_BLBACK_CURVE_7_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_7_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_7_PRE_POS))

/* 0xC10 : WDR_CURVE_5 */
#define DSP2_BLBACK_WDR_CURVE_5_OFFSET (0xC10)
#define DSP2_BLBACK_CURVE_8_PRE        DSP2_BLBACK_CURVE_8_PRE
#define DSP2_BLBACK_CURVE_8_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_8_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_8_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_8_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_8_PRE_POS)
#define DSP2_BLBACK_CURVE_8_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_8_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_8_PRE_POS))
#define DSP2_BLBACK_CURVE_9_PRE        DSP2_BLBACK_CURVE_9_PRE
#define DSP2_BLBACK_CURVE_9_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_9_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_9_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_9_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_9_PRE_POS)
#define DSP2_BLBACK_CURVE_9_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_9_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_9_PRE_POS))

/* 0xC14 : WDR_CURVE_6 */
#define DSP2_BLBACK_WDR_CURVE_6_OFFSET (0xC14)
#define DSP2_BLBACK_CURVE_10_PRE       DSP2_BLBACK_CURVE_10_PRE
#define DSP2_BLBACK_CURVE_10_PRE_POS   (0U)
#define DSP2_BLBACK_CURVE_10_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_10_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_10_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_10_PRE_POS)
#define DSP2_BLBACK_CURVE_10_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_10_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_10_PRE_POS))
#define DSP2_BLBACK_CURVE_11_PRE       DSP2_BLBACK_CURVE_11_PRE
#define DSP2_BLBACK_CURVE_11_PRE_POS   (16U)
#define DSP2_BLBACK_CURVE_11_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_11_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_11_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_11_PRE_POS)
#define DSP2_BLBACK_CURVE_11_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_11_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_11_PRE_POS))

/* 0xC18 : WDR_CURVE_7 */
#define DSP2_BLBACK_WDR_CURVE_7_OFFSET (0xC18)
#define DSP2_BLBACK_CURVE_12_PRE       DSP2_BLBACK_CURVE_12_PRE
#define DSP2_BLBACK_CURVE_12_PRE_POS   (0U)
#define DSP2_BLBACK_CURVE_12_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_12_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_12_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_12_PRE_POS)
#define DSP2_BLBACK_CURVE_12_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_12_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_12_PRE_POS))
#define DSP2_BLBACK_CURVE_13_PRE       DSP2_BLBACK_CURVE_13_PRE
#define DSP2_BLBACK_CURVE_13_PRE_POS   (16U)
#define DSP2_BLBACK_CURVE_13_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_13_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_13_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_13_PRE_POS)
#define DSP2_BLBACK_CURVE_13_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_13_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_13_PRE_POS))

/* 0xC1C : WDR_CURVE_8 */
#define DSP2_BLBACK_WDR_CURVE_8_OFFSET (0xC1C)
#define DSP2_BLBACK_CURVE_14_PRE       DSP2_BLBACK_CURVE_14_PRE
#define DSP2_BLBACK_CURVE_14_PRE_POS   (0U)
#define DSP2_BLBACK_CURVE_14_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_14_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_14_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_14_PRE_POS)
#define DSP2_BLBACK_CURVE_14_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_14_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_14_PRE_POS))
#define DSP2_BLBACK_CURVE_15_PRE       DSP2_BLBACK_CURVE_15_PRE
#define DSP2_BLBACK_CURVE_15_PRE_POS   (16U)
#define DSP2_BLBACK_CURVE_15_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_15_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_15_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_15_PRE_POS)
#define DSP2_BLBACK_CURVE_15_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_15_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_15_PRE_POS))

