RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xC20 : WDR_CURVE_9 */
#define DSP2_BLBACK_WDR_CURVE_9_OFFSET (0xC20)
#define DSP2_BLBACK_CURVE_16_PRE       DSP2_BLBACK_CURVE_16_PRE
#define DSP2_BLBACK_CURVE_16_PRE_POS   (0U)
#define DSP2_BLBACK_CURVE_16_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_16_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_16_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_16_PRE_POS)
#define DSP2_BLBACK_CURVE_16_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_16_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_16_PRE_POS))
#define DSP2_BLBACK_CURVE_17_PRE       DSP2_BLBACK_CURVE_17_PRE
#define DSP2_BLBACK_CURVE_17_PRE_POS   (16U)
#define DSP2_BLBACK_CURVE_17_PRE_LEN   (10U)
#define DSP2_BLBACK_CURVE_17_PRE_MSK   (((1U << DSP2_BLBACK_CURVE_17_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_17_PRE_POS)
#define DSP2_BLBACK_CURVE_17_PRE_UMSK  (~(((1U << DSP2_BLBACK_CURVE_17_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_17_PRE_POS))

/* 0xC24 : WDR_CURVE_10 */
#define DSP2_BLBACK_WDR_CURVE_10_OFFSET (0xC24)
#define DSP2_BLBACK_CURVE_18_PRE        DSP2_BLBACK_CURVE_18_PRE
#define DSP2_BLBACK_CURVE_18_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_18_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_18_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_18_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_18_PRE_POS)
#define DSP2_BLBACK_CURVE_18_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_18_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_18_PRE_POS))
#define DSP2_BLBACK_CURVE_19_PRE        DSP2_BLBACK_CURVE_19_PRE
#define DSP2_BLBACK_CURVE_19_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_19_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_19_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_19_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_19_PRE_POS)
#define DSP2_BLBACK_CURVE_19_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_19_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_19_PRE_POS))

/* 0xC28 : WDR_CURVE_11 */
#define DSP2_BLBACK_WDR_CURVE_11_OFFSET (0xC28)
#define DSP2_BLBACK_CURVE_20_PRE        DSP2_BLBACK_CURVE_20_PRE
#define DSP2_BLBACK_CURVE_20_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_20_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_20_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_20_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_20_PRE_POS)
#define DSP2_BLBACK_CURVE_20_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_20_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_20_PRE_POS))
#define DSP2_BLBACK_CURVE_21_PRE        DSP2_BLBACK_CURVE_21_PRE
#define DSP2_BLBACK_CURVE_21_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_21_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_21_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_21_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_21_PRE_POS)
#define DSP2_BLBACK_CURVE_21_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_21_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_21_PRE_POS))

/* 0xC2C : WDR_CURVE_12 */
#define DSP2_BLBACK_WDR_CURVE_12_OFFSET (0xC2C)
#define DSP2_BLBACK_CURVE_22_PRE        DSP2_BLBACK_CURVE_22_PRE
#define DSP2_BLBACK_CURVE_22_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_22_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_22_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_22_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_22_PRE_POS)
#define DSP2_BLBACK_CURVE_22_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_22_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_22_PRE_POS))
#define DSP2_BLBACK_CURVE_23_PRE        DSP2_BLBACK_CURVE_23_PRE
#define DSP2_BLBACK_CURVE_23_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_23_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_23_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_23_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_23_PRE_POS)
#define DSP2_BLBACK_CURVE_23_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_23_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_23_PRE_POS))

/* 0xC30 : WDR_CURVE_13 */
#define DSP2_BLBACK_WDR_CURVE_13_OFFSET (0xC30)
#define DSP2_BLBACK_CURVE_24_PRE        DSP2_BLBACK_CURVE_24_PRE
#define DSP2_BLBACK_CURVE_24_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_24_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_24_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_24_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_24_PRE_POS)
#define DSP2_BLBACK_CURVE_24_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_24_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_24_PRE_POS))
#define DSP2_BLBACK_CURVE_25_PRE        DSP2_BLBACK_CURVE_25_PRE
#define DSP2_BLBACK_CURVE_25_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_25_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_25_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_25_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_25_PRE_POS)
#define DSP2_BLBACK_CURVE_25_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_25_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_25_PRE_POS))

/* 0xC34 : WDR_CURVE_14 */
#define DSP2_BLBACK_WDR_CURVE_14_OFFSET (0xC34)
#define DSP2_BLBACK_CURVE_26_PRE        DSP2_BLBACK_CURVE_26_PRE
#define DSP2_BLBACK_CURVE_26_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_26_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_26_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_26_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_26_PRE_POS)
#define DSP2_BLBACK_CURVE_26_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_26_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_26_PRE_POS))
#define DSP2_BLBACK_CURVE_27_PRE        DSP2_BLBACK_CURVE_27_PRE
#define DSP2_BLBACK_CURVE_27_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_27_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_27_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_27_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_27_PRE_POS)
#define DSP2_BLBACK_CURVE_27_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_27_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_27_PRE_POS))

/* 0xC38 : WDR_CURVE_15 */
#define DSP2_BLBACK_WDR_CURVE_15_OFFSET (0xC38)
#define DSP2_BLBACK_CURVE_28_PRE        DSP2_BLBACK_CURVE_28_PRE
#define DSP2_BLBACK_CURVE_28_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_28_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_28_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_28_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_28_PRE_POS)
#define DSP2_BLBACK_CURVE_28_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_28_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_28_PRE_POS))
#define DSP2_BLBACK_CURVE_29_PRE        DSP2_BLBACK_CURVE_29_PRE
#define DSP2_BLBACK_CURVE_29_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_29_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_29_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_29_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_29_PRE_POS)
#define DSP2_BLBACK_CURVE_29_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_29_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_29_PRE_POS))

