RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xC3C : WDR_CURVE_16 */
#define DSP2_BLBACK_WDR_CURVE_16_OFFSET (0xC3C)
#define DSP2_BLBACK_CURVE_30_PRE        DSP2_BLBACK_CURVE_30_PRE
#define DSP2_BLBACK_CURVE_30_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_30_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_30_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_30_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_30_PRE_POS)
#define DSP2_BLBACK_CURVE_30_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_30_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_30_PRE_POS))
#define DSP2_BLBACK_CURVE_31_PRE        DSP2_BLBACK_CURVE_31_PRE
#define DSP2_BLBACK_CURVE_31_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_31_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_31_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_31_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_31_PRE_POS)
#define DSP2_BLBACK_CURVE_31_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_31_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_31_PRE_POS))

/* 0xC40 : WDR_CURVE_17 */
#define DSP2_BLBACK_WDR_CURVE_17_OFFSET (0xC40)
#define DSP2_BLBACK_CURVE_32_PRE        DSP2_BLBACK_CURVE_32_PRE
#define DSP2_BLBACK_CURVE_32_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_32_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_32_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_32_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_32_PRE_POS)
#define DSP2_BLBACK_CURVE_32_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_32_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_32_PRE_POS))
#define DSP2_BLBACK_CURVE_33_PRE        DSP2_BLBACK_CURVE_33_PRE
#define DSP2_BLBACK_CURVE_33_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_33_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_33_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_33_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_33_PRE_POS)
#define DSP2_BLBACK_CURVE_33_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_33_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_33_PRE_POS))

/* 0xC44 : WDR_CURVE_18 */
#define DSP2_BLBACK_WDR_CURVE_18_OFFSET (0xC44)
#define DSP2_BLBACK_CURVE_34_PRE        DSP2_BLBACK_CURVE_34_PRE
#define DSP2_BLBACK_CURVE_34_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_34_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_34_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_34_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_34_PRE_POS)
#define DSP2_BLBACK_CURVE_34_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_34_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_34_PRE_POS))
#define DSP2_BLBACK_CURVE_35_PRE        DSP2_BLBACK_CURVE_35_PRE
#define DSP2_BLBACK_CURVE_35_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_35_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_35_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_35_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_35_PRE_POS)
#define DSP2_BLBACK_CURVE_35_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_35_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_35_PRE_POS))

/* 0xC48 : WDR_CURVE_19 */
#define DSP2_BLBACK_WDR_CURVE_19_OFFSET (0xC48)
#define DSP2_BLBACK_CURVE_36_PRE        DSP2_BLBACK_CURVE_36_PRE
#define DSP2_BLBACK_CURVE_36_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_36_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_36_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_36_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_36_PRE_POS)
#define DSP2_BLBACK_CURVE_36_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_36_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_36_PRE_POS))
#define DSP2_BLBACK_CURVE_37_PRE        DSP2_BLBACK_CURVE_37_PRE
#define DSP2_BLBACK_CURVE_37_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_37_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_37_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_37_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_37_PRE_POS)
#define DSP2_BLBACK_CURVE_37_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_37_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_37_PRE_POS))

/* 0xC4C : WDR_CURVE_20 */
#define DSP2_BLBACK_WDR_CURVE_20_OFFSET (0xC4C)
#define DSP2_BLBACK_CURVE_38_PRE        DSP2_BLBACK_CURVE_38_PRE
#define DSP2_BLBACK_CURVE_38_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_38_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_38_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_38_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_38_PRE_POS)
#define DSP2_BLBACK_CURVE_38_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_38_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_38_PRE_POS))
#define DSP2_BLBACK_CURVE_39_PRE        DSP2_BLBACK_CURVE_39_PRE
#define DSP2_BLBACK_CURVE_39_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_39_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_39_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_39_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_39_PRE_POS)
#define DSP2_BLBACK_CURVE_39_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_39_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_39_PRE_POS))

/* 0xC50 : WDR_CURVE_21 */
#define DSP2_BLBACK_WDR_CURVE_21_OFFSET (0xC50)
#define DSP2_BLBACK_CURVE_40_PRE        DSP2_BLBACK_CURVE_40_PRE
#define DSP2_BLBACK_CURVE_40_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_40_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_40_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_40_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_40_PRE_POS)
#define DSP2_BLBACK_CURVE_40_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_40_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_40_PRE_POS))
#define DSP2_BLBACK_CURVE_41_PRE        DSP2_BLBACK_CURVE_41_PRE
#define DSP2_BLBACK_CURVE_41_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_41_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_41_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_41_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_41_PRE_POS)
#define DSP2_BLBACK_CURVE_41_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_41_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_41_PRE_POS))

/* 0xC54 : WDR_CURVE_22 */
#define DSP2_BLBACK_WDR_CURVE_22_OFFSET (0xC54)
#define DSP2_BLBACK_CURVE_42_PRE        DSP2_BLBACK_CURVE_42_PRE
#define DSP2_BLBACK_CURVE_42_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_42_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_42_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_42_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_42_PRE_POS)
#define DSP2_BLBACK_CURVE_42_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_42_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_42_PRE_POS))
#define DSP2_BLBACK_CURVE_43_PRE        DSP2_BLBACK_CURVE_43_PRE
#define DSP2_BLBACK_CURVE_43_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_43_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_43_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_43_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_43_PRE_POS)
#define DSP2_BLBACK_CURVE_43_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_43_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_43_PRE_POS))

/* 0xC58 : WDR_CURVE_23 */
#define DSP2_BLBACK_WDR_CURVE_23_OFFSET (0xC58)
#define DSP2_BLBACK_CURVE_44_PRE        DSP2_BLBACK_CURVE_44_PRE
#define DSP2_BLBACK_CURVE_44_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_44_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_44_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_44_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_44_PRE_POS)
#define DSP2_BLBACK_CURVE_44_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_44_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_44_PRE_POS))
#define DSP2_BLBACK_CURVE_45_PRE        DSP2_BLBACK_CURVE_45_PRE
#define DSP2_BLBACK_CURVE_45_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_45_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_45_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_45_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_45_PRE_POS)
#define DSP2_BLBACK_CURVE_45_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_45_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_45_PRE_POS))

/* 0xC5C : WDR_CURVE_24 */
#define DSP2_BLBACK_WDR_CURVE_24_OFFSET (0xC5C)
#define DSP2_BLBACK_CURVE_46_PRE        DSP2_BLBACK_CURVE_46_PRE
#define DSP2_BLBACK_CURVE_46_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_46_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_46_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_46_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_46_PRE_POS)
#define DSP2_BLBACK_CURVE_46_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_46_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_46_PRE_POS))
#define DSP2_BLBACK_CURVE_47_PRE        DSP2_BLBACK_CURVE_47_PRE
#define DSP2_BLBACK_CURVE_47_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_47_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_47_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_47_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_47_PRE_POS)
#define DSP2_BLBACK_CURVE_47_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_47_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_47_PRE_POS))

/* 0xC60 : WDR_CURVE_25 */
#define DSP2_BLBACK_WDR_CURVE_25_OFFSET (0xC60)
#define DSP2_BLBACK_CURVE_48_PRE        DSP2_BLBACK_CURVE_48_PRE
#define DSP2_BLBACK_CURVE_48_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_48_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_48_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_48_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_48_PRE_POS)
#define DSP2_BLBACK_CURVE_48_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_48_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_48_PRE_POS))
#define DSP2_BLBACK_CURVE_49_PRE        DSP2_BLBACK_CURVE_49_PRE
#define DSP2_BLBACK_CURVE_49_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_49_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_49_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_49_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_49_PRE_POS)
#define DSP2_BLBACK_CURVE_49_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_49_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_49_PRE_POS))

/* 0xC64 : WDR_CURVE_26 */
#define DSP2_BLBACK_WDR_CURVE_26_OFFSET (0xC64)
#define DSP2_BLBACK_CURVE_50_PRE        DSP2_BLBACK_CURVE_50_PRE
#define DSP2_BLBACK_CURVE_50_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_50_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_50_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_50_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_50_PRE_POS)
#define DSP2_BLBACK_CURVE_50_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_50_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_50_PRE_POS))
#define DSP2_BLBACK_CURVE_51_PRE        DSP2_BLBACK_CURVE_51_PRE
#define DSP2_BLBACK_CURVE_51_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_51_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_51_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_51_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_51_PRE_POS)
#define DSP2_BLBACK_CURVE_51_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_51_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_51_PRE_POS))

