RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xC68 : WDR_CURVE_27 */
#define DSP2_BLBACK_WDR_CURVE_27_OFFSET (0xC68)
#define DSP2_BLBACK_CURVE_52_PRE        DSP2_BLBACK_CURVE_52_PRE
#define DSP2_BLBACK_CURVE_52_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_52_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_52_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_52_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_52_PRE_POS)
#define DSP2_BLBACK_CURVE_52_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_52_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_52_PRE_POS))
#define DSP2_BLBACK_CURVE_53_PRE        DSP2_BLBACK_CURVE_53_PRE
#define DSP2_BLBACK_CURVE_53_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_53_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_53_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_53_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_53_PRE_POS)
#define DSP2_BLBACK_CURVE_53_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_53_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_53_PRE_POS))

/* 0xC6C : WDR_CURVE_28 */
#define DSP2_BLBACK_WDR_CURVE_28_OFFSET (0xC6C)
#define DSP2_BLBACK_CURVE_54_PRE        DSP2_BLBACK_CURVE_54_PRE
#define DSP2_BLBACK_CURVE_54_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_54_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_54_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_54_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_54_PRE_POS)
#define DSP2_BLBACK_CURVE_54_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_54_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_54_PRE_POS))
#define DSP2_BLBACK_CURVE_55_PRE        DSP2_BLBACK_CURVE_55_PRE
#define DSP2_BLBACK_CURVE_55_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_55_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_55_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_55_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_55_PRE_POS)
#define DSP2_BLBACK_CURVE_55_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_55_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_55_PRE_POS))

/* 0xC70 : WDR_CURVE_29 */
#define DSP2_BLBACK_WDR_CURVE_29_OFFSET (0xC70)
#define DSP2_BLBACK_CURVE_56_PRE        DSP2_BLBACK_CURVE_56_PRE
#define DSP2_BLBACK_CURVE_56_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_56_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_56_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_56_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_56_PRE_POS)
#define DSP2_BLBACK_CURVE_56_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_56_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_56_PRE_POS))
#define DSP2_BLBACK_CURVE_57_PRE        DSP2_BLBACK_CURVE_57_PRE
#define DSP2_BLBACK_CURVE_57_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_57_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_57_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_57_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_57_PRE_POS)
#define DSP2_BLBACK_CURVE_57_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_57_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_57_PRE_POS))

/* 0xC74 : WDR_CURVE_30 */
#define DSP2_BLBACK_WDR_CURVE_30_OFFSET (0xC74)
#define DSP2_BLBACK_CURVE_58_PRE        DSP2_BLBACK_CURVE_58_PRE
#define DSP2_BLBACK_CURVE_58_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_58_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_58_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_58_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_58_PRE_POS)
#define DSP2_BLBACK_CURVE_58_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_58_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_58_PRE_POS))
#define DSP2_BLBACK_CURVE_59_PRE        DSP2_BLBACK_CURVE_59_PRE
#define DSP2_BLBACK_CURVE_59_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_59_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_59_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_59_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_59_PRE_POS)
#define DSP2_BLBACK_CURVE_59_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_59_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_59_PRE_POS))

/* 0xC78 : WDR_CURVE_31 */
#define DSP2_BLBACK_WDR_CURVE_31_OFFSET (0xC78)
#define DSP2_BLBACK_CURVE_60_PRE        DSP2_BLBACK_CURVE_60_PRE
#define DSP2_BLBACK_CURVE_60_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_60_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_60_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_60_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_60_PRE_POS)
#define DSP2_BLBACK_CURVE_60_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_60_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_60_PRE_POS))
#define DSP2_BLBACK_CURVE_61_PRE        DSP2_BLBACK_CURVE_61_PRE
#define DSP2_BLBACK_CURVE_61_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_61_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_61_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_61_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_61_PRE_POS)
#define DSP2_BLBACK_CURVE_61_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_61_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_61_PRE_POS))

/* 0xC7C : WDR_CURVE_32 */
#define DSP2_BLBACK_WDR_CURVE_32_OFFSET (0xC7C)
#define DSP2_BLBACK_CURVE_62_PRE        DSP2_BLBACK_CURVE_62_PRE
#define DSP2_BLBACK_CURVE_62_PRE_POS    (0U)
#define DSP2_BLBACK_CURVE_62_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_62_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_62_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_62_PRE_POS)
#define DSP2_BLBACK_CURVE_62_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_62_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_62_PRE_POS))
#define DSP2_BLBACK_CURVE_63_PRE        DSP2_BLBACK_CURVE_63_PRE
#define DSP2_BLBACK_CURVE_63_PRE_POS    (16U)
#define DSP2_BLBACK_CURVE_63_PRE_LEN    (10U)
#define DSP2_BLBACK_CURVE_63_PRE_MSK    (((1U << DSP2_BLBACK_CURVE_63_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_63_PRE_POS)
#define DSP2_BLBACK_CURVE_63_PRE_UMSK   (~(((1U << DSP2_BLBACK_CURVE_63_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_63_PRE_POS))

/* 0xC80 : WDR_CURVE_33 */
#define DSP2_BLBACK_WDR_CURVE_33_OFFSET   (0xC80)
#define DSP2_BLBACK_CURVE_EN_PRE          DSP2_BLBACK_CURVE_EN_PRE
#define DSP2_BLBACK_CURVE_EN_PRE_POS      (0U)
#define DSP2_BLBACK_CURVE_EN_PRE_LEN      (1U)
#define DSP2_BLBACK_CURVE_EN_PRE_MSK      (((1U << DSP2_BLBACK_CURVE_EN_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_EN_PRE_POS)
#define DSP2_BLBACK_CURVE_EN_PRE_UMSK     (~(((1U << DSP2_BLBACK_CURVE_EN_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_EN_PRE_POS))
#define DSP2_BLBACK_CURVE_WEIGHT_PRE      DSP2_BLBACK_CURVE_WEIGHT_PRE
#define DSP2_BLBACK_CURVE_WEIGHT_PRE_POS  (8U)
#define DSP2_BLBACK_CURVE_WEIGHT_PRE_LEN  (5U)
#define DSP2_BLBACK_CURVE_WEIGHT_PRE_MSK  (((1U << DSP2_BLBACK_CURVE_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_WEIGHT_PRE_POS)
#define DSP2_BLBACK_CURVE_WEIGHT_PRE_UMSK (~(((1U << DSP2_BLBACK_CURVE_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_CURVE_WEIGHT_PRE_POS))

/* 0xC84 : WDR_ENH_1 */
#define DSP2_BLBACK_WDR_ENH_1_OFFSET      (0xC84)
#define DSP2_BLBACK_ENH_EN_PRE            DSP2_BLBACK_ENH_EN_PRE
#define DSP2_BLBACK_ENH_EN_PRE_POS        (0U)
#define DSP2_BLBACK_ENH_EN_PRE_LEN        (1U)
#define DSP2_BLBACK_ENH_EN_PRE_MSK        (((1U << DSP2_BLBACK_ENH_EN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_EN_PRE_POS)
#define DSP2_BLBACK_ENH_EN_PRE_UMSK       (~(((1U << DSP2_BLBACK_ENH_EN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_EN_PRE_POS))
#define DSP2_BLBACK_ENH_WEIGHT_PRE        DSP2_BLBACK_ENH_WEIGHT_PRE
#define DSP2_BLBACK_ENH_WEIGHT_PRE_POS    (8U)
#define DSP2_BLBACK_ENH_WEIGHT_PRE_LEN    (5U)
#define DSP2_BLBACK_ENH_WEIGHT_PRE_MSK    (((1U << DSP2_BLBACK_ENH_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_ENH_WEIGHT_PRE_POS)
#define DSP2_BLBACK_ENH_WEIGHT_PRE_UMSK   (~(((1U << DSP2_BLBACK_ENH_WEIGHT_PRE_LEN) - 1) << DSP2_BLBACK_ENH_WEIGHT_PRE_POS))
#define DSP2_BLBACK_ENH_Y_OFFSET_PRE      DSP2_BLBACK_ENH_Y_OFFSET_PRE
#define DSP2_BLBACK_ENH_Y_OFFSET_PRE_POS  (16U)
#define DSP2_BLBACK_ENH_Y_OFFSET_PRE_LEN  (12U)
#define DSP2_BLBACK_ENH_Y_OFFSET_PRE_MSK  (((1U << DSP2_BLBACK_ENH_Y_OFFSET_PRE_LEN) - 1) << DSP2_BLBACK_ENH_Y_OFFSET_PRE_POS)
#define DSP2_BLBACK_ENH_Y_OFFSET_PRE_UMSK (~(((1U << DSP2_BLBACK_ENH_Y_OFFSET_PRE_LEN) - 1) << DSP2_BLBACK_ENH_Y_OFFSET_PRE_POS))

