RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xC88 : WDR_ENH_2 */
#define DSP2_BLBACK_WDR_ENH_2_OFFSET    (0xC88)
#define DSP2_BLBACK_ENH_C_GAIN_PRE      DSP2_BLBACK_ENH_C_GAIN_PRE
#define DSP2_BLBACK_ENH_C_GAIN_PRE_POS  (0U)
#define DSP2_BLBACK_ENH_C_GAIN_PRE_LEN  (15U)
#define DSP2_BLBACK_ENH_C_GAIN_PRE_MSK  (((1U << DSP2_BLBACK_ENH_C_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_C_GAIN_PRE_POS)
#define DSP2_BLBACK_ENH_C_GAIN_PRE_UMSK (~(((1U << DSP2_BLBACK_ENH_C_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_C_GAIN_PRE_POS))
#define DSP2_BLBACK_ENH_Y_GAIN_PRE      DSP2_BLBACK_ENH_Y_GAIN_PRE
#define DSP2_BLBACK_ENH_Y_GAIN_PRE_POS  (16U)
#define DSP2_BLBACK_ENH_Y_GAIN_PRE_LEN  (15U)
#define DSP2_BLBACK_ENH_Y_GAIN_PRE_MSK  (((1U << DSP2_BLBACK_ENH_Y_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_Y_GAIN_PRE_POS)
#define DSP2_BLBACK_ENH_Y_GAIN_PRE_UMSK (~(((1U << DSP2_BLBACK_ENH_Y_GAIN_PRE_LEN) - 1) << DSP2_BLBACK_ENH_Y_GAIN_PRE_POS))

/* 0xD00 : BL_GAMMA_TABLE_1 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_1_OFFSET (0xD00)
#define DSP2_BLBACK_GAMMA_TABLE0_PRE        DSP2_BLBACK_GAMMA_TABLE0_PRE
#define DSP2_BLBACK_GAMMA_TABLE0_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE0_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE0_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE0_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE0_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE0_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE0_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE0_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE1_PRE        DSP2_BLBACK_GAMMA_TABLE1_PRE
#define DSP2_BLBACK_GAMMA_TABLE1_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE1_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE1_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE1_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE1_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE1_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE1_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE1_PRE_POS))

/* 0xD04 : BL_GAMMA_TABLE_2 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_2_OFFSET (0xD04)
#define DSP2_BLBACK_GAMMA_TABLE2_PRE        DSP2_BLBACK_GAMMA_TABLE2_PRE
#define DSP2_BLBACK_GAMMA_TABLE2_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE2_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE2_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE2_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE2_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE2_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE2_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE2_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE3_PRE        DSP2_BLBACK_GAMMA_TABLE3_PRE
#define DSP2_BLBACK_GAMMA_TABLE3_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE3_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE3_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE3_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE3_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE3_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE3_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE3_PRE_POS))

/* 0xD08 : BL_GAMMA_TABLE_3 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_3_OFFSET (0xD08)
#define DSP2_BLBACK_GAMMA_TABLE4_PRE        DSP2_BLBACK_GAMMA_TABLE4_PRE
#define DSP2_BLBACK_GAMMA_TABLE4_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE4_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE4_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE4_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE4_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE4_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE4_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE4_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE5_PRE        DSP2_BLBACK_GAMMA_TABLE5_PRE
#define DSP2_BLBACK_GAMMA_TABLE5_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE5_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE5_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE5_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE5_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE5_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE5_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE5_PRE_POS))

/* 0xD0C : BL_GAMMA_TABLE_4 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_4_OFFSET (0xD0C)
#define DSP2_BLBACK_GAMMA_TABLE6_PRE        DSP2_BLBACK_GAMMA_TABLE6_PRE
#define DSP2_BLBACK_GAMMA_TABLE6_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE6_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE6_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE6_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE6_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE6_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE6_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE6_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE7_PRE        DSP2_BLBACK_GAMMA_TABLE7_PRE
#define DSP2_BLBACK_GAMMA_TABLE7_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE7_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE7_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE7_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE7_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE7_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE7_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE7_PRE_POS))

/* 0xD10 : BL_GAMMA_TABLE_5 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_5_OFFSET (0xD10)
#define DSP2_BLBACK_GAMMA_TABLE8_PRE        DSP2_BLBACK_GAMMA_TABLE8_PRE
#define DSP2_BLBACK_GAMMA_TABLE8_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE8_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE8_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE8_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE8_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE8_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE8_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE8_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE9_PRE        DSP2_BLBACK_GAMMA_TABLE9_PRE
#define DSP2_BLBACK_GAMMA_TABLE9_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE9_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE9_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE9_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE9_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE9_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE9_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE9_PRE_POS))

/* 0xD14 : BL_GAMMA_TABLE_6 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_6_OFFSET (0xD14)
#define DSP2_BLBACK_GAMMA_TABLE10_PRE       DSP2_BLBACK_GAMMA_TABLE10_PRE
#define DSP2_BLBACK_GAMMA_TABLE10_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE10_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE10_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE10_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE10_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE10_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE10_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE10_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE11_PRE       DSP2_BLBACK_GAMMA_TABLE11_PRE
#define DSP2_BLBACK_GAMMA_TABLE11_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE11_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE11_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE11_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE11_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE11_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE11_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE11_PRE_POS))

/* 0xD18 : BL_GAMMA_TABLE_7 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_7_OFFSET (0xD18)
#define DSP2_BLBACK_GAMMA_TABLE12_PRE       DSP2_BLBACK_GAMMA_TABLE12_PRE
#define DSP2_BLBACK_GAMMA_TABLE12_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE12_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE12_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE12_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE12_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE12_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE12_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE12_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE13_PRE       DSP2_BLBACK_GAMMA_TABLE13_PRE
#define DSP2_BLBACK_GAMMA_TABLE13_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE13_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE13_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE13_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE13_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE13_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE13_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE13_PRE_POS))

/* 0xD1C : BL_GAMMA_TABLE_8 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_8_OFFSET (0xD1C)
#define DSP2_BLBACK_GAMMA_TABLE14_PRE       DSP2_BLBACK_GAMMA_TABLE14_PRE
#define DSP2_BLBACK_GAMMA_TABLE14_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE14_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE14_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE14_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE14_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE14_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE14_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE14_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE15_PRE       DSP2_BLBACK_GAMMA_TABLE15_PRE
#define DSP2_BLBACK_GAMMA_TABLE15_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE15_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE15_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE15_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE15_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE15_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE15_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE15_PRE_POS))

/* 0xD20 : BL_GAMMA_TABLE_9 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_9_OFFSET (0xD20)
#define DSP2_BLBACK_GAMMA_TABLE16_PRE       DSP2_BLBACK_GAMMA_TABLE16_PRE
#define DSP2_BLBACK_GAMMA_TABLE16_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE16_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE16_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE16_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE16_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE16_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE16_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE16_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE17_PRE       DSP2_BLBACK_GAMMA_TABLE17_PRE
#define DSP2_BLBACK_GAMMA_TABLE17_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE17_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE17_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE17_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE17_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE17_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE17_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE17_PRE_POS))

