RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xD24 : BL_GAMMA_TABLE_10 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_10_OFFSET (0xD24)
#define DSP2_BLBACK_GAMMA_TABLE18_PRE        DSP2_BLBACK_GAMMA_TABLE18_PRE
#define DSP2_BLBACK_GAMMA_TABLE18_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE18_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE18_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE18_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE18_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE18_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE18_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE18_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE19_PRE        DSP2_BLBACK_GAMMA_TABLE19_PRE
#define DSP2_BLBACK_GAMMA_TABLE19_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE19_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE19_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE19_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE19_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE19_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE19_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE19_PRE_POS))

/* 0xD28 : BL_GAMMA_TABLE_11 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_11_OFFSET (0xD28)
#define DSP2_BLBACK_GAMMA_TABLE20_PRE        DSP2_BLBACK_GAMMA_TABLE20_PRE
#define DSP2_BLBACK_GAMMA_TABLE20_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE20_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE20_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE20_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE20_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE20_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE20_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE20_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE21_PRE        DSP2_BLBACK_GAMMA_TABLE21_PRE
#define DSP2_BLBACK_GAMMA_TABLE21_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE21_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE21_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE21_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE21_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE21_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE21_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE21_PRE_POS))

/* 0xD2C : BL_GAMMA_TABLE_12 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_12_OFFSET (0xD2C)
#define DSP2_BLBACK_GAMMA_TABLE22_PRE        DSP2_BLBACK_GAMMA_TABLE22_PRE
#define DSP2_BLBACK_GAMMA_TABLE22_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE22_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE22_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE22_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE22_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE22_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE22_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE22_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE23_PRE        DSP2_BLBACK_GAMMA_TABLE23_PRE
#define DSP2_BLBACK_GAMMA_TABLE23_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE23_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE23_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE23_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE23_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE23_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE23_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE23_PRE_POS))

/* 0xD30 : BL_GAMMA_TABLE_13 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_13_OFFSET (0xD30)
#define DSP2_BLBACK_GAMMA_TABLE24_PRE        DSP2_BLBACK_GAMMA_TABLE24_PRE
#define DSP2_BLBACK_GAMMA_TABLE24_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE24_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE24_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE24_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE24_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE24_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE24_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE24_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE25_PRE        DSP2_BLBACK_GAMMA_TABLE25_PRE
#define DSP2_BLBACK_GAMMA_TABLE25_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE25_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE25_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE25_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE25_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE25_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE25_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE25_PRE_POS))

/* 0xD34 : BL_GAMMA_TABLE_14 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_14_OFFSET (0xD34)
#define DSP2_BLBACK_GAMMA_TABLE26_PRE        DSP2_BLBACK_GAMMA_TABLE26_PRE
#define DSP2_BLBACK_GAMMA_TABLE26_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE26_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE26_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE26_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE26_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE26_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE26_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE26_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE27_PRE        DSP2_BLBACK_GAMMA_TABLE27_PRE
#define DSP2_BLBACK_GAMMA_TABLE27_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE27_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE27_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE27_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE27_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE27_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE27_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE27_PRE_POS))

/* 0xD38 : BL_GAMMA_TABLE_15 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_15_OFFSET (0xD38)
#define DSP2_BLBACK_GAMMA_TABLE28_PRE        DSP2_BLBACK_GAMMA_TABLE28_PRE
#define DSP2_BLBACK_GAMMA_TABLE28_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE28_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE28_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE28_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE28_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE28_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE28_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE28_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE29_PRE        DSP2_BLBACK_GAMMA_TABLE29_PRE
#define DSP2_BLBACK_GAMMA_TABLE29_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE29_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE29_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE29_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE29_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE29_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE29_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE29_PRE_POS))

/* 0xD3C : BL_GAMMA_TABLE_16 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_16_OFFSET (0xD3C)
#define DSP2_BLBACK_GAMMA_TABLE30_PRE        DSP2_BLBACK_GAMMA_TABLE30_PRE
#define DSP2_BLBACK_GAMMA_TABLE30_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE30_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE30_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE30_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE30_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE30_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE30_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE30_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE31_PRE        DSP2_BLBACK_GAMMA_TABLE31_PRE
#define DSP2_BLBACK_GAMMA_TABLE31_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE31_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE31_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE31_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE31_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE31_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE31_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE31_PRE_POS))

