RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xD40 : BL_GAMMA_TABLE_17 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_17_OFFSET (0xD40)
#define DSP2_BLBACK_GAMMA_TABLE32_PRE        DSP2_BLBACK_GAMMA_TABLE32_PRE
#define DSP2_BLBACK_GAMMA_TABLE32_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE32_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE32_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE32_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE32_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE32_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE32_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE32_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE33_PRE        DSP2_BLBACK_GAMMA_TABLE33_PRE
#define DSP2_BLBACK_GAMMA_TABLE33_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE33_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE33_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE33_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE33_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE33_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE33_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE33_PRE_POS))

/* 0xD44 : BL_GAMMA_TABLE_18 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_18_OFFSET (0xD44)
#define DSP2_BLBACK_GAMMA_TABLE34_PRE        DSP2_BLBACK_GAMMA_TABLE34_PRE
#define DSP2_BLBACK_GAMMA_TABLE34_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE34_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE34_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE34_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE34_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE34_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE34_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE34_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE35_PRE        DSP2_BLBACK_GAMMA_TABLE35_PRE
#define DSP2_BLBACK_GAMMA_TABLE35_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE35_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE35_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE35_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE35_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE35_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE35_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE35_PRE_POS))

/* 0xD48 : BL_GAMMA_TABLE_19 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_19_OFFSET (0xD48)
#define DSP2_BLBACK_GAMMA_TABLE36_PRE        DSP2_BLBACK_GAMMA_TABLE36_PRE
#define DSP2_BLBACK_GAMMA_TABLE36_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE36_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE36_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE36_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE36_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE36_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE36_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE36_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE37_PRE        DSP2_BLBACK_GAMMA_TABLE37_PRE
#define DSP2_BLBACK_GAMMA_TABLE37_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE37_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE37_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE37_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE37_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE37_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE37_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE37_PRE_POS))

/* 0xD4C : BL_GAMMA_TABLE_20 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_20_OFFSET (0xD4C)
#define DSP2_BLBACK_GAMMA_TABLE38_PRE        DSP2_BLBACK_GAMMA_TABLE38_PRE
#define DSP2_BLBACK_GAMMA_TABLE38_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE38_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE38_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE38_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE38_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE38_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE38_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE38_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE39_PRE        DSP2_BLBACK_GAMMA_TABLE39_PRE
#define DSP2_BLBACK_GAMMA_TABLE39_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE39_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE39_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE39_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE39_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE39_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE39_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE39_PRE_POS))

/* 0xD50 : BL_GAMMA_TABLE_21 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_21_OFFSET (0xD50)
#define DSP2_BLBACK_GAMMA_TABLE40_PRE        DSP2_BLBACK_GAMMA_TABLE40_PRE
#define DSP2_BLBACK_GAMMA_TABLE40_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE40_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE40_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE40_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE40_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE40_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE40_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE40_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE41_PRE        DSP2_BLBACK_GAMMA_TABLE41_PRE
#define DSP2_BLBACK_GAMMA_TABLE41_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE41_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE41_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE41_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE41_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE41_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE41_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE41_PRE_POS))

/* 0xD54 : BL_GAMMA_TABLE_22 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_22_OFFSET (0xD54)
#define DSP2_BLBACK_GAMMA_TABLE42_PRE        DSP2_BLBACK_GAMMA_TABLE42_PRE
#define DSP2_BLBACK_GAMMA_TABLE42_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE42_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE42_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE42_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE42_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE42_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE42_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE42_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE43_PRE        DSP2_BLBACK_GAMMA_TABLE43_PRE
#define DSP2_BLBACK_GAMMA_TABLE43_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE43_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE43_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE43_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE43_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE43_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE43_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE43_PRE_POS))

/* 0xD58 : BL_GAMMA_TABLE_23 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_23_OFFSET (0xD58)
#define DSP2_BLBACK_GAMMA_TABLE44_PRE        DSP2_BLBACK_GAMMA_TABLE44_PRE
#define DSP2_BLBACK_GAMMA_TABLE44_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE44_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE44_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE44_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE44_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE44_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE44_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE44_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE45_PRE        DSP2_BLBACK_GAMMA_TABLE45_PRE
#define DSP2_BLBACK_GAMMA_TABLE45_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE45_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE45_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE45_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE45_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE45_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE45_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE45_PRE_POS))

/* 0xD5C : BL_GAMMA_TABLE_24 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_24_OFFSET (0xD5C)
#define DSP2_BLBACK_GAMMA_TABLE46_PRE        DSP2_BLBACK_GAMMA_TABLE46_PRE
#define DSP2_BLBACK_GAMMA_TABLE46_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE46_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE46_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE46_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE46_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE46_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE46_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE46_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE47_PRE        DSP2_BLBACK_GAMMA_TABLE47_PRE
#define DSP2_BLBACK_GAMMA_TABLE47_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE47_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE47_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE47_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE47_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE47_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE47_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE47_PRE_POS))

/* 0xD60 : BL_GAMMA_TABLE_25 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_25_OFFSET (0xD60)
#define DSP2_BLBACK_GAMMA_TABLE48_PRE        DSP2_BLBACK_GAMMA_TABLE48_PRE
#define DSP2_BLBACK_GAMMA_TABLE48_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE48_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE48_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE48_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE48_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE48_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE48_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE48_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE49_PRE        DSP2_BLBACK_GAMMA_TABLE49_PRE
#define DSP2_BLBACK_GAMMA_TABLE49_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE49_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE49_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE49_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE49_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE49_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE49_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE49_PRE_POS))

/* 0xD64 : BL_GAMMA_TABLE_26 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_26_OFFSET (0xD64)
#define DSP2_BLBACK_GAMMA_TABLE50_PRE        DSP2_BLBACK_GAMMA_TABLE50_PRE
#define DSP2_BLBACK_GAMMA_TABLE50_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE50_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE50_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE50_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE50_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE50_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE50_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE50_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE51_PRE        DSP2_BLBACK_GAMMA_TABLE51_PRE
#define DSP2_BLBACK_GAMMA_TABLE51_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE51_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE51_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE51_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE51_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE51_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE51_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE51_PRE_POS))

/* 0xD68 : BL_GAMMA_TABLE_27 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_27_OFFSET (0xD68)
#define DSP2_BLBACK_GAMMA_TABLE52_PRE        DSP2_BLBACK_GAMMA_TABLE52_PRE
#define DSP2_BLBACK_GAMMA_TABLE52_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE52_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE52_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE52_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE52_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE52_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE52_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE52_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE53_PRE        DSP2_BLBACK_GAMMA_TABLE53_PRE
#define DSP2_BLBACK_GAMMA_TABLE53_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE53_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE53_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE53_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE53_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE53_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE53_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE53_PRE_POS))

/* 0xD6C : BL_GAMMA_TABLE_28 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_28_OFFSET (0xD6C)
#define DSP2_BLBACK_GAMMA_TABLE54_PRE        DSP2_BLBACK_GAMMA_TABLE54_PRE
#define DSP2_BLBACK_GAMMA_TABLE54_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE54_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE54_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE54_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE54_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE54_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE54_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE54_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE55_PRE        DSP2_BLBACK_GAMMA_TABLE55_PRE
#define DSP2_BLBACK_GAMMA_TABLE55_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE55_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE55_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE55_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE55_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE55_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE55_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE55_PRE_POS))

