RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xD70 : BL_GAMMA_TABLE_29 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_29_OFFSET (0xD70)
#define DSP2_BLBACK_GAMMA_TABLE56_PRE        DSP2_BLBACK_GAMMA_TABLE56_PRE
#define DSP2_BLBACK_GAMMA_TABLE56_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE56_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE56_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE56_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE56_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE56_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE56_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE56_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE57_PRE        DSP2_BLBACK_GAMMA_TABLE57_PRE
#define DSP2_BLBACK_GAMMA_TABLE57_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE57_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE57_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE57_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE57_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE57_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE57_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE57_PRE_POS))

/* 0xD74 : BL_GAMMA_TABLE_30 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_30_OFFSET (0xD74)
#define DSP2_BLBACK_GAMMA_TABLE58_PRE        DSP2_BLBACK_GAMMA_TABLE58_PRE
#define DSP2_BLBACK_GAMMA_TABLE58_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE58_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE58_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE58_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE58_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE58_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE58_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE58_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE59_PRE        DSP2_BLBACK_GAMMA_TABLE59_PRE
#define DSP2_BLBACK_GAMMA_TABLE59_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE59_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE59_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE59_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE59_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE59_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE59_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE59_PRE_POS))

/* 0xD78 : BL_GAMMA_TABLE_31 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_31_OFFSET (0xD78)
#define DSP2_BLBACK_GAMMA_TABLE60_PRE        DSP2_BLBACK_GAMMA_TABLE60_PRE
#define DSP2_BLBACK_GAMMA_TABLE60_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE60_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE60_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE60_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE60_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE60_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE60_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE60_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE61_PRE        DSP2_BLBACK_GAMMA_TABLE61_PRE
#define DSP2_BLBACK_GAMMA_TABLE61_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE61_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE61_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE61_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE61_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE61_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE61_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE61_PRE_POS))

/* 0xD7C : BL_GAMMA_TABLE_32 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_32_OFFSET (0xD7C)
#define DSP2_BLBACK_GAMMA_TABLE62_PRE        DSP2_BLBACK_GAMMA_TABLE62_PRE
#define DSP2_BLBACK_GAMMA_TABLE62_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE62_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE62_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE62_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE62_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE62_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE62_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE62_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE63_PRE        DSP2_BLBACK_GAMMA_TABLE63_PRE
#define DSP2_BLBACK_GAMMA_TABLE63_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE63_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE63_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE63_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE63_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE63_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE63_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE63_PRE_POS))

/* 0xD80 : BL_GAMMA_TABLE_33 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_33_OFFSET (0xD80)
#define DSP2_BLBACK_GAMMA_TABLE64_PRE        DSP2_BLBACK_GAMMA_TABLE64_PRE
#define DSP2_BLBACK_GAMMA_TABLE64_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE64_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE64_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE64_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE64_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE64_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE64_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE64_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE65_PRE        DSP2_BLBACK_GAMMA_TABLE65_PRE
#define DSP2_BLBACK_GAMMA_TABLE65_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE65_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE65_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE65_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE65_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE65_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE65_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE65_PRE_POS))

/* 0xD84 : BL_GAMMA_TABLE_34 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_34_OFFSET (0xD84)
#define DSP2_BLBACK_GAMMA_TABLE66_PRE        DSP2_BLBACK_GAMMA_TABLE66_PRE
#define DSP2_BLBACK_GAMMA_TABLE66_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE66_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE66_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE66_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE66_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE66_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE66_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE66_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE67_PRE        DSP2_BLBACK_GAMMA_TABLE67_PRE
#define DSP2_BLBACK_GAMMA_TABLE67_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE67_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE67_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE67_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE67_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE67_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE67_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE67_PRE_POS))

/* 0xD88 : BL_GAMMA_TABLE_35 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_35_OFFSET (0xD88)
#define DSP2_BLBACK_GAMMA_TABLE68_PRE        DSP2_BLBACK_GAMMA_TABLE68_PRE
#define DSP2_BLBACK_GAMMA_TABLE68_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE68_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE68_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE68_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE68_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE68_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE68_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE68_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE69_PRE        DSP2_BLBACK_GAMMA_TABLE69_PRE
#define DSP2_BLBACK_GAMMA_TABLE69_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE69_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE69_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE69_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE69_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE69_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE69_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE69_PRE_POS))

/* 0xD8C : BL_GAMMA_TABLE_36 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_36_OFFSET (0xD8C)
#define DSP2_BLBACK_GAMMA_TABLE70_PRE        DSP2_BLBACK_GAMMA_TABLE70_PRE
#define DSP2_BLBACK_GAMMA_TABLE70_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE70_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE70_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE70_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE70_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE70_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE70_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE70_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE71_PRE        DSP2_BLBACK_GAMMA_TABLE71_PRE
#define DSP2_BLBACK_GAMMA_TABLE71_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE71_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE71_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE71_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE71_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE71_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE71_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE71_PRE_POS))

/* 0xD90 : BL_GAMMA_TABLE_37 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_37_OFFSET (0xD90)
#define DSP2_BLBACK_GAMMA_TABLE72_PRE        DSP2_BLBACK_GAMMA_TABLE72_PRE
#define DSP2_BLBACK_GAMMA_TABLE72_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE72_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE72_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE72_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE72_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE72_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE72_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE72_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE73_PRE        DSP2_BLBACK_GAMMA_TABLE73_PRE
#define DSP2_BLBACK_GAMMA_TABLE73_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE73_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE73_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE73_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE73_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE73_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE73_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE73_PRE_POS))

/* 0xD94 : BL_GAMMA_TABLE_38 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_38_OFFSET (0xD94)
#define DSP2_BLBACK_GAMMA_TABLE74_PRE        DSP2_BLBACK_GAMMA_TABLE74_PRE
#define DSP2_BLBACK_GAMMA_TABLE74_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE74_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE74_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE74_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE74_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE74_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE74_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE74_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE75_PRE        DSP2_BLBACK_GAMMA_TABLE75_PRE
#define DSP2_BLBACK_GAMMA_TABLE75_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE75_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE75_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE75_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE75_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE75_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE75_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE75_PRE_POS))

/* 0xD98 : BL_GAMMA_TABLE_39 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_39_OFFSET (0xD98)
#define DSP2_BLBACK_GAMMA_TABLE76_PRE        DSP2_BLBACK_GAMMA_TABLE76_PRE
#define DSP2_BLBACK_GAMMA_TABLE76_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE76_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE76_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE76_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE76_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE76_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE76_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE76_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE77_PRE        DSP2_BLBACK_GAMMA_TABLE77_PRE
#define DSP2_BLBACK_GAMMA_TABLE77_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE77_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE77_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE77_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE77_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE77_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE77_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE77_PRE_POS))

/* 0xD9C : BL_GAMMA_TABLE_40 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_40_OFFSET (0xD9C)
#define DSP2_BLBACK_GAMMA_TABLE78_PRE        DSP2_BLBACK_GAMMA_TABLE78_PRE
#define DSP2_BLBACK_GAMMA_TABLE78_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE78_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE78_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE78_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE78_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE78_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE78_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE78_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE79_PRE        DSP2_BLBACK_GAMMA_TABLE79_PRE
#define DSP2_BLBACK_GAMMA_TABLE79_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE79_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE79_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE79_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE79_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE79_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE79_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE79_PRE_POS))

/* 0xDA0 : BL_GAMMA_TABLE_41 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_41_OFFSET (0xDA0)
#define DSP2_BLBACK_GAMMA_TABLE80_PRE        DSP2_BLBACK_GAMMA_TABLE80_PRE
#define DSP2_BLBACK_GAMMA_TABLE80_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE80_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE80_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE80_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE80_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE80_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE80_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE80_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE81_PRE        DSP2_BLBACK_GAMMA_TABLE81_PRE
#define DSP2_BLBACK_GAMMA_TABLE81_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE81_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE81_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE81_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE81_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE81_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE81_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE81_PRE_POS))

/* 0xDA4 : BL_GAMMA_TABLE_42 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_42_OFFSET (0xDA4)
#define DSP2_BLBACK_GAMMA_TABLE82_PRE        DSP2_BLBACK_GAMMA_TABLE82_PRE
#define DSP2_BLBACK_GAMMA_TABLE82_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE82_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE82_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE82_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE82_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE82_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE82_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE82_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE83_PRE        DSP2_BLBACK_GAMMA_TABLE83_PRE
#define DSP2_BLBACK_GAMMA_TABLE83_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE83_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE83_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE83_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE83_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE83_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE83_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE83_PRE_POS))

/* 0xDA8 : BL_GAMMA_TABLE_43 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_43_OFFSET (0xDA8)
#define DSP2_BLBACK_GAMMA_TABLE84_PRE        DSP2_BLBACK_GAMMA_TABLE84_PRE
#define DSP2_BLBACK_GAMMA_TABLE84_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE84_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE84_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE84_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE84_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE84_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE84_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE84_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE85_PRE        DSP2_BLBACK_GAMMA_TABLE85_PRE
#define DSP2_BLBACK_GAMMA_TABLE85_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE85_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE85_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE85_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE85_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE85_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE85_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE85_PRE_POS))

/* 0xDAC : BL_GAMMA_TABLE_44 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_44_OFFSET (0xDAC)
#define DSP2_BLBACK_GAMMA_TABLE86_PRE        DSP2_BLBACK_GAMMA_TABLE86_PRE
#define DSP2_BLBACK_GAMMA_TABLE86_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE86_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE86_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE86_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE86_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE86_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE86_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE86_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE87_PRE        DSP2_BLBACK_GAMMA_TABLE87_PRE
#define DSP2_BLBACK_GAMMA_TABLE87_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE87_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE87_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE87_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE87_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE87_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE87_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE87_PRE_POS))

/* 0xDB0 : BL_GAMMA_TABLE_45 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_45_OFFSET (0xDB0)
#define DSP2_BLBACK_GAMMA_TABLE88_PRE        DSP2_BLBACK_GAMMA_TABLE88_PRE
#define DSP2_BLBACK_GAMMA_TABLE88_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE88_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE88_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE88_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE88_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE88_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE88_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE88_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE89_PRE        DSP2_BLBACK_GAMMA_TABLE89_PRE
#define DSP2_BLBACK_GAMMA_TABLE89_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE89_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE89_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE89_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE89_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE89_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE89_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE89_PRE_POS))

/* 0xDB4 : BL_GAMMA_TABLE_46 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_46_OFFSET (0xDB4)
#define DSP2_BLBACK_GAMMA_TABLE90_PRE        DSP2_BLBACK_GAMMA_TABLE90_PRE
#define DSP2_BLBACK_GAMMA_TABLE90_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE90_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE90_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE90_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE90_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE90_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE90_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE90_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE91_PRE        DSP2_BLBACK_GAMMA_TABLE91_PRE
#define DSP2_BLBACK_GAMMA_TABLE91_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE91_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE91_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE91_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE91_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE91_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE91_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE91_PRE_POS))

/* 0xDB8 : BL_GAMMA_TABLE_47 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_47_OFFSET (0xDB8)
#define DSP2_BLBACK_GAMMA_TABLE92_PRE        DSP2_BLBACK_GAMMA_TABLE92_PRE
#define DSP2_BLBACK_GAMMA_TABLE92_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE92_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE92_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE92_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE92_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE92_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE92_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE92_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE93_PRE        DSP2_BLBACK_GAMMA_TABLE93_PRE
#define DSP2_BLBACK_GAMMA_TABLE93_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE93_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE93_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE93_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE93_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE93_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE93_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE93_PRE_POS))

/* 0xDBC : BL_GAMMA_TABLE_48 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_48_OFFSET (0xDBC)
#define DSP2_BLBACK_GAMMA_TABLE94_PRE        DSP2_BLBACK_GAMMA_TABLE94_PRE
#define DSP2_BLBACK_GAMMA_TABLE94_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE94_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE94_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE94_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE94_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE94_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE94_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE94_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE95_PRE        DSP2_BLBACK_GAMMA_TABLE95_PRE
#define DSP2_BLBACK_GAMMA_TABLE95_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE95_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE95_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE95_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE95_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE95_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE95_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE95_PRE_POS))

