RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xDC0 : BL_GAMMA_TABLE_49 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_49_OFFSET (0xDC0)
#define DSP2_BLBACK_GAMMA_TABLE96_PRE        DSP2_BLBACK_GAMMA_TABLE96_PRE
#define DSP2_BLBACK_GAMMA_TABLE96_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE96_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE96_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE96_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE96_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE96_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE96_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE96_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE97_PRE        DSP2_BLBACK_GAMMA_TABLE97_PRE
#define DSP2_BLBACK_GAMMA_TABLE97_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE97_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE97_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE97_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE97_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE97_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE97_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE97_PRE_POS))

/* 0xDC4 : BL_GAMMA_TABLE_50 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_50_OFFSET (0xDC4)
#define DSP2_BLBACK_GAMMA_TABLE98_PRE        DSP2_BLBACK_GAMMA_TABLE98_PRE
#define DSP2_BLBACK_GAMMA_TABLE98_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE98_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE98_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE98_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE98_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE98_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE98_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE98_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE99_PRE        DSP2_BLBACK_GAMMA_TABLE99_PRE
#define DSP2_BLBACK_GAMMA_TABLE99_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE99_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE99_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE99_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE99_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE99_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE99_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE99_PRE_POS))

/* 0xDC8 : BL_GAMMA_TABLE_51 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_51_OFFSET (0xDC8)
#define DSP2_BLBACK_GAMMA_TABLE100_PRE       DSP2_BLBACK_GAMMA_TABLE100_PRE
#define DSP2_BLBACK_GAMMA_TABLE100_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE100_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE100_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE100_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE100_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE100_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE100_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE100_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE101_PRE       DSP2_BLBACK_GAMMA_TABLE101_PRE
#define DSP2_BLBACK_GAMMA_TABLE101_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE101_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE101_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE101_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE101_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE101_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE101_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE101_PRE_POS))

/* 0xDCC : BL_GAMMA_TABLE_52 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_52_OFFSET (0xDCC)
#define DSP2_BLBACK_GAMMA_TABLE102_PRE       DSP2_BLBACK_GAMMA_TABLE102_PRE
#define DSP2_BLBACK_GAMMA_TABLE102_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE102_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE102_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE102_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE102_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE102_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE102_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE102_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE103_PRE       DSP2_BLBACK_GAMMA_TABLE103_PRE
#define DSP2_BLBACK_GAMMA_TABLE103_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE103_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE103_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE103_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE103_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE103_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE103_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE103_PRE_POS))

/* 0xDD0 : BL_GAMMA_TABLE_53 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_53_OFFSET (0xDD0)
#define DSP2_BLBACK_GAMMA_TABLE104_PRE       DSP2_BLBACK_GAMMA_TABLE104_PRE
#define DSP2_BLBACK_GAMMA_TABLE104_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE104_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE104_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE104_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE104_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE104_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE104_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE104_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE105_PRE       DSP2_BLBACK_GAMMA_TABLE105_PRE
#define DSP2_BLBACK_GAMMA_TABLE105_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE105_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE105_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE105_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE105_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE105_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE105_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE105_PRE_POS))

/* 0xDD4 : BL_GAMMA_TABLE_54 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_54_OFFSET (0xDD4)
#define DSP2_BLBACK_GAMMA_TABLE106_PRE       DSP2_BLBACK_GAMMA_TABLE106_PRE
#define DSP2_BLBACK_GAMMA_TABLE106_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE106_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE106_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE106_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE106_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE106_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE106_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE106_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE107_PRE       DSP2_BLBACK_GAMMA_TABLE107_PRE
#define DSP2_BLBACK_GAMMA_TABLE107_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE107_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE107_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE107_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE107_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE107_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE107_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE107_PRE_POS))

/* 0xDD8 : BL_GAMMA_TABLE_55 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_55_OFFSET (0xDD8)
#define DSP2_BLBACK_GAMMA_TABLE108_PRE       DSP2_BLBACK_GAMMA_TABLE108_PRE
#define DSP2_BLBACK_GAMMA_TABLE108_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE108_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE108_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE108_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE108_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE108_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE108_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE108_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE109_PRE       DSP2_BLBACK_GAMMA_TABLE109_PRE
#define DSP2_BLBACK_GAMMA_TABLE109_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE109_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE109_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE109_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE109_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE109_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE109_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE109_PRE_POS))

