RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xDDC : BL_GAMMA_TABLE_56 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_56_OFFSET (0xDDC)
#define DSP2_BLBACK_GAMMA_TABLE110_PRE       DSP2_BLBACK_GAMMA_TABLE110_PRE
#define DSP2_BLBACK_GAMMA_TABLE110_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE110_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE110_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE110_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE110_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE110_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE110_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE110_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE111_PRE       DSP2_BLBACK_GAMMA_TABLE111_PRE
#define DSP2_BLBACK_GAMMA_TABLE111_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE111_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE111_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE111_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE111_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE111_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE111_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE111_PRE_POS))

/* 0xDE0 : BL_GAMMA_TABLE_57 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_57_OFFSET (0xDE0)
#define DSP2_BLBACK_GAMMA_TABLE112_PRE       DSP2_BLBACK_GAMMA_TABLE112_PRE
#define DSP2_BLBACK_GAMMA_TABLE112_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE112_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE112_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE112_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE112_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE112_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE112_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE112_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE113_PRE       DSP2_BLBACK_GAMMA_TABLE113_PRE
#define DSP2_BLBACK_GAMMA_TABLE113_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE113_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE113_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE113_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE113_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE113_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE113_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE113_PRE_POS))

/* 0xDE4 : BL_GAMMA_TABLE_58 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_58_OFFSET (0xDE4)
#define DSP2_BLBACK_GAMMA_TABLE114_PRE       DSP2_BLBACK_GAMMA_TABLE114_PRE
#define DSP2_BLBACK_GAMMA_TABLE114_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE114_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE114_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE114_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE114_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE114_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE114_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE114_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE115_PRE       DSP2_BLBACK_GAMMA_TABLE115_PRE
#define DSP2_BLBACK_GAMMA_TABLE115_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE115_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE115_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE115_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE115_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE115_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE115_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE115_PRE_POS))

/* 0xDE8 : BL_GAMMA_TABLE_59 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_59_OFFSET (0xDE8)
#define DSP2_BLBACK_GAMMA_TABLE116_PRE       DSP2_BLBACK_GAMMA_TABLE116_PRE
#define DSP2_BLBACK_GAMMA_TABLE116_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE116_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE116_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE116_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE116_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE116_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE116_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE116_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE117_PRE       DSP2_BLBACK_GAMMA_TABLE117_PRE
#define DSP2_BLBACK_GAMMA_TABLE117_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE117_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE117_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE117_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE117_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE117_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE117_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE117_PRE_POS))

/* 0xDEC : BL_GAMMA_TABLE_60 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_60_OFFSET (0xDEC)
#define DSP2_BLBACK_GAMMA_TABLE118_PRE       DSP2_BLBACK_GAMMA_TABLE118_PRE
#define DSP2_BLBACK_GAMMA_TABLE118_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE118_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE118_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE118_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE118_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE118_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE118_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE118_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE119_PRE       DSP2_BLBACK_GAMMA_TABLE119_PRE
#define DSP2_BLBACK_GAMMA_TABLE119_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE119_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE119_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE119_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE119_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE119_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE119_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE119_PRE_POS))

/* 0xDF0 : BL_GAMMA_TABLE_61 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_61_OFFSET (0xDF0)
#define DSP2_BLBACK_GAMMA_TABLE120_PRE       DSP2_BLBACK_GAMMA_TABLE120_PRE
#define DSP2_BLBACK_GAMMA_TABLE120_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE120_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE120_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE120_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE120_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE120_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE120_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE120_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE121_PRE       DSP2_BLBACK_GAMMA_TABLE121_PRE
#define DSP2_BLBACK_GAMMA_TABLE121_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE121_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE121_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE121_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE121_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE121_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE121_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE121_PRE_POS))

/* 0xDF4 : BL_GAMMA_TABLE_62 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_62_OFFSET (0xDF4)
#define DSP2_BLBACK_GAMMA_TABLE122_PRE       DSP2_BLBACK_GAMMA_TABLE122_PRE
#define DSP2_BLBACK_GAMMA_TABLE122_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE122_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE122_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE122_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE122_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE122_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE122_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE122_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE123_PRE       DSP2_BLBACK_GAMMA_TABLE123_PRE
#define DSP2_BLBACK_GAMMA_TABLE123_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE123_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE123_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE123_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE123_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE123_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE123_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE123_PRE_POS))

/* 0xDF8 : BL_GAMMA_TABLE_63 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_63_OFFSET (0xDF8)
#define DSP2_BLBACK_GAMMA_TABLE124_PRE       DSP2_BLBACK_GAMMA_TABLE124_PRE
#define DSP2_BLBACK_GAMMA_TABLE124_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE124_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE124_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE124_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE124_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE124_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE124_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE124_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE125_PRE       DSP2_BLBACK_GAMMA_TABLE125_PRE
#define DSP2_BLBACK_GAMMA_TABLE125_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE125_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE125_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE125_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE125_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE125_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE125_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE125_PRE_POS))

/* 0xDFC : BL_GAMMA_TABLE_64 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_64_OFFSET (0xDFC)
#define DSP2_BLBACK_GAMMA_TABLE126_PRE       DSP2_BLBACK_GAMMA_TABLE126_PRE
#define DSP2_BLBACK_GAMMA_TABLE126_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE126_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE126_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE126_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE126_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE126_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE126_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE126_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE127_PRE       DSP2_BLBACK_GAMMA_TABLE127_PRE
#define DSP2_BLBACK_GAMMA_TABLE127_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE127_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE127_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE127_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE127_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE127_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE127_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE127_PRE_POS))

/* 0xE00 : BL_GAMMA_TABLE_65 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_65_OFFSET (0xE00)
#define DSP2_BLBACK_GAMMA_TABLE128_PRE       DSP2_BLBACK_GAMMA_TABLE128_PRE
#define DSP2_BLBACK_GAMMA_TABLE128_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE128_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE128_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE128_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE128_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE128_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE128_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE128_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE129_PRE       DSP2_BLBACK_GAMMA_TABLE129_PRE
#define DSP2_BLBACK_GAMMA_TABLE129_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE129_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE129_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE129_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE129_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE129_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE129_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE129_PRE_POS))

/* 0xE04 : BL_GAMMA_TABLE_66 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_66_OFFSET (0xE04)
#define DSP2_BLBACK_GAMMA_TABLE130_PRE       DSP2_BLBACK_GAMMA_TABLE130_PRE
#define DSP2_BLBACK_GAMMA_TABLE130_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE130_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE130_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE130_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE130_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE130_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE130_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE130_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE131_PRE       DSP2_BLBACK_GAMMA_TABLE131_PRE
#define DSP2_BLBACK_GAMMA_TABLE131_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE131_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE131_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE131_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE131_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE131_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE131_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE131_PRE_POS))

/* 0xE08 : BL_GAMMA_TABLE_67 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_67_OFFSET (0xE08)
#define DSP2_BLBACK_GAMMA_TABLE132_PRE       DSP2_BLBACK_GAMMA_TABLE132_PRE
#define DSP2_BLBACK_GAMMA_TABLE132_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE132_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE132_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE132_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE132_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE132_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE132_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE132_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE133_PRE       DSP2_BLBACK_GAMMA_TABLE133_PRE
#define DSP2_BLBACK_GAMMA_TABLE133_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE133_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE133_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE133_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE133_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE133_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE133_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE133_PRE_POS))

