RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xE0C : BL_GAMMA_TABLE_68 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_68_OFFSET (0xE0C)
#define DSP2_BLBACK_GAMMA_TABLE134_PRE       DSP2_BLBACK_GAMMA_TABLE134_PRE
#define DSP2_BLBACK_GAMMA_TABLE134_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE134_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE134_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE134_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE134_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE134_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE134_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE134_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE135_PRE       DSP2_BLBACK_GAMMA_TABLE135_PRE
#define DSP2_BLBACK_GAMMA_TABLE135_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE135_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE135_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE135_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE135_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE135_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE135_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE135_PRE_POS))

/* 0xE10 : BL_GAMMA_TABLE_69 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_69_OFFSET (0xE10)
#define DSP2_BLBACK_GAMMA_TABLE136_PRE       DSP2_BLBACK_GAMMA_TABLE136_PRE
#define DSP2_BLBACK_GAMMA_TABLE136_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE136_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE136_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE136_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE136_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE136_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE136_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE136_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE137_PRE       DSP2_BLBACK_GAMMA_TABLE137_PRE
#define DSP2_BLBACK_GAMMA_TABLE137_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE137_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE137_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE137_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE137_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE137_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE137_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE137_PRE_POS))

/* 0xE14 : BL_GAMMA_TABLE_70 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_70_OFFSET (0xE14)
#define DSP2_BLBACK_GAMMA_TABLE138_PRE       DSP2_BLBACK_GAMMA_TABLE138_PRE
#define DSP2_BLBACK_GAMMA_TABLE138_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE138_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE138_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE138_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE138_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE138_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE138_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE138_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE139_PRE       DSP2_BLBACK_GAMMA_TABLE139_PRE
#define DSP2_BLBACK_GAMMA_TABLE139_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE139_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE139_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE139_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE139_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE139_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE139_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE139_PRE_POS))

/* 0xE18 : BL_GAMMA_TABLE_71 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_71_OFFSET (0xE18)
#define DSP2_BLBACK_GAMMA_TABLE140_PRE       DSP2_BLBACK_GAMMA_TABLE140_PRE
#define DSP2_BLBACK_GAMMA_TABLE140_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE140_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE140_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE140_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE140_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE140_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE140_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE140_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE141_PRE       DSP2_BLBACK_GAMMA_TABLE141_PRE
#define DSP2_BLBACK_GAMMA_TABLE141_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE141_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE141_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE141_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE141_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE141_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE141_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE141_PRE_POS))

/* 0xE1C : BL_GAMMA_TABLE_72 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_72_OFFSET (0xE1C)
#define DSP2_BLBACK_GAMMA_TABLE142_PRE       DSP2_BLBACK_GAMMA_TABLE142_PRE
#define DSP2_BLBACK_GAMMA_TABLE142_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE142_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE142_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE142_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE142_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE142_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE142_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE142_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE143_PRE       DSP2_BLBACK_GAMMA_TABLE143_PRE
#define DSP2_BLBACK_GAMMA_TABLE143_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE143_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE143_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE143_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE143_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE143_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE143_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE143_PRE_POS))

/* 0xE20 : BL_GAMMA_TABLE_73 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_73_OFFSET (0xE20)
#define DSP2_BLBACK_GAMMA_TABLE144_PRE       DSP2_BLBACK_GAMMA_TABLE144_PRE
#define DSP2_BLBACK_GAMMA_TABLE144_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE144_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE144_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE144_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE144_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE144_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE144_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE144_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE145_PRE       DSP2_BLBACK_GAMMA_TABLE145_PRE
#define DSP2_BLBACK_GAMMA_TABLE145_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE145_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE145_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE145_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE145_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE145_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE145_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE145_PRE_POS))

/* 0xE24 : BL_GAMMA_TABLE_74 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_74_OFFSET (0xE24)
#define DSP2_BLBACK_GAMMA_TABLE146_PRE       DSP2_BLBACK_GAMMA_TABLE146_PRE
#define DSP2_BLBACK_GAMMA_TABLE146_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE146_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE146_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE146_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE146_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE146_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE146_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE146_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE147_PRE       DSP2_BLBACK_GAMMA_TABLE147_PRE
#define DSP2_BLBACK_GAMMA_TABLE147_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE147_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE147_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE147_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE147_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE147_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE147_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE147_PRE_POS))

