RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xE28 : BL_GAMMA_TABLE_75 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_75_OFFSET (0xE28)
#define DSP2_BLBACK_GAMMA_TABLE148_PRE       DSP2_BLBACK_GAMMA_TABLE148_PRE
#define DSP2_BLBACK_GAMMA_TABLE148_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE148_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE148_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE148_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE148_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE148_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE148_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE148_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE149_PRE       DSP2_BLBACK_GAMMA_TABLE149_PRE
#define DSP2_BLBACK_GAMMA_TABLE149_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE149_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE149_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE149_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE149_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE149_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE149_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE149_PRE_POS))

/* 0xE2C : BL_GAMMA_TABLE_76 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_76_OFFSET (0xE2C)
#define DSP2_BLBACK_GAMMA_TABLE150_PRE       DSP2_BLBACK_GAMMA_TABLE150_PRE
#define DSP2_BLBACK_GAMMA_TABLE150_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE150_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE150_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE150_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE150_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE150_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE150_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE150_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE151_PRE       DSP2_BLBACK_GAMMA_TABLE151_PRE
#define DSP2_BLBACK_GAMMA_TABLE151_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE151_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE151_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE151_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE151_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE151_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE151_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE151_PRE_POS))

/* 0xE30 : BL_GAMMA_TABLE_77 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_77_OFFSET (0xE30)
#define DSP2_BLBACK_GAMMA_TABLE152_PRE       DSP2_BLBACK_GAMMA_TABLE152_PRE
#define DSP2_BLBACK_GAMMA_TABLE152_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE152_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE152_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE152_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE152_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE152_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE152_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE152_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE153_PRE       DSP2_BLBACK_GAMMA_TABLE153_PRE
#define DSP2_BLBACK_GAMMA_TABLE153_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE153_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE153_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE153_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE153_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE153_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE153_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE153_PRE_POS))

/* 0xE34 : BL_GAMMA_TABLE_78 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_78_OFFSET (0xE34)
#define DSP2_BLBACK_GAMMA_TABLE154_PRE       DSP2_BLBACK_GAMMA_TABLE154_PRE
#define DSP2_BLBACK_GAMMA_TABLE154_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE154_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE154_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE154_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE154_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE154_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE154_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE154_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE155_PRE       DSP2_BLBACK_GAMMA_TABLE155_PRE
#define DSP2_BLBACK_GAMMA_TABLE155_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE155_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE155_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE155_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE155_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE155_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE155_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE155_PRE_POS))

/* 0xE38 : BL_GAMMA_TABLE_79 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_79_OFFSET (0xE38)
#define DSP2_BLBACK_GAMMA_TABLE156_PRE       DSP2_BLBACK_GAMMA_TABLE156_PRE
#define DSP2_BLBACK_GAMMA_TABLE156_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE156_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE156_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE156_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE156_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE156_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE156_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE156_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE157_PRE       DSP2_BLBACK_GAMMA_TABLE157_PRE
#define DSP2_BLBACK_GAMMA_TABLE157_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE157_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE157_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE157_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE157_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE157_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE157_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE157_PRE_POS))

/* 0xE3C : BL_GAMMA_TABLE_80 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_80_OFFSET (0xE3C)
#define DSP2_BLBACK_GAMMA_TABLE158_PRE       DSP2_BLBACK_GAMMA_TABLE158_PRE
#define DSP2_BLBACK_GAMMA_TABLE158_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE158_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE158_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE158_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE158_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE158_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE158_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE158_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE159_PRE       DSP2_BLBACK_GAMMA_TABLE159_PRE
#define DSP2_BLBACK_GAMMA_TABLE159_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE159_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE159_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE159_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE159_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE159_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE159_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE159_PRE_POS))

/* 0xE40 : BL_GAMMA_TABLE_81 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_81_OFFSET (0xE40)
#define DSP2_BLBACK_GAMMA_TABLE160_PRE       DSP2_BLBACK_GAMMA_TABLE160_PRE
#define DSP2_BLBACK_GAMMA_TABLE160_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE160_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE160_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE160_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE160_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE160_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE160_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE160_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE161_PRE       DSP2_BLBACK_GAMMA_TABLE161_PRE
#define DSP2_BLBACK_GAMMA_TABLE161_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE161_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE161_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE161_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE161_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE161_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE161_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE161_PRE_POS))

/* 0xE44 : BL_GAMMA_TABLE_82 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_82_OFFSET (0xE44)
#define DSP2_BLBACK_GAMMA_TABLE162_PRE       DSP2_BLBACK_GAMMA_TABLE162_PRE
#define DSP2_BLBACK_GAMMA_TABLE162_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE162_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE162_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE162_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE162_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE162_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE162_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE162_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE163_PRE       DSP2_BLBACK_GAMMA_TABLE163_PRE
#define DSP2_BLBACK_GAMMA_TABLE163_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE163_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE163_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE163_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE163_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE163_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE163_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE163_PRE_POS))

/* 0xE48 : BL_GAMMA_TABLE_83 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_83_OFFSET (0xE48)
#define DSP2_BLBACK_GAMMA_TABLE164_PRE       DSP2_BLBACK_GAMMA_TABLE164_PRE
#define DSP2_BLBACK_GAMMA_TABLE164_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE164_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE164_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE164_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE164_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE164_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE164_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE164_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE165_PRE       DSP2_BLBACK_GAMMA_TABLE165_PRE
#define DSP2_BLBACK_GAMMA_TABLE165_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE165_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE165_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE165_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE165_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE165_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE165_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE165_PRE_POS))

/* 0xE4C : BL_GAMMA_TABLE_84 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_84_OFFSET (0xE4C)
#define DSP2_BLBACK_GAMMA_TABLE166_PRE       DSP2_BLBACK_GAMMA_TABLE166_PRE
#define DSP2_BLBACK_GAMMA_TABLE166_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE166_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE166_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE166_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE166_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE166_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE166_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE166_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE167_PRE       DSP2_BLBACK_GAMMA_TABLE167_PRE
#define DSP2_BLBACK_GAMMA_TABLE167_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE167_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE167_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE167_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE167_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE167_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE167_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE167_PRE_POS))

/* 0xE50 : BL_GAMMA_TABLE_85 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_85_OFFSET (0xE50)
#define DSP2_BLBACK_GAMMA_TABLE168_PRE       DSP2_BLBACK_GAMMA_TABLE168_PRE
#define DSP2_BLBACK_GAMMA_TABLE168_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE168_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE168_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE168_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE168_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE168_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE168_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE168_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE169_PRE       DSP2_BLBACK_GAMMA_TABLE169_PRE
#define DSP2_BLBACK_GAMMA_TABLE169_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE169_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE169_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE169_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE169_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE169_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE169_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE169_PRE_POS))

/* 0xE54 : BL_GAMMA_TABLE_86 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_86_OFFSET (0xE54)
#define DSP2_BLBACK_GAMMA_TABLE170_PRE       DSP2_BLBACK_GAMMA_TABLE170_PRE
#define DSP2_BLBACK_GAMMA_TABLE170_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE170_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE170_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE170_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE170_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE170_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE170_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE170_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE171_PRE       DSP2_BLBACK_GAMMA_TABLE171_PRE
#define DSP2_BLBACK_GAMMA_TABLE171_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE171_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE171_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE171_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE171_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE171_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE171_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE171_PRE_POS))

/* 0xE58 : BL_GAMMA_TABLE_87 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_87_OFFSET (0xE58)
#define DSP2_BLBACK_GAMMA_TABLE172_PRE       DSP2_BLBACK_GAMMA_TABLE172_PRE
#define DSP2_BLBACK_GAMMA_TABLE172_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE172_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE172_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE172_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE172_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE172_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE172_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE172_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE173_PRE       DSP2_BLBACK_GAMMA_TABLE173_PRE
#define DSP2_BLBACK_GAMMA_TABLE173_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE173_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE173_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE173_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE173_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE173_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE173_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE173_PRE_POS))

