RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xE5C : BL_GAMMA_TABLE_88 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_88_OFFSET (0xE5C)
#define DSP2_BLBACK_GAMMA_TABLE174_PRE       DSP2_BLBACK_GAMMA_TABLE174_PRE
#define DSP2_BLBACK_GAMMA_TABLE174_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE174_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE174_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE174_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE174_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE174_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE174_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE174_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE175_PRE       DSP2_BLBACK_GAMMA_TABLE175_PRE
#define DSP2_BLBACK_GAMMA_TABLE175_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE175_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE175_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE175_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE175_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE175_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE175_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE175_PRE_POS))

/* 0xE60 : BL_GAMMA_TABLE_89 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_89_OFFSET (0xE60)
#define DSP2_BLBACK_GAMMA_TABLE176_PRE       DSP2_BLBACK_GAMMA_TABLE176_PRE
#define DSP2_BLBACK_GAMMA_TABLE176_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE176_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE176_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE176_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE176_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE176_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE176_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE176_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE177_PRE       DSP2_BLBACK_GAMMA_TABLE177_PRE
#define DSP2_BLBACK_GAMMA_TABLE177_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE177_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE177_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE177_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE177_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE177_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE177_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE177_PRE_POS))

/* 0xE64 : BL_GAMMA_TABLE_90 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_90_OFFSET (0xE64)
#define DSP2_BLBACK_GAMMA_TABLE178_PRE       DSP2_BLBACK_GAMMA_TABLE178_PRE
#define DSP2_BLBACK_GAMMA_TABLE178_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE178_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE178_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE178_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE178_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE178_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE178_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE178_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE179_PRE       DSP2_BLBACK_GAMMA_TABLE179_PRE
#define DSP2_BLBACK_GAMMA_TABLE179_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE179_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE179_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE179_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE179_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE179_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE179_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE179_PRE_POS))

/* 0xE68 : BL_GAMMA_TABLE_91 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_91_OFFSET (0xE68)
#define DSP2_BLBACK_GAMMA_TABLE180_PRE       DSP2_BLBACK_GAMMA_TABLE180_PRE
#define DSP2_BLBACK_GAMMA_TABLE180_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE180_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE180_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE180_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE180_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE180_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE180_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE180_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE181_PRE       DSP2_BLBACK_GAMMA_TABLE181_PRE
#define DSP2_BLBACK_GAMMA_TABLE181_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE181_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE181_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE181_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE181_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE181_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE181_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE181_PRE_POS))

/* 0xE6C : BL_GAMMA_TABLE_92 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_92_OFFSET (0xE6C)
#define DSP2_BLBACK_GAMMA_TABLE182_PRE       DSP2_BLBACK_GAMMA_TABLE182_PRE
#define DSP2_BLBACK_GAMMA_TABLE182_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE182_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE182_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE182_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE182_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE182_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE182_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE182_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE183_PRE       DSP2_BLBACK_GAMMA_TABLE183_PRE
#define DSP2_BLBACK_GAMMA_TABLE183_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE183_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE183_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE183_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE183_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE183_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE183_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE183_PRE_POS))

/* 0xE70 : BL_GAMMA_TABLE_93 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_93_OFFSET (0xE70)
#define DSP2_BLBACK_GAMMA_TABLE184_PRE       DSP2_BLBACK_GAMMA_TABLE184_PRE
#define DSP2_BLBACK_GAMMA_TABLE184_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE184_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE184_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE184_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE184_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE184_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE184_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE184_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE185_PRE       DSP2_BLBACK_GAMMA_TABLE185_PRE
#define DSP2_BLBACK_GAMMA_TABLE185_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE185_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE185_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE185_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE185_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE185_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE185_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE185_PRE_POS))

/* 0xE74 : BL_GAMMA_TABLE_94 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_94_OFFSET (0xE74)
#define DSP2_BLBACK_GAMMA_TABLE186_PRE       DSP2_BLBACK_GAMMA_TABLE186_PRE
#define DSP2_BLBACK_GAMMA_TABLE186_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE186_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE186_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE186_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE186_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE186_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE186_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE186_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE187_PRE       DSP2_BLBACK_GAMMA_TABLE187_PRE
#define DSP2_BLBACK_GAMMA_TABLE187_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE187_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE187_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE187_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE187_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE187_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE187_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE187_PRE_POS))

