RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xE78 : BL_GAMMA_TABLE_95 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_95_OFFSET (0xE78)
#define DSP2_BLBACK_GAMMA_TABLE188_PRE       DSP2_BLBACK_GAMMA_TABLE188_PRE
#define DSP2_BLBACK_GAMMA_TABLE188_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE188_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE188_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE188_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE188_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE188_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE188_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE188_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE189_PRE       DSP2_BLBACK_GAMMA_TABLE189_PRE
#define DSP2_BLBACK_GAMMA_TABLE189_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE189_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE189_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE189_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE189_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE189_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE189_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE189_PRE_POS))

/* 0xE7C : BL_GAMMA_TABLE_96 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_96_OFFSET (0xE7C)
#define DSP2_BLBACK_GAMMA_TABLE190_PRE       DSP2_BLBACK_GAMMA_TABLE190_PRE
#define DSP2_BLBACK_GAMMA_TABLE190_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE190_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE190_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE190_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE190_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE190_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE190_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE190_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE191_PRE       DSP2_BLBACK_GAMMA_TABLE191_PRE
#define DSP2_BLBACK_GAMMA_TABLE191_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE191_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE191_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE191_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE191_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE191_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE191_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE191_PRE_POS))

/* 0xE80 : BL_GAMMA_TABLE_97 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_97_OFFSET (0xE80)
#define DSP2_BLBACK_GAMMA_TABLE192_PRE       DSP2_BLBACK_GAMMA_TABLE192_PRE
#define DSP2_BLBACK_GAMMA_TABLE192_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE192_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE192_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE192_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE192_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE192_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE192_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE192_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE193_PRE       DSP2_BLBACK_GAMMA_TABLE193_PRE
#define DSP2_BLBACK_GAMMA_TABLE193_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE193_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE193_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE193_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE193_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE193_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE193_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE193_PRE_POS))

/* 0xE84 : BL_GAMMA_TABLE_98 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_98_OFFSET (0xE84)
#define DSP2_BLBACK_GAMMA_TABLE194_PRE       DSP2_BLBACK_GAMMA_TABLE194_PRE
#define DSP2_BLBACK_GAMMA_TABLE194_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE194_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE194_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE194_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE194_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE194_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE194_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE194_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE195_PRE       DSP2_BLBACK_GAMMA_TABLE195_PRE
#define DSP2_BLBACK_GAMMA_TABLE195_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE195_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE195_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE195_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE195_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE195_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE195_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE195_PRE_POS))

/* 0xE88 : BL_GAMMA_TABLE_99 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_99_OFFSET (0xE88)
#define DSP2_BLBACK_GAMMA_TABLE196_PRE       DSP2_BLBACK_GAMMA_TABLE196_PRE
#define DSP2_BLBACK_GAMMA_TABLE196_PRE_POS   (0U)
#define DSP2_BLBACK_GAMMA_TABLE196_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE196_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE196_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE196_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE196_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE196_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE196_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE197_PRE       DSP2_BLBACK_GAMMA_TABLE197_PRE
#define DSP2_BLBACK_GAMMA_TABLE197_PRE_POS   (16U)
#define DSP2_BLBACK_GAMMA_TABLE197_PRE_LEN   (12U)
#define DSP2_BLBACK_GAMMA_TABLE197_PRE_MSK   (((1U << DSP2_BLBACK_GAMMA_TABLE197_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE197_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE197_PRE_UMSK  (~(((1U << DSP2_BLBACK_GAMMA_TABLE197_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE197_PRE_POS))

/* 0xE8C : BL_GAMMA_TABLE_100 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_100_OFFSET (0xE8C)
#define DSP2_BLBACK_GAMMA_TABLE198_PRE        DSP2_BLBACK_GAMMA_TABLE198_PRE
#define DSP2_BLBACK_GAMMA_TABLE198_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE198_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE198_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE198_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE198_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE198_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE198_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE198_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE199_PRE        DSP2_BLBACK_GAMMA_TABLE199_PRE
#define DSP2_BLBACK_GAMMA_TABLE199_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE199_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE199_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE199_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE199_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE199_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE199_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE199_PRE_POS))

/* 0xE90 : BL_GAMMA_TABLE_101 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_101_OFFSET (0xE90)
#define DSP2_BLBACK_GAMMA_TABLE200_PRE        DSP2_BLBACK_GAMMA_TABLE200_PRE
#define DSP2_BLBACK_GAMMA_TABLE200_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE200_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE200_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE200_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE200_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE200_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE200_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE200_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE201_PRE        DSP2_BLBACK_GAMMA_TABLE201_PRE
#define DSP2_BLBACK_GAMMA_TABLE201_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE201_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE201_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE201_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE201_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE201_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE201_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE201_PRE_POS))

