RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xE94 : BL_GAMMA_TABLE_102 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_102_OFFSET (0xE94)
#define DSP2_BLBACK_GAMMA_TABLE202_PRE        DSP2_BLBACK_GAMMA_TABLE202_PRE
#define DSP2_BLBACK_GAMMA_TABLE202_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE202_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE202_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE202_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE202_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE202_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE202_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE202_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE203_PRE        DSP2_BLBACK_GAMMA_TABLE203_PRE
#define DSP2_BLBACK_GAMMA_TABLE203_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE203_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE203_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE203_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE203_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE203_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE203_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE203_PRE_POS))

/* 0xE98 : BL_GAMMA_TABLE_103 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_103_OFFSET (0xE98)
#define DSP2_BLBACK_GAMMA_TABLE204_PRE        DSP2_BLBACK_GAMMA_TABLE204_PRE
#define DSP2_BLBACK_GAMMA_TABLE204_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE204_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE204_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE204_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE204_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE204_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE204_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE204_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE205_PRE        DSP2_BLBACK_GAMMA_TABLE205_PRE
#define DSP2_BLBACK_GAMMA_TABLE205_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE205_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE205_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE205_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE205_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE205_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE205_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE205_PRE_POS))

/* 0xE9C : BL_GAMMA_TABLE_104 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_104_OFFSET (0xE9C)
#define DSP2_BLBACK_GAMMA_TABLE206_PRE        DSP2_BLBACK_GAMMA_TABLE206_PRE
#define DSP2_BLBACK_GAMMA_TABLE206_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE206_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE206_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE206_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE206_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE206_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE206_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE206_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE207_PRE        DSP2_BLBACK_GAMMA_TABLE207_PRE
#define DSP2_BLBACK_GAMMA_TABLE207_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE207_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE207_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE207_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE207_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE207_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE207_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE207_PRE_POS))

/* 0xEA0 : BL_GAMMA_TABLE_105 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_105_OFFSET (0xEA0)
#define DSP2_BLBACK_GAMMA_TABLE208_PRE        DSP2_BLBACK_GAMMA_TABLE208_PRE
#define DSP2_BLBACK_GAMMA_TABLE208_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE208_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE208_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE208_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE208_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE208_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE208_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE208_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE209_PRE        DSP2_BLBACK_GAMMA_TABLE209_PRE
#define DSP2_BLBACK_GAMMA_TABLE209_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE209_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE209_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE209_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE209_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE209_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE209_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE209_PRE_POS))

/* 0xEA4 : BL_GAMMA_TABLE_106 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_106_OFFSET (0xEA4)
#define DSP2_BLBACK_GAMMA_TABLE210_PRE        DSP2_BLBACK_GAMMA_TABLE210_PRE
#define DSP2_BLBACK_GAMMA_TABLE210_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE210_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE210_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE210_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE210_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE210_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE210_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE210_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE211_PRE        DSP2_BLBACK_GAMMA_TABLE211_PRE
#define DSP2_BLBACK_GAMMA_TABLE211_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE211_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE211_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE211_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE211_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE211_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE211_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE211_PRE_POS))

/* 0xEA8 : BL_GAMMA_TABLE_107 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_107_OFFSET (0xEA8)
#define DSP2_BLBACK_GAMMA_TABLE212_PRE        DSP2_BLBACK_GAMMA_TABLE212_PRE
#define DSP2_BLBACK_GAMMA_TABLE212_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE212_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE212_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE212_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE212_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE212_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE212_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE212_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE213_PRE        DSP2_BLBACK_GAMMA_TABLE213_PRE
#define DSP2_BLBACK_GAMMA_TABLE213_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE213_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE213_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE213_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE213_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE213_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE213_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE213_PRE_POS))

/* 0xEAC : BL_GAMMA_TABLE_108 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_108_OFFSET (0xEAC)
#define DSP2_BLBACK_GAMMA_TABLE214_PRE        DSP2_BLBACK_GAMMA_TABLE214_PRE
#define DSP2_BLBACK_GAMMA_TABLE214_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE214_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE214_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE214_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE214_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE214_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE214_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE214_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE215_PRE        DSP2_BLBACK_GAMMA_TABLE215_PRE
#define DSP2_BLBACK_GAMMA_TABLE215_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE215_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE215_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE215_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE215_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE215_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE215_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE215_PRE_POS))

