RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xEB0 : BL_GAMMA_TABLE_109 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_109_OFFSET (0xEB0)
#define DSP2_BLBACK_GAMMA_TABLE216_PRE        DSP2_BLBACK_GAMMA_TABLE216_PRE
#define DSP2_BLBACK_GAMMA_TABLE216_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE216_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE216_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE216_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE216_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE216_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE216_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE216_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE217_PRE        DSP2_BLBACK_GAMMA_TABLE217_PRE
#define DSP2_BLBACK_GAMMA_TABLE217_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE217_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE217_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE217_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE217_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE217_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE217_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE217_PRE_POS))

/* 0xEB4 : BL_GAMMA_TABLE_110 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_110_OFFSET (0xEB4)
#define DSP2_BLBACK_GAMMA_TABLE218_PRE        DSP2_BLBACK_GAMMA_TABLE218_PRE
#define DSP2_BLBACK_GAMMA_TABLE218_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE218_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE218_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE218_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE218_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE218_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE218_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE218_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE219_PRE        DSP2_BLBACK_GAMMA_TABLE219_PRE
#define DSP2_BLBACK_GAMMA_TABLE219_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE219_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE219_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE219_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE219_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE219_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE219_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE219_PRE_POS))

/* 0xEB8 : BL_GAMMA_TABLE_111 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_111_OFFSET (0xEB8)
#define DSP2_BLBACK_GAMMA_TABLE220_PRE        DSP2_BLBACK_GAMMA_TABLE220_PRE
#define DSP2_BLBACK_GAMMA_TABLE220_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE220_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE220_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE220_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE220_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE220_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE220_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE220_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE221_PRE        DSP2_BLBACK_GAMMA_TABLE221_PRE
#define DSP2_BLBACK_GAMMA_TABLE221_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE221_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE221_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE221_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE221_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE221_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE221_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE221_PRE_POS))

/* 0xEBC : BL_GAMMA_TABLE_112 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_112_OFFSET (0xEBC)
#define DSP2_BLBACK_GAMMA_TABLE222_PRE        DSP2_BLBACK_GAMMA_TABLE222_PRE
#define DSP2_BLBACK_GAMMA_TABLE222_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE222_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE222_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE222_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE222_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE222_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE222_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE222_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE223_PRE        DSP2_BLBACK_GAMMA_TABLE223_PRE
#define DSP2_BLBACK_GAMMA_TABLE223_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE223_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE223_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE223_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE223_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE223_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE223_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE223_PRE_POS))

/* 0xEC0 : BL_GAMMA_TABLE_113 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_113_OFFSET (0xEC0)
#define DSP2_BLBACK_GAMMA_TABLE224_PRE        DSP2_BLBACK_GAMMA_TABLE224_PRE
#define DSP2_BLBACK_GAMMA_TABLE224_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE224_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE224_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE224_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE224_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE224_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE224_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE224_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE225_PRE        DSP2_BLBACK_GAMMA_TABLE225_PRE
#define DSP2_BLBACK_GAMMA_TABLE225_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE225_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE225_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE225_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE225_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE225_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE225_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE225_PRE_POS))

/* 0xEC4 : BL_GAMMA_TABLE_114 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_114_OFFSET (0xEC4)
#define DSP2_BLBACK_GAMMA_TABLE226_PRE        DSP2_BLBACK_GAMMA_TABLE226_PRE
#define DSP2_BLBACK_GAMMA_TABLE226_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE226_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE226_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE226_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE226_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE226_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE226_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE226_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE227_PRE        DSP2_BLBACK_GAMMA_TABLE227_PRE
#define DSP2_BLBACK_GAMMA_TABLE227_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE227_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE227_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE227_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE227_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE227_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE227_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE227_PRE_POS))

/* 0xEC8 : BL_GAMMA_TABLE_115 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_115_OFFSET (0xEC8)
#define DSP2_BLBACK_GAMMA_TABLE228_PRE        DSP2_BLBACK_GAMMA_TABLE228_PRE
#define DSP2_BLBACK_GAMMA_TABLE228_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE228_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE228_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE228_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE228_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE228_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE228_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE228_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE229_PRE        DSP2_BLBACK_GAMMA_TABLE229_PRE
#define DSP2_BLBACK_GAMMA_TABLE229_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE229_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE229_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE229_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE229_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE229_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE229_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE229_PRE_POS))

/* 0xECC : BL_GAMMA_TABLE_116 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_116_OFFSET (0xECC)
#define DSP2_BLBACK_GAMMA_TABLE230_PRE        DSP2_BLBACK_GAMMA_TABLE230_PRE
#define DSP2_BLBACK_GAMMA_TABLE230_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE230_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE230_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE230_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE230_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE230_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE230_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE230_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE231_PRE        DSP2_BLBACK_GAMMA_TABLE231_PRE
#define DSP2_BLBACK_GAMMA_TABLE231_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE231_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE231_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE231_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE231_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE231_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE231_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE231_PRE_POS))

/* 0xED0 : BL_GAMMA_TABLE_117 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_117_OFFSET (0xED0)
#define DSP2_BLBACK_GAMMA_TABLE232_PRE        DSP2_BLBACK_GAMMA_TABLE232_PRE
#define DSP2_BLBACK_GAMMA_TABLE232_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE232_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE232_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE232_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE232_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE232_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE232_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE232_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE233_PRE        DSP2_BLBACK_GAMMA_TABLE233_PRE
#define DSP2_BLBACK_GAMMA_TABLE233_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE233_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE233_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE233_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE233_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE233_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE233_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE233_PRE_POS))

/* 0xED4 : BL_GAMMA_TABLE_118 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_118_OFFSET (0xED4)
#define DSP2_BLBACK_GAMMA_TABLE234_PRE        DSP2_BLBACK_GAMMA_TABLE234_PRE
#define DSP2_BLBACK_GAMMA_TABLE234_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE234_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE234_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE234_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE234_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE234_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE234_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE234_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE235_PRE        DSP2_BLBACK_GAMMA_TABLE235_PRE
#define DSP2_BLBACK_GAMMA_TABLE235_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE235_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE235_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE235_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE235_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE235_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE235_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE235_PRE_POS))

/* 0xED8 : BL_GAMMA_TABLE_119 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_119_OFFSET (0xED8)
#define DSP2_BLBACK_GAMMA_TABLE236_PRE        DSP2_BLBACK_GAMMA_TABLE236_PRE
#define DSP2_BLBACK_GAMMA_TABLE236_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE236_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE236_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE236_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE236_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE236_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE236_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE236_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE237_PRE        DSP2_BLBACK_GAMMA_TABLE237_PRE
#define DSP2_BLBACK_GAMMA_TABLE237_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE237_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE237_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE237_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE237_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE237_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE237_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE237_PRE_POS))

/* 0xEDC : BL_GAMMA_TABLE_120 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_120_OFFSET (0xEDC)
#define DSP2_BLBACK_GAMMA_TABLE238_PRE        DSP2_BLBACK_GAMMA_TABLE238_PRE
#define DSP2_BLBACK_GAMMA_TABLE238_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE238_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE238_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE238_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE238_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE238_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE238_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE238_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE239_PRE        DSP2_BLBACK_GAMMA_TABLE239_PRE
#define DSP2_BLBACK_GAMMA_TABLE239_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE239_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE239_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE239_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE239_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE239_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE239_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE239_PRE_POS))

/* 0xEE0 : BL_GAMMA_TABLE_121 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_121_OFFSET (0xEE0)
#define DSP2_BLBACK_GAMMA_TABLE240_PRE        DSP2_BLBACK_GAMMA_TABLE240_PRE
#define DSP2_BLBACK_GAMMA_TABLE240_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE240_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE240_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE240_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE240_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE240_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE240_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE240_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE241_PRE        DSP2_BLBACK_GAMMA_TABLE241_PRE
#define DSP2_BLBACK_GAMMA_TABLE241_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE241_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE241_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE241_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE241_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE241_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE241_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE241_PRE_POS))

