RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xEE4 : BL_GAMMA_TABLE_122 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_122_OFFSET (0xEE4)
#define DSP2_BLBACK_GAMMA_TABLE242_PRE        DSP2_BLBACK_GAMMA_TABLE242_PRE
#define DSP2_BLBACK_GAMMA_TABLE242_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE242_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE242_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE242_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE242_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE242_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE242_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE242_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE243_PRE        DSP2_BLBACK_GAMMA_TABLE243_PRE
#define DSP2_BLBACK_GAMMA_TABLE243_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE243_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE243_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE243_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE243_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE243_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE243_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE243_PRE_POS))

/* 0xEE8 : BL_GAMMA_TABLE_123 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_123_OFFSET (0xEE8)
#define DSP2_BLBACK_GAMMA_TABLE244_PRE        DSP2_BLBACK_GAMMA_TABLE244_PRE
#define DSP2_BLBACK_GAMMA_TABLE244_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE244_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE244_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE244_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE244_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE244_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE244_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE244_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE245_PRE        DSP2_BLBACK_GAMMA_TABLE245_PRE
#define DSP2_BLBACK_GAMMA_TABLE245_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE245_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE245_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE245_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE245_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE245_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE245_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE245_PRE_POS))

/* 0xEEC : BL_GAMMA_TABLE_124 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_124_OFFSET (0xEEC)
#define DSP2_BLBACK_GAMMA_TABLE246_PRE        DSP2_BLBACK_GAMMA_TABLE246_PRE
#define DSP2_BLBACK_GAMMA_TABLE246_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE246_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE246_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE246_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE246_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE246_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE246_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE246_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE247_PRE        DSP2_BLBACK_GAMMA_TABLE247_PRE
#define DSP2_BLBACK_GAMMA_TABLE247_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE247_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE247_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE247_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE247_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE247_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE247_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE247_PRE_POS))

/* 0xEF0 : BL_GAMMA_TABLE_125 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_125_OFFSET (0xEF0)
#define DSP2_BLBACK_GAMMA_TABLE248_PRE        DSP2_BLBACK_GAMMA_TABLE248_PRE
#define DSP2_BLBACK_GAMMA_TABLE248_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE248_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE248_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE248_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE248_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE248_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE248_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE248_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE249_PRE        DSP2_BLBACK_GAMMA_TABLE249_PRE
#define DSP2_BLBACK_GAMMA_TABLE249_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE249_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE249_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE249_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE249_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE249_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE249_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE249_PRE_POS))

/* 0xEF4 : BL_GAMMA_TABLE_126 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_126_OFFSET (0xEF4)
#define DSP2_BLBACK_GAMMA_TABLE250_PRE        DSP2_BLBACK_GAMMA_TABLE250_PRE
#define DSP2_BLBACK_GAMMA_TABLE250_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE250_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE250_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE250_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE250_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE250_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE250_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE250_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE251_PRE        DSP2_BLBACK_GAMMA_TABLE251_PRE
#define DSP2_BLBACK_GAMMA_TABLE251_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE251_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE251_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE251_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE251_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE251_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE251_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE251_PRE_POS))

/* 0xEF8 : BL_GAMMA_TABLE_127 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_127_OFFSET (0xEF8)
#define DSP2_BLBACK_GAMMA_TABLE252_PRE        DSP2_BLBACK_GAMMA_TABLE252_PRE
#define DSP2_BLBACK_GAMMA_TABLE252_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE252_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE252_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE252_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE252_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE252_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE252_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE252_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE253_PRE        DSP2_BLBACK_GAMMA_TABLE253_PRE
#define DSP2_BLBACK_GAMMA_TABLE253_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE253_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE253_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE253_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE253_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE253_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE253_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE253_PRE_POS))

/* 0xEFC : BL_GAMMA_TABLE_128 */
#define DSP2_BLBACK_BL_GAMMA_TABLE_128_OFFSET (0xEFC)
#define DSP2_BLBACK_GAMMA_TABLE254_PRE        DSP2_BLBACK_GAMMA_TABLE254_PRE
#define DSP2_BLBACK_GAMMA_TABLE254_PRE_POS    (0U)
#define DSP2_BLBACK_GAMMA_TABLE254_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE254_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE254_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE254_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE254_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE254_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE254_PRE_POS))
#define DSP2_BLBACK_GAMMA_TABLE255_PRE        DSP2_BLBACK_GAMMA_TABLE255_PRE
#define DSP2_BLBACK_GAMMA_TABLE255_PRE_POS    (16U)
#define DSP2_BLBACK_GAMMA_TABLE255_PRE_LEN    (12U)
#define DSP2_BLBACK_GAMMA_TABLE255_PRE_MSK    (((1U << DSP2_BLBACK_GAMMA_TABLE255_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE255_PRE_POS)
#define DSP2_BLBACK_GAMMA_TABLE255_PRE_UMSK   (~(((1U << DSP2_BLBACK_GAMMA_TABLE255_PRE_LEN) - 1) << DSP2_BLBACK_GAMMA_TABLE255_PRE_POS))

/* 0xF00 : CC_OFFSET_0 */
#define DSP2_BLBACK_CC_OFFSET_0_OFFSET      (0xF00)
#define DSP2_BLBACK_CC_PRE_OFFSET0_PRE      DSP2_BLBACK_CC_PRE_OFFSET0_PRE
#define DSP2_BLBACK_CC_PRE_OFFSET0_PRE_POS  (0U)
#define DSP2_BLBACK_CC_PRE_OFFSET0_PRE_LEN  (13U)
#define DSP2_BLBACK_CC_PRE_OFFSET0_PRE_MSK  (((1U << DSP2_BLBACK_CC_PRE_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET0_PRE_POS)
#define DSP2_BLBACK_CC_PRE_OFFSET0_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_PRE_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET0_PRE_POS))
#define DSP2_BLBACK_CC_PRE_OFFSET1_PRE      DSP2_BLBACK_CC_PRE_OFFSET1_PRE
#define DSP2_BLBACK_CC_PRE_OFFSET1_PRE_POS  (16U)
#define DSP2_BLBACK_CC_PRE_OFFSET1_PRE_LEN  (13U)
#define DSP2_BLBACK_CC_PRE_OFFSET1_PRE_MSK  (((1U << DSP2_BLBACK_CC_PRE_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET1_PRE_POS)
#define DSP2_BLBACK_CC_PRE_OFFSET1_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_PRE_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET1_PRE_POS))
#define DSP2_BLBACK_CC_ENABLE_PRE           DSP2_BLBACK_CC_ENABLE_PRE
#define DSP2_BLBACK_CC_ENABLE_PRE_POS       (31U)
#define DSP2_BLBACK_CC_ENABLE_PRE_LEN       (1U)
#define DSP2_BLBACK_CC_ENABLE_PRE_MSK       (((1U << DSP2_BLBACK_CC_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CC_ENABLE_PRE_POS)
#define DSP2_BLBACK_CC_ENABLE_PRE_UMSK      (~(((1U << DSP2_BLBACK_CC_ENABLE_PRE_LEN) - 1) << DSP2_BLBACK_CC_ENABLE_PRE_POS))

/* 0xF04 : CC_OFFSET_1 */
#define DSP2_BLBACK_CC_OFFSET_1_OFFSET       (0xF04)
#define DSP2_BLBACK_CC_PRE_OFFSET2_PRE       DSP2_BLBACK_CC_PRE_OFFSET2_PRE
#define DSP2_BLBACK_CC_PRE_OFFSET2_PRE_POS   (0U)
#define DSP2_BLBACK_CC_PRE_OFFSET2_PRE_LEN   (13U)
#define DSP2_BLBACK_CC_PRE_OFFSET2_PRE_MSK   (((1U << DSP2_BLBACK_CC_PRE_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET2_PRE_POS)
#define DSP2_BLBACK_CC_PRE_OFFSET2_PRE_UMSK  (~(((1U << DSP2_BLBACK_CC_PRE_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CC_PRE_OFFSET2_PRE_POS))
#define DSP2_BLBACK_CC_POST_OFFSET2_PRE      DSP2_BLBACK_CC_POST_OFFSET2_PRE
#define DSP2_BLBACK_CC_POST_OFFSET2_PRE_POS  (16U)
#define DSP2_BLBACK_CC_POST_OFFSET2_PRE_LEN  (13U)
#define DSP2_BLBACK_CC_POST_OFFSET2_PRE_MSK  (((1U << DSP2_BLBACK_CC_POST_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET2_PRE_POS)
#define DSP2_BLBACK_CC_POST_OFFSET2_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_POST_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET2_PRE_POS))

/* 0xF08 : CC_OFFSET_2 */
#define DSP2_BLBACK_CC_OFFSET_2_OFFSET       (0xF08)
#define DSP2_BLBACK_CC_POST_OFFSET0_PRE      DSP2_BLBACK_CC_POST_OFFSET0_PRE
#define DSP2_BLBACK_CC_POST_OFFSET0_PRE_POS  (0U)
#define DSP2_BLBACK_CC_POST_OFFSET0_PRE_LEN  (13U)
#define DSP2_BLBACK_CC_POST_OFFSET0_PRE_MSK  (((1U << DSP2_BLBACK_CC_POST_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET0_PRE_POS)
#define DSP2_BLBACK_CC_POST_OFFSET0_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_POST_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET0_PRE_POS))
#define DSP2_BLBACK_CC_POST_OFFSET1_PRE      DSP2_BLBACK_CC_POST_OFFSET1_PRE
#define DSP2_BLBACK_CC_POST_OFFSET1_PRE_POS  (16U)
#define DSP2_BLBACK_CC_POST_OFFSET1_PRE_LEN  (13U)
#define DSP2_BLBACK_CC_POST_OFFSET1_PRE_MSK  (((1U << DSP2_BLBACK_CC_POST_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET1_PRE_POS)
#define DSP2_BLBACK_CC_POST_OFFSET1_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_POST_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CC_POST_OFFSET1_PRE_POS))

/* 0xF0C : CC_MATRIX_0 */
#define DSP2_BLBACK_CC_MATRIX_0_OFFSET   (0xF0C)
#define DSP2_BLBACK_CC_MATRIX00_PRE      DSP2_BLBACK_CC_MATRIX00_PRE
#define DSP2_BLBACK_CC_MATRIX00_PRE_POS  (0U)
#define DSP2_BLBACK_CC_MATRIX00_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX00_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX00_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX00_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX00_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX00_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX00_PRE_POS))
#define DSP2_BLBACK_CC_MATRIX01_PRE      DSP2_BLBACK_CC_MATRIX01_PRE
#define DSP2_BLBACK_CC_MATRIX01_PRE_POS  (16U)
#define DSP2_BLBACK_CC_MATRIX01_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX01_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX01_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX01_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX01_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX01_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX01_PRE_POS))

/* 0xF10 : CC_MATRIX_1 */
#define DSP2_BLBACK_CC_MATRIX_1_OFFSET   (0xF10)
#define DSP2_BLBACK_CC_MATRIX10_PRE      DSP2_BLBACK_CC_MATRIX10_PRE
#define DSP2_BLBACK_CC_MATRIX10_PRE_POS  (0U)
#define DSP2_BLBACK_CC_MATRIX10_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX10_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX10_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX10_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX10_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX10_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX10_PRE_POS))
#define DSP2_BLBACK_CC_MATRIX02_PRE      DSP2_BLBACK_CC_MATRIX02_PRE
#define DSP2_BLBACK_CC_MATRIX02_PRE_POS  (16U)
#define DSP2_BLBACK_CC_MATRIX02_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX02_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX02_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX02_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX02_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX02_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX02_PRE_POS))

/* 0xF14 : CC_MATRIX_2 */
#define DSP2_BLBACK_CC_MATRIX_2_OFFSET   (0xF14)
#define DSP2_BLBACK_CC_MATRIX11_PRE      DSP2_BLBACK_CC_MATRIX11_PRE
#define DSP2_BLBACK_CC_MATRIX11_PRE_POS  (0U)
#define DSP2_BLBACK_CC_MATRIX11_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX11_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX11_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX11_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX11_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX11_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX11_PRE_POS))
#define DSP2_BLBACK_CC_MATRIX12_PRE      DSP2_BLBACK_CC_MATRIX12_PRE
#define DSP2_BLBACK_CC_MATRIX12_PRE_POS  (16U)
#define DSP2_BLBACK_CC_MATRIX12_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX12_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX12_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX12_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX12_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX12_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX12_PRE_POS))

/* 0xF18 : CC_MATRIX_3 */
#define DSP2_BLBACK_CC_MATRIX_3_OFFSET   (0xF18)
#define DSP2_BLBACK_CC_MATRIX20_PRE      DSP2_BLBACK_CC_MATRIX20_PRE
#define DSP2_BLBACK_CC_MATRIX20_PRE_POS  (0U)
#define DSP2_BLBACK_CC_MATRIX20_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX20_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX20_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX20_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX20_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX20_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX20_PRE_POS))
#define DSP2_BLBACK_CC_MATRIX21_PRE      DSP2_BLBACK_CC_MATRIX21_PRE
#define DSP2_BLBACK_CC_MATRIX21_PRE_POS  (16U)
#define DSP2_BLBACK_CC_MATRIX21_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX21_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX21_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX21_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX21_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX21_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX21_PRE_POS))

