RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
/* 0xF1C : CC_CE_MATRIX */
#define DSP2_BLBACK_CC_CE_MATRIX_OFFSET  (0xF1C)
#define DSP2_BLBACK_CC_MATRIX22_PRE      DSP2_BLBACK_CC_MATRIX22_PRE
#define DSP2_BLBACK_CC_MATRIX22_PRE_POS  (0U)
#define DSP2_BLBACK_CC_MATRIX22_PRE_LEN  (12U)
#define DSP2_BLBACK_CC_MATRIX22_PRE_MSK  (((1U << DSP2_BLBACK_CC_MATRIX22_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX22_PRE_POS)
#define DSP2_BLBACK_CC_MATRIX22_PRE_UMSK (~(((1U << DSP2_BLBACK_CC_MATRIX22_PRE_LEN) - 1) << DSP2_BLBACK_CC_MATRIX22_PRE_POS))
#define DSP2_BLBACK_CE_MATRIX02_PRE      DSP2_BLBACK_CE_MATRIX02_PRE
#define DSP2_BLBACK_CE_MATRIX02_PRE_POS  (16U)
#define DSP2_BLBACK_CE_MATRIX02_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX02_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX02_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX02_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX02_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX02_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX02_PRE_POS))

/* 0xF20 : CE_MATRIX_0 */
#define DSP2_BLBACK_CE_MATRIX_0_OFFSET   (0xF20)
#define DSP2_BLBACK_CE_MATRIX00_PRE      DSP2_BLBACK_CE_MATRIX00_PRE
#define DSP2_BLBACK_CE_MATRIX00_PRE_POS  (0U)
#define DSP2_BLBACK_CE_MATRIX00_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX00_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX00_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX00_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX00_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX00_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX00_PRE_POS))
#define DSP2_BLBACK_CE_MATRIX01_PRE      DSP2_BLBACK_CE_MATRIX01_PRE
#define DSP2_BLBACK_CE_MATRIX01_PRE_POS  (16U)
#define DSP2_BLBACK_CE_MATRIX01_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX01_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX01_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX01_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX01_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX01_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX01_PRE_POS))

/* 0xF24 : CE_MATRIX_1 */
#define DSP2_BLBACK_CE_MATRIX_1_OFFSET   (0xF24)
#define DSP2_BLBACK_CE_MATRIX10_PRE      DSP2_BLBACK_CE_MATRIX10_PRE
#define DSP2_BLBACK_CE_MATRIX10_PRE_POS  (0U)
#define DSP2_BLBACK_CE_MATRIX10_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX10_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX10_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX10_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX10_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX10_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX10_PRE_POS))
#define DSP2_BLBACK_CE_MATRIX11_PRE      DSP2_BLBACK_CE_MATRIX11_PRE
#define DSP2_BLBACK_CE_MATRIX11_PRE_POS  (16U)
#define DSP2_BLBACK_CE_MATRIX11_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX11_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX11_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX11_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX11_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX11_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX11_PRE_POS))

/* 0xF28 : CE_MATRIX_2 */
#define DSP2_BLBACK_CE_MATRIX_2_OFFSET   (0xF28)
#define DSP2_BLBACK_CE_MATRIX20_PRE      DSP2_BLBACK_CE_MATRIX20_PRE
#define DSP2_BLBACK_CE_MATRIX20_PRE_POS  (0U)
#define DSP2_BLBACK_CE_MATRIX20_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX20_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX20_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX20_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX20_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX20_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX20_PRE_POS))
#define DSP2_BLBACK_CE_MATRIX12_PRE      DSP2_BLBACK_CE_MATRIX12_PRE
#define DSP2_BLBACK_CE_MATRIX12_PRE_POS  (16U)
#define DSP2_BLBACK_CE_MATRIX12_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX12_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX12_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX12_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX12_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX12_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX12_PRE_POS))

/* 0xF2C : CE_MATRIX_3 */
#define DSP2_BLBACK_CE_MATRIX_3_OFFSET   (0xF2C)
#define DSP2_BLBACK_CE_MATRIX21_PRE      DSP2_BLBACK_CE_MATRIX21_PRE
#define DSP2_BLBACK_CE_MATRIX21_PRE_POS  (0U)
#define DSP2_BLBACK_CE_MATRIX21_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX21_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX21_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX21_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX21_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX21_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX21_PRE_POS))
#define DSP2_BLBACK_CE_MATRIX22_PRE      DSP2_BLBACK_CE_MATRIX22_PRE
#define DSP2_BLBACK_CE_MATRIX22_PRE_POS  (16U)
#define DSP2_BLBACK_CE_MATRIX22_PRE_LEN  (12U)
#define DSP2_BLBACK_CE_MATRIX22_PRE_MSK  (((1U << DSP2_BLBACK_CE_MATRIX22_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX22_PRE_POS)
#define DSP2_BLBACK_CE_MATRIX22_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_MATRIX22_PRE_LEN) - 1) << DSP2_BLBACK_CE_MATRIX22_PRE_POS))

/* 0xF30 : CE_OFFSET_0 */
#define DSP2_BLBACK_CE_OFFSET_0_OFFSET      (0xF30)
#define DSP2_BLBACK_CE_PRE_OFFSET0_PRE      DSP2_BLBACK_CE_PRE_OFFSET0_PRE
#define DSP2_BLBACK_CE_PRE_OFFSET0_PRE_POS  (0U)
#define DSP2_BLBACK_CE_PRE_OFFSET0_PRE_LEN  (13U)
#define DSP2_BLBACK_CE_PRE_OFFSET0_PRE_MSK  (((1U << DSP2_BLBACK_CE_PRE_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET0_PRE_POS)
#define DSP2_BLBACK_CE_PRE_OFFSET0_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_PRE_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET0_PRE_POS))
#define DSP2_BLBACK_CE_PRE_OFFSET1_PRE      DSP2_BLBACK_CE_PRE_OFFSET1_PRE
#define DSP2_BLBACK_CE_PRE_OFFSET1_PRE_POS  (16U)
#define DSP2_BLBACK_CE_PRE_OFFSET1_PRE_LEN  (13U)
#define DSP2_BLBACK_CE_PRE_OFFSET1_PRE_MSK  (((1U << DSP2_BLBACK_CE_PRE_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET1_PRE_POS)
#define DSP2_BLBACK_CE_PRE_OFFSET1_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_PRE_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET1_PRE_POS))

/* 0xF34 : CE_OFFSET_1 */
#define DSP2_BLBACK_CE_OFFSET_1_OFFSET       (0xF34)
#define DSP2_BLBACK_CE_PRE_OFFSET2_PRE       DSP2_BLBACK_CE_PRE_OFFSET2_PRE
#define DSP2_BLBACK_CE_PRE_OFFSET2_PRE_POS   (0U)
#define DSP2_BLBACK_CE_PRE_OFFSET2_PRE_LEN   (13U)
#define DSP2_BLBACK_CE_PRE_OFFSET2_PRE_MSK   (((1U << DSP2_BLBACK_CE_PRE_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET2_PRE_POS)
#define DSP2_BLBACK_CE_PRE_OFFSET2_PRE_UMSK  (~(((1U << DSP2_BLBACK_CE_PRE_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CE_PRE_OFFSET2_PRE_POS))
#define DSP2_BLBACK_CE_POST_OFFSET2_PRE      DSP2_BLBACK_CE_POST_OFFSET2_PRE
#define DSP2_BLBACK_CE_POST_OFFSET2_PRE_POS  (16U)
#define DSP2_BLBACK_CE_POST_OFFSET2_PRE_LEN  (13U)
#define DSP2_BLBACK_CE_POST_OFFSET2_PRE_MSK  (((1U << DSP2_BLBACK_CE_POST_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET2_PRE_POS)
#define DSP2_BLBACK_CE_POST_OFFSET2_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_POST_OFFSET2_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET2_PRE_POS))

/* 0xF38 : CE_OFFSET_2 */
#define DSP2_BLBACK_CE_OFFSET_2_OFFSET       (0xF38)
#define DSP2_BLBACK_CE_POST_OFFSET0_PRE      DSP2_BLBACK_CE_POST_OFFSET0_PRE
#define DSP2_BLBACK_CE_POST_OFFSET0_PRE_POS  (0U)
#define DSP2_BLBACK_CE_POST_OFFSET0_PRE_LEN  (13U)
#define DSP2_BLBACK_CE_POST_OFFSET0_PRE_MSK  (((1U << DSP2_BLBACK_CE_POST_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET0_PRE_POS)
#define DSP2_BLBACK_CE_POST_OFFSET0_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_POST_OFFSET0_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET0_PRE_POS))
#define DSP2_BLBACK_CE_POST_OFFSET1_PRE      DSP2_BLBACK_CE_POST_OFFSET1_PRE
#define DSP2_BLBACK_CE_POST_OFFSET1_PRE_POS  (16U)
#define DSP2_BLBACK_CE_POST_OFFSET1_PRE_LEN  (13U)
#define DSP2_BLBACK_CE_POST_OFFSET1_PRE_MSK  (((1U << DSP2_BLBACK_CE_POST_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET1_PRE_POS)
#define DSP2_BLBACK_CE_POST_OFFSET1_PRE_UMSK (~(((1U << DSP2_BLBACK_CE_POST_OFFSET1_PRE_LEN) - 1) << DSP2_BLBACK_CE_POST_OFFSET1_PRE_POS))

struct dsp2_blback_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[788];

    /* 0x314 : ccr_coef_A */
    union {
        struct {
            uint32_t reserved_0_15  : 16; /* [15: 0],       rsvd,        0x0 */
            uint32_t a11_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_A;

    /* 0x318 : ccr_coef_B */
    union {
        struct {
            uint32_t a12_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a13_pre        : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_B;

    /* 0x31C : ccr_coef_C */
    union {
        struct {
            uint32_t a21_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a22_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_C;

    /* 0x320 : ccr_coef_D */
    union {
        struct {
            uint32_t a23_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a31_pre        : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_D;

    /* 0x324 : ccr_coef_E */
    union {
        struct {
            uint32_t a32_pre        : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t a33_pre        : 12; /* [27:16],        r/w,      0x200 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ccr_coef_E;

