RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0x328 : gamma_A */
    union {
        struct {
            uint32_t gamma_on_pre    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t gamma_eb_pre    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3    : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t bl_gamma_en_pre : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_31   : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gamma_A;

    /* 0x32c  reserved */
    uint8_t RESERVED0x32c[16];

    /* 0x33C : conv_mode */
    union {
        struct {
            uint32_t conv_mode_w   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } conv_mode;

    /* 0x340  reserved */
    uint8_t RESERVED0x340[12];

    /* 0x34C : YUVC_A */
    union {
        struct {
            uint32_t YBrightness_w    : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t YContrast_w      : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t CbSaturation_pre : 8; /* [23:16],        r/w,       0x80 */
            uint32_t CrSaturation_pre : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } YUVC_A;

    /* 0x350 : YUVC_B */
    union {
        struct {
            uint32_t SpecialMode_w            : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3               : 1; /* [    3],       rsvd,        0x0 */
            uint32_t C444to422Filteringmode_w : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7             : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t SepiaCb_w                : 8; /* [15: 8],        r/w,       0x73 */
            uint32_t SepiaCr_w                : 8; /* [23:16],        r/w,       0x89 */
            uint32_t SolarThred_w             : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } YUVC_B;

    /* 0x354 : DNR_A */
    union {
        struct {
            uint32_t noise_level_pre      : 6;  /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t nr_hsize_pre         : 16; /* [23: 8],        r/w,      0x788 */
            uint32_t Filt_Strength_2D_pre : 4;  /* [27:24],        r/w,        0x6 */
            uint32_t Filt_Strength_3D_pre : 4;  /* [31:28],        r/w,        0x5 */
        } BF;
        uint32_t WORD;
    } DNR_A;

    /* 0x358 : DNR_B */
    union {
        struct {
            uint32_t reserved_0_7   : 8;  /* [ 7: 0],       rsvd,        0x0 */
            uint32_t CbCr_select_w  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t out_format_w   : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DNR_B;

    /* 0x35c  reserved */
    uint8_t RESERVED0x35c[4];

    /* 0x360 : BLEE_0 */
    union {
        struct {
            uint32_t ee_eb_pre      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ovrsht_eb_pre  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_15  : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t txt_thr_pre    : 9;  /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_0;

    /* 0x364 : BLEE_1 */
    union {
        struct {
            uint32_t thresh1_pre    : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7     : 1; /* [    7],       rsvd,        0x0 */
            uint32_t thresh2_pre    : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t flat_thr_pre   : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31 : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_1;

    /* 0x368 : BLEE_2 */
    union {
        struct {
            uint32_t ovrsht_pos_pre : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7     : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ovrsht_neg_pre : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t posee_str_pre  : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23    : 1; /* [   23],       rsvd,        0x0 */
            uint32_t negee_str_pre  : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31    : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_2;

    /* 0x36C : BLEE_3 */
    union {
        struct {
            uint32_t edge_thr_pre   : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t nr_str_pre     : 8;  /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_3;

    /* 0x370 : BLEE_4 */
    union {
        struct {
            uint32_t luma_wgt0_pre  : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt1_pre  : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_4;

    /* 0x374 : BLEE_5 */
    union {
        struct {
            uint32_t luma_wgt2_pre  : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt3_pre  : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_5;

