RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0x378 : BLEE_6 */
    union {
        struct {
            uint32_t luma_wgt4_pre  : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt5_pre  : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_6;

    /* 0x37C : BLEE_7 */
    union {
        struct {
            uint32_t luma_wgt6_pre  : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt7_pre  : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_7;

    /* 0x380 : BLEE_8 */
    union {
        struct {
            uint32_t luma_wgt8_pre  : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt9_pre  : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_8;

    /* 0x384 : BLEE_9 */
    union {
        struct {
            uint32_t luma_wgt10_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt11_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_9;

    /* 0x388 : BLEE_A */
    union {
        struct {
            uint32_t luma_wgt12_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt13_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_A;

    /* 0x38C : BLEE_B */
    union {
        struct {
            uint32_t luma_wgt14_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt15_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_B;

    /* 0x390 : BLEE_C */
    union {
        struct {
            uint32_t luma_wgt16_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt17_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_C;

    /* 0x394 : BLEE_D */
    union {
        struct {
            uint32_t luma_wgt18_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt19_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_D;

    /* 0x398 : BLEE_E */
    union {
        struct {
            uint32_t luma_wgt20_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt21_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_E;

    /* 0x39C : BLEE_F */
    union {
        struct {
            uint32_t luma_wgt22_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt23_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_F;

    /* 0x3A0 : BLEE_10 */
    union {
        struct {
            uint32_t luma_wgt24_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt25_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_10;

    /* 0x3A4 : BLEE_11 */
    union {
        struct {
            uint32_t luma_wgt26_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt27_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_11;

    /* 0x3A8 : BLEE_12 */
    union {
        struct {
            uint32_t luma_wgt28_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt29_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_12;

    /* 0x3AC : BLEE_13 */
    union {
        struct {
            uint32_t luma_wgt30_pre : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t luma_wgt31_pre : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BLEE_13;

    /* 0x3B0 : CS1 */
    union {
        struct {
            uint32_t cs1_grey_th_pre : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t cs1_enable_pre  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7    : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cs1_weight_pre  : 5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15  : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t cs1_gain_pre    : 9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CS1;

