RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0x3B4 : CS2 */
    union {
        struct {
            uint32_t cs2_grey_th_pre : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t cs2_enable_pre  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7    : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cs2_weight_pre  : 5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15  : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t cs2_gain_pre    : 9; /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CS2;

    /* 0x3b8  reserved */
    uint8_t RESERVED0x3b8[68];

    /* 0x3FC : DUMMY_CTRL */
    union {
        struct {
            uint32_t reg_bl444to422_en_w : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31       : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DUMMY_CTRL;

    /* 0x400  reserved */
    uint8_t RESERVED0x400[1280];

    /* 0x900 : WDR_0 */
    union {
        struct {
            uint32_t wdr_en_pre      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t blwdr_buf_idx_r : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2_3    : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t blwdr_w_cnt_r   : 5;  /* [ 8: 4],          r,        0x0 */
            uint32_t reserved_9_15   : 7;  /* [15: 9],       rsvd,        0x0 */
            uint32_t wdr_cs_gain_pre : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_0;

    /* 0x904 : WDR_CS_0 */
    union {
        struct {
            uint32_t wdr_cs_en_pre      : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7       : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t wdr_cs_weight_pre  : 5; /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15     : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t wdr_cs_grey_th_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31     : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CS_0;

    /* 0x908 : WDR_HIST_1 */
    union {
        struct {
            uint32_t hist_roi0_en_pre     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t hist_roi0_weight_pre : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t hist_roi1_en_pre     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23       : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t hist_roi1_weight_pre : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_1;

    /* 0x90C : WDR_HIST_2 */
    union {
        struct {
            uint32_t hist_roi2_en_pre     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t hist_roi2_weight_pre : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t hist_roi3_en_pre     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23       : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t hist_roi3_weight_pre : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_2;

    /* 0x910 : WDR_HIST_3 */
    union {
        struct {
            uint32_t hist_roi4_en_pre     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t hist_roi4_weight_pre : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t hist_roi5_en_pre     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23       : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t hist_roi5_weight_pre : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_3;

    /* 0x914 : WDR_HIST_4 */
    union {
        struct {
            uint32_t hist_roi6_en_pre     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t hist_roi6_weight_pre : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t hist_roi7_en_pre     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23       : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t hist_roi7_weight_pre : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_4;

    /* 0x918 : WDR_HIST_5 */
    union {
        struct {
            uint32_t hist_x0_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x0_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_5;

    /* 0x91C : WDR_HIST_6 */
    union {
        struct {
            uint32_t hist_y0_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y0_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_6;

    /* 0x920 : WDR_HIST_7 */
    union {
        struct {
            uint32_t hist_x1_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x1_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_7;

    /* 0x924 : WDR_HIST_8 */
    union {
        struct {
            uint32_t hist_y1_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y1_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_8;

    /* 0x928 : WDR_HIST_9 */
    union {
        struct {
            uint32_t hist_x2_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x2_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_9;

    /* 0x92C : WDR_HIST_10 */
    union {
        struct {
            uint32_t hist_y2_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y2_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_10;

    /* 0x930 : WDR_HIST_11 */
    union {
        struct {
            uint32_t hist_x3_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x3_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_11;

    /* 0x934 : WDR_HIST_12 */
    union {
        struct {
            uint32_t hist_y3_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y3_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_12;

    /* 0x938 : WDR_HIST_13 */
    union {
        struct {
            uint32_t hist_x4_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x4_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_13;

    /* 0x93C : WDR_HIST_14 */
    union {
        struct {
            uint32_t hist_y4_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y4_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_14;

    /* 0x940 : WDR_HIST_15 */
    union {
        struct {
            uint32_t hist_x5_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x5_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_15;

    /* 0x944 : WDR_HIST_16 */
    union {
        struct {
            uint32_t hist_y5_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y5_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_16;

    /* 0x948 : WDR_HIST_17 */
    union {
        struct {
            uint32_t hist_x6_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x6_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_17;

    /* 0x94C : WDR_HIST_18 */
    union {
        struct {
            uint32_t hist_y6_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y6_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_18;

    /* 0x950 : WDR_HIST_19 */
    union {
        struct {
            uint32_t hist_x7_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_x7_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_19;

    /* 0x954 : WDR_HIST_20 */
    union {
        struct {
            uint32_t hist_y7_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t hist_y7_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_HIST_20;

    /* 0x958 : REG_HIST0_64 */
    union {
        struct {
            uint32_t hist0_64_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_64;

