RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0x95C : REG_HIST1_64 */
    union {
        struct {
            uint32_t hist1_64_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_64;

    /* 0x960  reserved */
    uint8_t RESERVED0x960[160];

    /* 0xA00 : REG_HIST0_0 */
    union {
        struct {
            uint32_t hist0_0_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_0;

    /* 0xA04 : REG_HIST0_1 */
    union {
        struct {
            uint32_t hist0_1_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_1;

    /* 0xA08 : REG_HIST0_2 */
    union {
        struct {
            uint32_t hist0_2_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_2;

    /* 0xA0C : REG_HIST0_3 */
    union {
        struct {
            uint32_t hist0_3_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_3;

    /* 0xA10 : REG_HIST0_4 */
    union {
        struct {
            uint32_t hist0_4_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_4;

    /* 0xA14 : REG_HIST0_5 */
    union {
        struct {
            uint32_t hist0_5_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_5;

    /* 0xA18 : REG_HIST0_6 */
    union {
        struct {
            uint32_t hist0_6_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_6;

    /* 0xA1C : REG_HIST0_7 */
    union {
        struct {
            uint32_t hist0_7_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_7;

    /* 0xA20 : REG_HIST0_8 */
    union {
        struct {
            uint32_t hist0_8_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_8;

    /* 0xA24 : REG_HIST0_9 */
    union {
        struct {
            uint32_t hist0_9_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_9;

    /* 0xA28 : REG_HIST0_10 */
    union {
        struct {
            uint32_t hist0_10_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_10;

    /* 0xA2C : REG_HIST0_11 */
    union {
        struct {
            uint32_t hist0_11_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_11;

    /* 0xA30 : REG_HIST0_12 */
    union {
        struct {
            uint32_t hist0_12_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_12;

    /* 0xA34 : REG_HIST0_13 */
    union {
        struct {
            uint32_t hist0_13_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_13;

    /* 0xA38 : REG_HIST0_14 */
    union {
        struct {
            uint32_t hist0_14_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_14;

    /* 0xA3C : REG_HIST0_15 */
    union {
        struct {
            uint32_t hist0_15_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_15;

    /* 0xA40 : REG_HIST0_16 */
    union {
        struct {
            uint32_t hist0_16_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_16;

    /* 0xA44 : REG_HIST0_17 */
    union {
        struct {
            uint32_t hist0_17_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_17;

    /* 0xA48 : REG_HIST0_18 */
    union {
        struct {
            uint32_t hist0_18_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_18;

    /* 0xA4C : REG_HIST0_19 */
    union {
        struct {
            uint32_t hist0_19_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_19;

    /* 0xA50 : REG_HIST0_20 */
    union {
        struct {
            uint32_t hist0_20_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_20;

