RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xA54 : REG_HIST0_21 */
    union {
        struct {
            uint32_t hist0_21_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_21;

    /* 0xA58 : REG_HIST0_22 */
    union {
        struct {
            uint32_t hist0_22_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_22;

    /* 0xA5C : REG_HIST0_23 */
    union {
        struct {
            uint32_t hist0_23_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_23;

    /* 0xA60 : REG_HIST0_24 */
    union {
        struct {
            uint32_t hist0_24_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_24;

    /* 0xA64 : REG_HIST0_25 */
    union {
        struct {
            uint32_t hist0_25_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_25;

    /* 0xA68 : REG_HIST0_26 */
    union {
        struct {
            uint32_t hist0_26_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_26;

    /* 0xA6C : REG_HIST0_27 */
    union {
        struct {
            uint32_t hist0_27_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_27;

    /* 0xA70 : REG_HIST0_28 */
    union {
        struct {
            uint32_t hist0_28_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_28;

    /* 0xA74 : REG_HIST0_29 */
    union {
        struct {
            uint32_t hist0_29_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_29;

    /* 0xA78 : REG_HIST0_30 */
    union {
        struct {
            uint32_t hist0_30_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_30;

    /* 0xA7C : REG_HIST0_31 */
    union {
        struct {
            uint32_t hist0_31_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_31;

    /* 0xA80 : REG_HIST0_32 */
    union {
        struct {
            uint32_t hist0_32_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_32;

    /* 0xA84 : REG_HIST0_33 */
    union {
        struct {
            uint32_t hist0_33_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_33;

    /* 0xA88 : REG_HIST0_34 */
    union {
        struct {
            uint32_t hist0_34_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_34;

    /* 0xA8C : REG_HIST0_35 */
    union {
        struct {
            uint32_t hist0_35_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_35;

    /* 0xA90 : REG_HIST0_36 */
    union {
        struct {
            uint32_t hist0_36_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_36;

    /* 0xA94 : REG_HIST0_37 */
    union {
        struct {
            uint32_t hist0_37_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_37;

    /* 0xA98 : REG_HIST0_38 */
    union {
        struct {
            uint32_t hist0_38_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_38;

    /* 0xA9C : REG_HIST0_39 */
    union {
        struct {
            uint32_t hist0_39_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_39;

    /* 0xAA0 : REG_HIST0_40 */
    union {
        struct {
            uint32_t hist0_40_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_40;

    /* 0xAA4 : REG_HIST0_41 */
    union {
        struct {
            uint32_t hist0_41_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_41;

    /* 0xAA8 : REG_HIST0_42 */
    union {
        struct {
            uint32_t hist0_42_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_42;

    /* 0xAAC : REG_HIST0_43 */
    union {
        struct {
            uint32_t hist0_43_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_43;

    /* 0xAB0 : REG_HIST0_44 */
    union {
        struct {
            uint32_t hist0_44_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_44;

