RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xAB4 : REG_HIST0_45 */
    union {
        struct {
            uint32_t hist0_45_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_45;

    /* 0xAB8 : REG_HIST0_46 */
    union {
        struct {
            uint32_t hist0_46_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_46;

    /* 0xABC : REG_HIST0_47 */
    union {
        struct {
            uint32_t hist0_47_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_47;

    /* 0xAC0 : REG_HIST0_48 */
    union {
        struct {
            uint32_t hist0_48_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_48;

    /* 0xAC4 : REG_HIST0_49 */
    union {
        struct {
            uint32_t hist0_49_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_49;

    /* 0xAC8 : REG_HIST0_50 */
    union {
        struct {
            uint32_t hist0_50_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_50;

    /* 0xACC : REG_HIST0_51 */
    union {
        struct {
            uint32_t hist0_51_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_51;

    /* 0xAD0 : REG_HIST0_52 */
    union {
        struct {
            uint32_t hist0_52_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_52;

    /* 0xAD4 : REG_HIST0_53 */
    union {
        struct {
            uint32_t hist0_53_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_53;

    /* 0xAD8 : REG_HIST0_54 */
    union {
        struct {
            uint32_t hist0_54_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_54;

    /* 0xADC : REG_HIST0_55 */
    union {
        struct {
            uint32_t hist0_55_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_55;

    /* 0xAE0 : REG_HIST0_56 */
    union {
        struct {
            uint32_t hist0_56_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_56;

    /* 0xAE4 : REG_HIST0_57 */
    union {
        struct {
            uint32_t hist0_57_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_57;

    /* 0xAE8 : REG_HIST0_58 */
    union {
        struct {
            uint32_t hist0_58_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_58;

    /* 0xAEC : REG_HIST0_59 */
    union {
        struct {
            uint32_t hist0_59_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_59;

    /* 0xAF0 : REG_HIST0_60 */
    union {
        struct {
            uint32_t hist0_60_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_60;

    /* 0xAF4 : REG_HIST0_61 */
    union {
        struct {
            uint32_t hist0_61_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_61;

    /* 0xAF8 : REG_HIST0_62 */
    union {
        struct {
            uint32_t hist0_62_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_62;

    /* 0xAFC : REG_HIST0_63 */
    union {
        struct {
            uint32_t hist0_63_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST0_63;

    /* 0xB00 : REG_HIST1_0 */
    union {
        struct {
            uint32_t hist1_0_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_0;

    /* 0xB04 : REG_HIST1_1 */
    union {
        struct {
            uint32_t hist1_1_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_1;

    /* 0xB08 : REG_HIST1_2 */
    union {
        struct {
            uint32_t hist1_2_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_2;

    /* 0xB0C : REG_HIST1_3 */
    union {
        struct {
            uint32_t hist1_3_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_3;

