RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xB10 : REG_HIST1_4 */
    union {
        struct {
            uint32_t hist1_4_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_4;

    /* 0xB14 : REG_HIST1_5 */
    union {
        struct {
            uint32_t hist1_5_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_5;

    /* 0xB18 : REG_HIST1_6 */
    union {
        struct {
            uint32_t hist1_6_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_6;

    /* 0xB1C : REG_HIST1_7 */
    union {
        struct {
            uint32_t hist1_7_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_7;

    /* 0xB20 : REG_HIST1_8 */
    union {
        struct {
            uint32_t hist1_8_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_8;

    /* 0xB24 : REG_HIST1_9 */
    union {
        struct {
            uint32_t hist1_9_r      : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_9;

    /* 0xB28 : REG_HIST1_10 */
    union {
        struct {
            uint32_t hist1_10_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_10;

    /* 0xB2C : REG_HIST1_11 */
    union {
        struct {
            uint32_t hist1_11_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_11;

    /* 0xB30 : REG_HIST1_12 */
    union {
        struct {
            uint32_t hist1_12_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_12;

    /* 0xB34 : REG_HIST1_13 */
    union {
        struct {
            uint32_t hist1_13_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_13;

    /* 0xB38 : REG_HIST1_14 */
    union {
        struct {
            uint32_t hist1_14_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_14;

    /* 0xB3C : REG_HIST1_15 */
    union {
        struct {
            uint32_t hist1_15_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_15;

    /* 0xB40 : REG_HIST1_16 */
    union {
        struct {
            uint32_t hist1_16_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_16;

    /* 0xB44 : REG_HIST1_17 */
    union {
        struct {
            uint32_t hist1_17_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_17;

    /* 0xB48 : REG_HIST1_18 */
    union {
        struct {
            uint32_t hist1_18_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_18;

    /* 0xB4C : REG_HIST1_19 */
    union {
        struct {
            uint32_t hist1_19_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_19;

    /* 0xB50 : REG_HIST1_20 */
    union {
        struct {
            uint32_t hist1_20_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_20;

    /* 0xB54 : REG_HIST1_21 */
    union {
        struct {
            uint32_t hist1_21_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_21;

    /* 0xB58 : REG_HIST1_22 */
    union {
        struct {
            uint32_t hist1_22_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_22;

    /* 0xB5C : REG_HIST1_23 */
    union {
        struct {
            uint32_t hist1_23_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_23;

    /* 0xB60 : REG_HIST1_24 */
    union {
        struct {
            uint32_t hist1_24_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_24;

    /* 0xB64 : REG_HIST1_25 */
    union {
        struct {
            uint32_t hist1_25_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_25;

    /* 0xB68 : REG_HIST1_26 */
    union {
        struct {
            uint32_t hist1_26_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_26;

