RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xB6C : REG_HIST1_27 */
    union {
        struct {
            uint32_t hist1_27_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_27;

    /* 0xB70 : REG_HIST1_28 */
    union {
        struct {
            uint32_t hist1_28_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_28;

    /* 0xB74 : REG_HIST1_29 */
    union {
        struct {
            uint32_t hist1_29_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_29;

    /* 0xB78 : REG_HIST1_30 */
    union {
        struct {
            uint32_t hist1_30_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_30;

    /* 0xB7C : REG_HIST1_31 */
    union {
        struct {
            uint32_t hist1_31_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_31;

    /* 0xB80 : REG_HIST1_32 */
    union {
        struct {
            uint32_t hist1_32_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_32;

    /* 0xB84 : REG_HIST1_33 */
    union {
        struct {
            uint32_t hist1_33_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_33;

    /* 0xB88 : REG_HIST1_34 */
    union {
        struct {
            uint32_t hist1_34_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_34;

    /* 0xB8C : REG_HIST1_35 */
    union {
        struct {
            uint32_t hist1_35_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_35;

    /* 0xB90 : REG_HIST1_36 */
    union {
        struct {
            uint32_t hist1_36_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_36;

    /* 0xB94 : REG_HIST1_37 */
    union {
        struct {
            uint32_t hist1_37_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_37;

    /* 0xB98 : REG_HIST1_38 */
    union {
        struct {
            uint32_t hist1_38_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_38;

    /* 0xB9C : REG_HIST1_39 */
    union {
        struct {
            uint32_t hist1_39_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_39;

    /* 0xBA0 : REG_HIST1_40 */
    union {
        struct {
            uint32_t hist1_40_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_40;

    /* 0xBA4 : REG_HIST1_41 */
    union {
        struct {
            uint32_t hist1_41_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_41;

    /* 0xBA8 : REG_HIST1_42 */
    union {
        struct {
            uint32_t hist1_42_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_42;

    /* 0xBAC : REG_HIST1_43 */
    union {
        struct {
            uint32_t hist1_43_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_43;

    /* 0xBB0 : REG_HIST1_44 */
    union {
        struct {
            uint32_t hist1_44_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_44;

    /* 0xBB4 : REG_HIST1_45 */
    union {
        struct {
            uint32_t hist1_45_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_45;

    /* 0xBB8 : REG_HIST1_46 */
    union {
        struct {
            uint32_t hist1_46_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_46;

    /* 0xBBC : REG_HIST1_47 */
    union {
        struct {
            uint32_t hist1_47_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_47;

    /* 0xBC0 : REG_HIST1_48 */
    union {
        struct {
            uint32_t hist1_48_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_48;

    /* 0xBC4 : REG_HIST1_49 */
    union {
        struct {
            uint32_t hist1_49_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_49;

