RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xBC8 : REG_HIST1_50 */
    union {
        struct {
            uint32_t hist1_50_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_50;

    /* 0xBCC : REG_HIST1_51 */
    union {
        struct {
            uint32_t hist1_51_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_51;

    /* 0xBD0 : REG_HIST1_52 */
    union {
        struct {
            uint32_t hist1_52_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_52;

    /* 0xBD4 : REG_HIST1_53 */
    union {
        struct {
            uint32_t hist1_53_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_53;

    /* 0xBD8 : REG_HIST1_54 */
    union {
        struct {
            uint32_t hist1_54_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_54;

    /* 0xBDC : REG_HIST1_55 */
    union {
        struct {
            uint32_t hist1_55_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_55;

    /* 0xBE0 : REG_HIST1_56 */
    union {
        struct {
            uint32_t hist1_56_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_56;

    /* 0xBE4 : REG_HIST1_57 */
    union {
        struct {
            uint32_t hist1_57_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_57;

    /* 0xBE8 : REG_HIST1_58 */
    union {
        struct {
            uint32_t hist1_58_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_58;

    /* 0xBEC : REG_HIST1_59 */
    union {
        struct {
            uint32_t hist1_59_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_59;

    /* 0xBF0 : REG_HIST1_60 */
    union {
        struct {
            uint32_t hist1_60_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_60;

    /* 0xBF4 : REG_HIST1_61 */
    union {
        struct {
            uint32_t hist1_61_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_61;

    /* 0xBF8 : REG_HIST1_62 */
    union {
        struct {
            uint32_t hist1_62_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_62;

    /* 0xBFC : REG_HIST1_63 */
    union {
        struct {
            uint32_t hist1_63_r     : 24; /* [23: 0],          r,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } REG_HIST1_63;

    /* 0xC00 : WDR_CURVE_1 */
    union {
        struct {
            uint32_t curve_0_pre    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_1_pre    : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_1;

    /* 0xC04 : WDR_CURVE_2 */
    union {
        struct {
            uint32_t curve_2_pre    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_3_pre    : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_2;

    /* 0xC08 : WDR_CURVE_3 */
    union {
        struct {
            uint32_t curve_4_pre    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_5_pre    : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_3;

    /* 0xC0C : WDR_CURVE_4 */
    union {
        struct {
            uint32_t curve_6_pre    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_7_pre    : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_4;

    /* 0xC10 : WDR_CURVE_5 */
    union {
        struct {
            uint32_t curve_8_pre    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_9_pre    : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_5;

    /* 0xC14 : WDR_CURVE_6 */
    union {
        struct {
            uint32_t curve_10_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_11_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_6;

    /* 0xC18 : WDR_CURVE_7 */
    union {
        struct {
            uint32_t curve_12_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_13_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_7;

    /* 0xC1C : WDR_CURVE_8 */
    union {
        struct {
            uint32_t curve_14_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_15_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_8;

