RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xC68 : WDR_CURVE_27 */
    union {
        struct {
            uint32_t curve_52_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_53_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_27;

    /* 0xC6C : WDR_CURVE_28 */
    union {
        struct {
            uint32_t curve_54_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_55_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_28;

    /* 0xC70 : WDR_CURVE_29 */
    union {
        struct {
            uint32_t curve_56_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_57_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_29;

    /* 0xC74 : WDR_CURVE_30 */
    union {
        struct {
            uint32_t curve_58_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_59_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_30;

    /* 0xC78 : WDR_CURVE_31 */
    union {
        struct {
            uint32_t curve_60_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_61_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_31;

    /* 0xC7C : WDR_CURVE_32 */
    union {
        struct {
            uint32_t curve_62_pre   : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t curve_63_pre   : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_32;

    /* 0xC80 : WDR_CURVE_33 */
    union {
        struct {
            uint32_t curve_en_pre     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7     : 7;  /* [ 7: 1],       rsvd,        0x0 */
            uint32_t curve_weight_pre : 5;  /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_31   : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_CURVE_33;

    /* 0xC84 : WDR_ENH_1 */
    union {
        struct {
            uint32_t enh_en_pre       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7     : 7;  /* [ 7: 1],       rsvd,        0x0 */
            uint32_t enh_weight_pre   : 5;  /* [12: 8],        r/w,        0x0 */
            uint32_t reserved_13_15   : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t enh_y_offset_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_ENH_1;

    /* 0xC88 : WDR_ENH_2 */
    union {
        struct {
            uint32_t enh_c_gain_pre : 15; /* [14: 0],        r/w,        0x0 */
            uint32_t reserved_15    : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t enh_y_gain_pre : 15; /* [30:16],        r/w,        0x0 */
            uint32_t reserved_31    : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } WDR_ENH_2;

    /* 0xc8c  reserved */
    uint8_t RESERVED0xc8c[116];

    /* 0xD00 : BL_GAMMA_TABLE_1 */
    union {
        struct {
            uint32_t gamma_table0_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table1_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_1;

    /* 0xD04 : BL_GAMMA_TABLE_2 */
    union {
        struct {
            uint32_t gamma_table2_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table3_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_2;

    /* 0xD08 : BL_GAMMA_TABLE_3 */
    union {
        struct {
            uint32_t gamma_table4_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table5_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_3;

    /* 0xD0C : BL_GAMMA_TABLE_4 */
    union {
        struct {
            uint32_t gamma_table6_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table7_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_4;

    /* 0xD10 : BL_GAMMA_TABLE_5 */
    union {
        struct {
            uint32_t gamma_table8_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table9_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_5;

    /* 0xD14 : BL_GAMMA_TABLE_6 */
    union {
        struct {
            uint32_t gamma_table10_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table11_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_6;

    /* 0xD18 : BL_GAMMA_TABLE_7 */
    union {
        struct {
            uint32_t gamma_table12_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table13_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_7;

    /* 0xD1C : BL_GAMMA_TABLE_8 */
    union {
        struct {
            uint32_t gamma_table14_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table15_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_8;

    /* 0xD20 : BL_GAMMA_TABLE_9 */
    union {
        struct {
            uint32_t gamma_table16_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table17_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_9;

