RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xD24 : BL_GAMMA_TABLE_10 */
    union {
        struct {
            uint32_t gamma_table18_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table19_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_10;

    /* 0xD28 : BL_GAMMA_TABLE_11 */
    union {
        struct {
            uint32_t gamma_table20_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table21_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_11;

    /* 0xD2C : BL_GAMMA_TABLE_12 */
    union {
        struct {
            uint32_t gamma_table22_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table23_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_12;

    /* 0xD30 : BL_GAMMA_TABLE_13 */
    union {
        struct {
            uint32_t gamma_table24_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table25_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_13;

    /* 0xD34 : BL_GAMMA_TABLE_14 */
    union {
        struct {
            uint32_t gamma_table26_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table27_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_14;

    /* 0xD38 : BL_GAMMA_TABLE_15 */
    union {
        struct {
            uint32_t gamma_table28_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table29_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_15;

    /* 0xD3C : BL_GAMMA_TABLE_16 */
    union {
        struct {
            uint32_t gamma_table30_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table31_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_16;

    /* 0xD40 : BL_GAMMA_TABLE_17 */
    union {
        struct {
            uint32_t gamma_table32_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table33_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_17;

    /* 0xD44 : BL_GAMMA_TABLE_18 */
    union {
        struct {
            uint32_t gamma_table34_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table35_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_18;

    /* 0xD48 : BL_GAMMA_TABLE_19 */
    union {
        struct {
            uint32_t gamma_table36_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table37_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_19;

    /* 0xD4C : BL_GAMMA_TABLE_20 */
    union {
        struct {
            uint32_t gamma_table38_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table39_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_20;

    /* 0xD50 : BL_GAMMA_TABLE_21 */
    union {
        struct {
            uint32_t gamma_table40_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table41_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_21;

    /* 0xD54 : BL_GAMMA_TABLE_22 */
    union {
        struct {
            uint32_t gamma_table42_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table43_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_22;

    /* 0xD58 : BL_GAMMA_TABLE_23 */
    union {
        struct {
            uint32_t gamma_table44_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table45_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_23;

    /* 0xD5C : BL_GAMMA_TABLE_24 */
    union {
        struct {
            uint32_t gamma_table46_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table47_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_24;

    /* 0xD60 : BL_GAMMA_TABLE_25 */
    union {
        struct {
            uint32_t gamma_table48_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table49_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_25;

    /* 0xD64 : BL_GAMMA_TABLE_26 */
    union {
        struct {
            uint32_t gamma_table50_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table51_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_26;

    /* 0xD68 : BL_GAMMA_TABLE_27 */
    union {
        struct {
            uint32_t gamma_table52_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table53_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_27;

    /* 0xD6C : BL_GAMMA_TABLE_28 */
    union {
        struct {
            uint32_t gamma_table54_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table55_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_28;

