RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xDC0 : BL_GAMMA_TABLE_49 */
    union {
        struct {
            uint32_t gamma_table96_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table97_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_49;

    /* 0xDC4 : BL_GAMMA_TABLE_50 */
    union {
        struct {
            uint32_t gamma_table98_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table99_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_50;

    /* 0xDC8 : BL_GAMMA_TABLE_51 */
    union {
        struct {
            uint32_t gamma_table100_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table101_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_51;

    /* 0xDCC : BL_GAMMA_TABLE_52 */
    union {
        struct {
            uint32_t gamma_table102_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table103_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_52;

    /* 0xDD0 : BL_GAMMA_TABLE_53 */
    union {
        struct {
            uint32_t gamma_table104_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table105_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_53;

    /* 0xDD4 : BL_GAMMA_TABLE_54 */
    union {
        struct {
            uint32_t gamma_table106_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table107_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_54;

    /* 0xDD8 : BL_GAMMA_TABLE_55 */
    union {
        struct {
            uint32_t gamma_table108_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table109_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_55;

    /* 0xDDC : BL_GAMMA_TABLE_56 */
    union {
        struct {
            uint32_t gamma_table110_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table111_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_56;

    /* 0xDE0 : BL_GAMMA_TABLE_57 */
    union {
        struct {
            uint32_t gamma_table112_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table113_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_57;

    /* 0xDE4 : BL_GAMMA_TABLE_58 */
    union {
        struct {
            uint32_t gamma_table114_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table115_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_58;

    /* 0xDE8 : BL_GAMMA_TABLE_59 */
    union {
        struct {
            uint32_t gamma_table116_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table117_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_59;

    /* 0xDEC : BL_GAMMA_TABLE_60 */
    union {
        struct {
            uint32_t gamma_table118_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table119_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_60;

    /* 0xDF0 : BL_GAMMA_TABLE_61 */
    union {
        struct {
            uint32_t gamma_table120_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table121_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_61;

    /* 0xDF4 : BL_GAMMA_TABLE_62 */
    union {
        struct {
            uint32_t gamma_table122_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table123_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_62;

    /* 0xDF8 : BL_GAMMA_TABLE_63 */
    union {
        struct {
            uint32_t gamma_table124_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table125_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_63;

    /* 0xDFC : BL_GAMMA_TABLE_64 */
    union {
        struct {
            uint32_t gamma_table126_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table127_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_64;

    /* 0xE00 : BL_GAMMA_TABLE_65 */
    union {
        struct {
            uint32_t gamma_table128_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table129_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_65;

    /* 0xE04 : BL_GAMMA_TABLE_66 */
    union {
        struct {
            uint32_t gamma_table130_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table131_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_66;

    /* 0xE08 : BL_GAMMA_TABLE_67 */
    union {
        struct {
            uint32_t gamma_table132_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table133_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_67;

