RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xE94 : BL_GAMMA_TABLE_102 */
    union {
        struct {
            uint32_t gamma_table202_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table203_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_102;

    /* 0xE98 : BL_GAMMA_TABLE_103 */
    union {
        struct {
            uint32_t gamma_table204_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table205_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_103;

    /* 0xE9C : BL_GAMMA_TABLE_104 */
    union {
        struct {
            uint32_t gamma_table206_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table207_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_104;

    /* 0xEA0 : BL_GAMMA_TABLE_105 */
    union {
        struct {
            uint32_t gamma_table208_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table209_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_105;

    /* 0xEA4 : BL_GAMMA_TABLE_106 */
    union {
        struct {
            uint32_t gamma_table210_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table211_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_106;

    /* 0xEA8 : BL_GAMMA_TABLE_107 */
    union {
        struct {
            uint32_t gamma_table212_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table213_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_107;

    /* 0xEAC : BL_GAMMA_TABLE_108 */
    union {
        struct {
            uint32_t gamma_table214_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table215_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_108;

    /* 0xEB0 : BL_GAMMA_TABLE_109 */
    union {
        struct {
            uint32_t gamma_table216_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table217_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_109;

    /* 0xEB4 : BL_GAMMA_TABLE_110 */
    union {
        struct {
            uint32_t gamma_table218_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table219_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_110;

    /* 0xEB8 : BL_GAMMA_TABLE_111 */
    union {
        struct {
            uint32_t gamma_table220_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table221_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_111;

    /* 0xEBC : BL_GAMMA_TABLE_112 */
    union {
        struct {
            uint32_t gamma_table222_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table223_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_112;

    /* 0xEC0 : BL_GAMMA_TABLE_113 */
    union {
        struct {
            uint32_t gamma_table224_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table225_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_113;

    /* 0xEC4 : BL_GAMMA_TABLE_114 */
    union {
        struct {
            uint32_t gamma_table226_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table227_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_114;

