RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xEC8 : BL_GAMMA_TABLE_115 */
    union {
        struct {
            uint32_t gamma_table228_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table229_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_115;

    /* 0xECC : BL_GAMMA_TABLE_116 */
    union {
        struct {
            uint32_t gamma_table230_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table231_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_116;

    /* 0xED0 : BL_GAMMA_TABLE_117 */
    union {
        struct {
            uint32_t gamma_table232_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table233_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_117;

    /* 0xED4 : BL_GAMMA_TABLE_118 */
    union {
        struct {
            uint32_t gamma_table234_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table235_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_118;

    /* 0xED8 : BL_GAMMA_TABLE_119 */
    union {
        struct {
            uint32_t gamma_table236_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table237_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_119;

    /* 0xEDC : BL_GAMMA_TABLE_120 */
    union {
        struct {
            uint32_t gamma_table238_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table239_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_120;

    /* 0xEE0 : BL_GAMMA_TABLE_121 */
    union {
        struct {
            uint32_t gamma_table240_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table241_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_121;

    /* 0xEE4 : BL_GAMMA_TABLE_122 */
    union {
        struct {
            uint32_t gamma_table242_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table243_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_122;

    /* 0xEE8 : BL_GAMMA_TABLE_123 */
    union {
        struct {
            uint32_t gamma_table244_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table245_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_123;

    /* 0xEEC : BL_GAMMA_TABLE_124 */
    union {
        struct {
            uint32_t gamma_table246_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table247_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_124;

    /* 0xEF0 : BL_GAMMA_TABLE_125 */
    union {
        struct {
            uint32_t gamma_table248_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table249_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_125;

    /* 0xEF4 : BL_GAMMA_TABLE_126 */
    union {
        struct {
            uint32_t gamma_table250_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table251_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_126;

    /* 0xEF8 : BL_GAMMA_TABLE_127 */
    union {
        struct {
            uint32_t gamma_table252_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table253_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_127;

    /* 0xEFC : BL_GAMMA_TABLE_128 */
    union {
        struct {
            uint32_t gamma_table254_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t gamma_table255_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } BL_GAMMA_TABLE_128;

    /* 0xF00 : CC_OFFSET_0 */
    union {
        struct {
            uint32_t cc_pre_offset0_pre : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15     : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t cc_pre_offset1_pre : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_30     : 2;  /* [30:29],       rsvd,        0x0 */
            uint32_t cc_enable_pre      : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } CC_OFFSET_0;

    /* 0xF04 : CC_OFFSET_1 */
    union {
        struct {
            uint32_t cc_pre_offset2_pre  : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15      : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t cc_post_offset2_pre : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_OFFSET_1;

    /* 0xF08 : CC_OFFSET_2 */
    union {
        struct {
            uint32_t cc_post_offset0_pre : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15      : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t cc_post_offset1_pre : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_OFFSET_2;

    /* 0xF0C : CC_MATRIX_0 */
    union {
        struct {
            uint32_t cc_matrix00_pre : 12; /* [11: 0],        r/w,      0x200 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cc_matrix01_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_MATRIX_0;

    /* 0xF10 : CC_MATRIX_1 */
    union {
        struct {
            uint32_t cc_matrix10_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cc_matrix02_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_MATRIX_1;

    /* 0xF14 : CC_MATRIX_2 */
    union {
        struct {
            uint32_t cc_matrix11_pre : 12; /* [11: 0],        r/w,      0x200 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cc_matrix12_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_MATRIX_2;

    /* 0xF18 : CC_MATRIX_3 */
    union {
        struct {
            uint32_t cc_matrix20_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cc_matrix21_pre : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_MATRIX_3;

