RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_blback_reg.h
    /* 0xF1C : CC_CE_MATRIX */
    union {
        struct {
            uint32_t cc_matrix22_pre : 12; /* [11: 0],        r/w,      0x200 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ce_matrix02_pre : 12; /* [27:16],        r/w,       0x3a */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CC_CE_MATRIX;

    /* 0xF20 : CE_MATRIX_0 */
    union {
        struct {
            uint32_t ce_matrix00_pre : 12; /* [11: 0],        r/w,       0x99 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ce_matrix01_pre : 12; /* [27:16],        r/w,      0x12d */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_MATRIX_0;

    /* 0xF24 : CE_MATRIX_1 */
    union {
        struct {
            uint32_t ce_matrix10_pre : 12; /* [11: 0],        r/w,      0xfa9 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ce_matrix11_pre : 12; /* [27:16],        r/w,      0xf57 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_MATRIX_1;

    /* 0xF28 : CE_MATRIX_2 */
    union {
        struct {
            uint32_t ce_matrix20_pre : 12; /* [11: 0],        r/w,      0x100 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ce_matrix12_pre : 12; /* [27:16],        r/w,      0x100 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_MATRIX_2;

    /* 0xF2C : CE_MATRIX_3 */
    union {
        struct {
            uint32_t ce_matrix21_pre : 12; /* [11: 0],        r/w,      0xf29 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ce_matrix22_pre : 12; /* [27:16],        r/w,      0xfd7 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_MATRIX_3;

    /* 0xF30 : CE_OFFSET_0 */
    union {
        struct {
            uint32_t ce_pre_offset0_pre : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15     : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t ce_pre_offset1_pre : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31     : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_OFFSET_0;

    /* 0xF34 : CE_OFFSET_1 */
    union {
        struct {
            uint32_t ce_pre_offset2_pre  : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15      : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t ce_post_offset2_pre : 13; /* [28:16],        r/w,      0x800 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_OFFSET_1;

    /* 0xF38 : CE_OFFSET_2 */
    union {
        struct {
            uint32_t ce_post_offset0_pre : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15      : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t ce_post_offset1_pre : 13; /* [28:16],        r/w,      0x800 */
            uint32_t reserved_29_31      : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } CE_OFFSET_2;
};

typedef volatile struct dsp2_blback_reg dsp2_blback_reg_t;

#endif /* __DSP2_BLBACK_REG_H__ */
